[{"id":"GU324q60DxI","name":"2025-10-19  One Accord in Jesus' Name (Pastor Rob McNutt)","date":"2025-10-19","transcript":[["21.68","Well, last week we heard the instructions that Jesus gave to the disciples in Acts chapter 1 verse number"],["30.72","four that they were to not leave Jerusalem"],["37.12","uh but wait for the promise of the Father promise of the father. Is it the crown?"],["44.64","Is it the kingdom? No, it's not the kingdom. It's"],["51.039","power. You shall receive power when the Holy Spirit has come upon you being my"],["56.399","witnesses in Jerusalem, Judea, Samaria, to the ends of the earth. That's the"],["62.16","last word spoken by Jesus during his earthly ministry. And now we will turn"],["67.68","our attentions to the acts of the apostles. So verse number 12 and we need to know"],["74.24","well who are these guys exactly. So Acts 1:12 they returned to Jerusalem from the"],["81.36","mount of Olivet which is near Jerusalem a Sabbath day's journey. And when they entered, they went up to the upper room"],["88.479","where they were staying. Peter, James, John and Andrew, Philip and Thomas, Bartholomew and Matthew, James the son"],["95.6","of Alphus, Simon the Zealot, and Judas the son of James. These all continued"],["101.36","with one accord in prayer and supplication with the women and Mary the"],["106.479","mother of Jesus and with his brothers. So here they travel a Sabbath days"],["112.24","journey back to Jerusalem. Well, how long is that? Well, that's half a mile. According to Jewish traditions, that's"],["119.119","as far as you could walk on a Sabbath. Any further than that would be considered work and thus breaking of the"],["124.799","Sabbath. So, they're allowed to travel a half a mile. Who's in the upper room? Luke gives us the roll call. Starting"],["130.72","off, first of all, is Peter, the leader, the rock. We know"],["135.92","Peter well. He's very outspoken. Uh he'd even argue with Jesus."],["141.2","Also is James. and he too has a fiery temperament."],["146.64","Both these guys kind of argumentative and edgy and yet here they are as part of Jesus disciples and even in Jesus"],["155.12","inner circle who's also in the inner circle you remember John the beloved right those three but"],["162.72","let's be honest like these two disciples Peter and James men"],["171.12","are prone to being disagreeable hotheaded impatient, quick to speak"],["177.76","without thinking things through, quick to wrath. These disciples are young fellas. Younger fellas, probably younger"],["183.44","than Jesus. Younger guys are even more edgy, more eager to fight."],["190.72","If you are going to be a leader of men, you have to deal with some crankiness,"],["196.4","some edgginess, some questioning. Amen. I've known, man, you're into this today,"],["201.92","aren't we? I've known pastors who could not handle anyone questioning or disagreeing with"],["208.879","them. But Jesus had to deal with that within his disciples. So nobody"],["216.879","gets 100% buy in on all their ideas. So mental note, if you're aspiring to lead"],["222","something and you're pitching new ideas and you're trying to make change, you should assume you should plan for a time"],["228.64","of questioning and disagreements. You should invite questions. You should"],["234.239","foster conversations because there's no avoiding people's natural tendency to be"],["240","disagreeable. If you're going to lead people, then you're going to have to work with that"],["246.159","tendency. Our treasurer, Mark Newkerk, is beginning the uh process of building"],["252.64","the 2026 budget. I started it last month. It's a three-month process. lots"],["258.4","of meetings, discussions, questions, disagreements within the leadership and then we try to get it out to you all uh"],["264.96","two to three weeks before the annual meeting so you could have a time to question it and discuss it and argue"],["271.52","with us and that's just part of working with people. All right, let's go back to the disciples and uh meet some more of"],["278.16","them. Then we got John the beloved uh which is the brother of James Andrew who is the brother of Peter. Now he's more"],["285.28","even killed. He's he's more humble. Andrew is obviously very spiritually in tune because he was a follower of John"],["292.32","the Baptist before he was a disciple of Jesus. He seems to be able to discern the working of the Lord because he's two"],["299.04","for two in believing in both the ministry of John the Baptist and finding"],["304.479","the Messiah. Next is Philillip who's a very analytical person. He too u"],["311.759","declared we have found the Messiah and he brought Nathaniel to Jesus but he's"],["317.199","also not afraid to ask questions. He asked Jesus uh remember how are we going to feed these multitudes? Send them"],["323.68","away. We can't we can't buy food to feed all these people. He also asked Jesus show us the father. So Philip likewise"],["330.16","has a tendency to analyze and ask good questions. And we'll learn more about Philip's acts when we get further on in"],["336.479","the book. Thomas names affiliated with"],["342.08","doubting doubting Thomas. Unless I see and touch the wounds and put my hands in"],["348","the holes, I will not believe. A little bit of a contankerousness there in him too. Bartholomew also called Nathaniel."],["356.16","And uh many of these guys have more than one name which makes reading the gospels and trying to keep everyone straight a"],["361.199","little bit tricky. But Philip has brought Nathaniel to Jesus. He told Nathaniel, \"We have found the one Moses"],["367.6","wrote about in the laws and about who the prophets wrote, Jesus of Nazareth. He is the son of Joseph.\" And"],["373.12","Nathaniel's response was, \"Nazareth? Can anything good come out of Nazareth?\""],["379.039","Jesus saw Nathaniel coming from a far off. And he said, \"Uh, a true Israelite in whom there is nothing false.\" And"],["386.96","then Jesus revealed that he'd seen Nathaniel sitting under a fig tree when, uh, Philip called him. And uh when Jesus"],["394.479","called Nathaniel a true Israelite, it the Lord affirmed his character as being a godly man, receptive to the Lord's"],["401.12","work. And then Jesus simple demonstration of his omniscience uh was enough to make Bartholomew change his"],["407.36","tone. He went from can anything good come out of Nazareth to oh you are the divine son of God. You are the king of"],["412.96","Israel. And Jesus is like really? It's cuz I said I saw you under a fig tree. I will show you a whole lot more. Next is"],["419.199","Matthew. Matthew was a tax collector. He which means he probably was uh very"],["425.52","wealthy and yet he abandoned that to follow Jesus which is a very very very"],["432.639","hard thing to do to leave the things of this world security and prosperity and seek first the kingdom. Now to the"],["440.24","Pharisees and the average Israelites, Matthew would have been a horrible sinner, a thief, a traitor of his"],["447.919","people, of his countrymen. But Matthew illustrates to us the grace of God and"],["453.919","the transformative power of Jesus. And we're thankful for that, aren't we?"],["458.96","Because you can be affiliated with the horrible actions and yet be accepted by"],["464.4","Jesus and transformed. James the son of Eltheus, also called James the Lesser,"],["471.199","least known, least mentioned disciple, doesn't get any quotes in the New"],["476.639","Testament. Simon the Zealot. The Zealots were a Jewish sect that were bent on"],["482.16","revolution, looking for the Messiah who would violently overthrow over overthrow Rome. That was their vision of what the"],["489.199","Messiah was going to do. So probably Simon the Zealot would have been into the uh you know the no kings revolution"],["494.4","this weekend been all excited about that type of action political action. And"],["500.56","then we have Judas the son of James. His other name was Thaddius. Uh possibly the"],["508.08","author of the book of Jude. Lucky for him, he has another name to go by because there was another Judas who was"],["514.959","a disciple. And that was Judas who betrayed Jesus for 30 pieces of silver."],["521.36","He led the temple guard at night to where Jesus was staying so they could arrest him in secret. And this helped"],["527.92","the Sanhedrin avoid the crowds. And that Judas will forever be known as the"],["533.519","betrayer. And that is still on the minds of the disciples which we'll see later"],["539.04","on in this chapter. But the naming of the disciples is how the book of acts begins. These are people whose faith and"],["546","works were foundational to who we are, what we believe, and how we live today."],["551.44","Take for example the detail here. We see in verse 14 that they all continued."],["556.88","Here's the action. with one accord in prayer and supplication with the women"],["562","and Mary and the mother of Jesus and with his brothers. So the detail of the"],["567.839","inclusiveness of the women, I think that's very interesting. Luke always uh speaks the most about the women and the"],["573.519","ladies that were in and around the the uh the entourage of Jesus. It it's it's"],["578.959","interesting because in the ancient world prior to Christianity, women were very"],["584.08","much viewed as inferior to men. The Greek wives were to be at home and"],["589.12","completely separate from the everyday comingings and goings of the their husbands and the men in society. Roman"],["594.72","men had legal guardianship over their wives which meant the women had limited"],["600.16","rights and freedoms and often were treated as property. Jesus involvement"],["605.279","and inclusion of women in his ministry showcased what Paul instructs the church"],["610.32","in Galatians where he says there's neither Jew nor Greek. There's neither slave nor free. There is neither male or"],["615.76","female. We are all one in Christ Jesus. One in Christ. Jesus illustrated or"],["623.2","instructed in Matthew chapter 19. He said uh let the little children come to me and forbid them not for such is the"],["629.92","kingdom of God. And the gospel is for all of humanity regardless of age or"],["635.76","gender or nationality. The western cultures understanding that all men are"],["641.2","created equal. There is liberty and justice for all. Women are to have equal rights. These values find their genesis"],["648.64","in the word of the Lord, especially the words and the acts of Jesus. Now, these"],["655.2","men and women are foundational to what we're doing here 1,970 years later."],["660.959","Their faith and works are examples to us. And even their names are imitated by"],["666.16","us. We use the same names. How many John's are here? It's the most popular name in this church is John. And we got"],["673.2","lots of John's. Uh Mary's, we have Mary's in this church. We have Peter's. We got James's. We got Jimmy's, right?"],["681.36","Andrews, Phillips, Thomas', Matthews. We had a Nate up here this morning."],["686.48","Nathaniel, right? Any Judas's?"],["691.839","That was once a very popular name in uh Israel. And so much so there was two disciples named Judas. the other um was"],["700.16","the author um of a book in the Bible. But uh you know it was there was it was"],["706.24","kind of complicated with the uh authors of the gospels. They had to kind of"],["711.279","qualify this is Judas the Saggariat speaking or this is the other Judas. But can you imagine having a name that"],["716.56","everyone affiliates with some someone who's evil? Now I I'm not sure you've noticed but I"],["724.72","have a rather unique last name. She knows that many people never heard of the name McNut until they met me. And"],["732.32","that's okay because it's given me the opportunity to control the branding."],["738.48","What comes to mind? What attributes do you associate with the name McNut and uh"],["744.72","I I get to control the narrative since there's so few of us. About eight years ago was one afternoon at the fair."],["750.56","Illean and I were at the hall where they uh you know stuff all the nonprofits out of the way where we can just not bother"],["756.32","anybody. And we were over there in the little hall and we were at the KCA table, Kings Christian Academy. And uh"],["762.72","I'm standing there and we're handing out, you know, I don't know why we're handing out stuff. And then um I look"],["768","over here and buddy beside me, he's got a name tag on and it says uh Pastor Tim"],["773.36","McNut. And I says uh Pastor McNut. Well, that's my name too. I'm Pastor Rob"],["779.36","McNut. and he said, \"I have heard of you.\" And uh we struck up a conversation. He was the pastor at the"],["785.279","uh Charlotte Hall Lutheran Church. And uh he says to me as we're talking, he"],["790.56","said, \"Well, do you happen to know Eugene McNut?\" He was a pastor from Canada who I met uh he was in the uh uh"],["798.24","Christian Missionary Alliance uh denomination. And he said, \"I met that guy and we used to always joke that we were related.\" And I said, \"Well, as a"],["804.959","matter of fact, I have heard of Pastor Eugene Mcnut. He is the first cousin to my father, Pastor Bob Mcnut. Have you"],["812.639","noticed the theme for Pastor McNuts? Now, the other Mcnut"],["819.04","I used to hear a lot about when I was growing up was a fellow whose name was Tal McNut. Anybody ever heard of Tal"],["824.639","McNut? Okay. He he he was a young when I was young in ministry, people would say,"],["830.16","\"You are you related to Tal?\" Uh, his name is Tolbert. Tolbert Tal Mcnut was"],["835.519","born in 1923 in New York City. Uh served in World War II, stationed in Japan. He"],["841.68","founded Tokyo Youth for Christ Ministries and Tal came home from the war and he devoted his life to youth"],["849.279","ministry, directed Boston Youth for Christ, started teen Bible clubs, did"],["854.8","evangelistic crusades all through New England up into the Maritime Provinces. He founded the Happy Tea Ranch in New"],["861.68","Hampshire, which is now called the uh White Mountain Ranch. I don't know if Becky, you've heard of the White Mountain Ranch, but he was in full-time"],["868.16","ministry until he passed away in 2010. He was 87 years old. You can Google Tal"],["874.56","McNutton and find all that out. So, while I do have a rare name that not many people heard of before, uh folks"],["881.519","who have known it have affiliated it with ministers, people trying to serve"],["886.56","the Lord. Well, that's better than Judas. The other Judas, he had to short his name to Jude. And even though he wrote a"],["892.72","book in the Bible, the name Judas is not affiliated with the good Judas. It's always affiliated with the traitor. The"],["898.959","traitor. You know, there's a lot of a lot of pregnant moms here, a lot of babies being born. And I say, \"Oh,"],["904.079","what's the baby's name?\" And nobody ever says, \"Uh, we named him Benedict Arnold.\""],["910.399","Not a lot of kids named Adolf. What does your name get affiliated with?"],["919.199","What is your reputation? Is it a name that makes people say, \"That's a guy I would trust. That that dude, he's"],["926","dependable. That gal, you know, she is so loving and kind, always giving and"],["931.04","sacrificing. That that person's wise, very respectable.\" Or does it have a"],["936.16","poor affiliation? You know, he he's a mess. He's very unreliable."],["942.56","You know, she's such a drama queen, you know, self-centered."],["949.279","Not everything affiliated with my name is positive. I've been described as an aggressive"],["955.6","driver. That's my wife's. She affiliates with my name. Very competitive. Uh some accuse"],["962.959","me of stretching rules in order to win. Maybe. Or maybe they're just sore losers. I mean,"],["971.44","forgetful that that's an affiliation I I can never live down. Not great attention"],["977.04","to details. So, there's a lot of poor qualities for me to continue to work on."],["982.48","If we would like our names to have positive affiliations, then we have to actually be about those character"],["988.88","qualities. We need to be doing things that we would like to be affiliated with. If we want to be loving and kind"],["995.6","and patient and meek, then those aren't those aren't things that we naturally are. Those are fruits of the spirit."],["1004.16","So, we need the holy spirit to help us generate those things in our lives. We"],["1010.24","need the holy spirit to change us to be these things. Uh they they all continued uh all the list of the disciples their"],["1017.04","names in one accord in prayer and supplication. Uh and and that was the"],["1022.639","other observation I made of the the the description Luke uses. One accord homo"],["1030.16","is the Greek word. It means unanimously. And I noticed that Luke really likes"],["1035.439","this word. He uses it 12 times throughout the book. And sometimes it's describing the work of the apostles in"],["1041.439","the church, how they were together in one accord. We see in Acts chapter 2 as"],["1046.48","an example, they continued daily with one accord in the temple breaking bread from house to house. They ate their"],["1051.84","foods with gladness and simplicity of heart. And then likewise uh through the hands of the apostles, many signs and"],["1056.96","wonders were done among the people and all the growing church was in one accord"],["1062.08","in the temple at Solomon's porch. Other times, one accord is used to describe the actions of the Pharisees, the"],["1067.84","religious leaders of the nation of Israel. when they were attacking the apostles, they were doing it uh in one"],["1075.039","accord. And uh and then we see the mob would react uh in one accord when they"],["1081.28","were uh uh violently attacking the apostles. But we see in Acts chapter 18, Galileo was a protocol uh and the Jews"],["1089.12","were in one accord when they rose up against Paul and brought him to the judgment seat. And so then we see in"],["1095.2","chapter 19, once again, the whole city was filled with confusion. And this is uh when they all were uh aggravated and"],["1102.08","they grabbed uh Gallas and uh this fellow's name who's a Macedonian and they were Paul's companions and they"],["1108.799","arrested them and they were all spooled off. They had this mom mentality where they were all acting in one accord. The"],["1116.16","point being in whatever situation that phrase is used being in one accord always provided strength and power to"],["1123.2","the group. There's a level of overwhelming force behind those who are"],["1128.64","standing in one accord. Due to the fact that you"],["1133.76","Luke uses the term often, I feel that it illustrates to us a biblical principle that is spoken of. First of all, we see"],["1139.679","it in wisdom literature. Ecclesiastes chapter 4, the one may be overpowered, two can defend themselves, a threest"],["1147.28","string cord is not quickly broken. We see it there and then we see it re repeated in the biblical principles"],["1153.919","mandated in the letters of the apostle Paul where he says to the church I therefore the prisoner of the Lord"],["1160","beseech you walk worthy of your calling which you're called. Here's how he describes that calling with all"],["1165.12","loneliness and gentleness longsuffering bearing one another in love endeavoring"],["1170.16","to keep the unity of the spirit in the bond of peace. There is one body and one"],["1177.2","spirit just as you are called by one hope. your calling. One Lord, one faith,"],["1182.24","one baptism, one God and father of all who is above all through all and in you"],["1187.52","all. Paul teaches and then we also see this reflected in what Jesus prays for his"],["1195.84","followers to have this. I do not pray for these alone but also those who will believe in me through their word. So"],["1201.679","he's praying for his disciples but he says not just for them but for those who believe because of their word. So that's"],["1207.039","who that's us. Jesus is praying for us. What does he pray for us? Verse 21. That"],["1214.559","they may all be one as you, Father, are in me and I in you. That they may also"],["1220.72","be one in us. That the world may believe that you sent me. And the glory which"],["1227.12","you gave me, I have given them that they may be one just as we are one. I in them and you in me. and they may be made"],["1234.799","perfect in one that the world may know that you sent me and have loved them as"],["1240","you loved me. The reoccurring theme in scripture is unity oneness."],["1247.28","One of the challenges of coming back after being away for a whole month was gathering everyone back together to"],["1254.08","ensure that we are all still in one accord. We elders hadn't met since"],["1259.76","August and there was a lot of things to catch up on and some discussions and decisions had gotten put on hold and we"],["1265.28","needed to review and reaffirm our plans and I had to catch up with the staff and"],["1270.64","with all the ministry leaders and with people who needed reassurance that we are still united. Got to make sure we're"],["1277.679","all on the same page. We value unity and I wanted to"],["1283.6","illustrate how we endeavor to accomplish that here at Faith Bible Church for you to better understand the philosophies of"],["1289.76","leadership that we are adhering to. So within our leadership, we operate as a"],["1295.039","plurality of elders. So it's not just, you know, Pastor Rob's the big cheese and pastor Mark does everything he says."],["1301.679","No, not at all. We are a plurality meaning we all the different elders are working together to in harmony to make"],["1309.2","decisions. Uh we have leadership classes. We do three classes. Uh one's on character of a biblical leader uh on"],["1316.88","the doctrines of the church and then uh we do a hermeneutic class which pastor"],["1321.919","Greg teaches uh principles of biblical interpretation. And this training helps"],["1327.039","all the leadership coming into the church to be on the same page. the leadership can all understand the"],["1333.28","biblical principles and so that we can all work together in one accord, not"],["1339.039","divided. Right? Well, I pledge allegiance to the flag of the United States of America and to the republic for which it stands, one nation under"],["1346.64","God, indivisible. Well, that's no longer an accurate"],["1352.08","description, now is it? We are very divided. There is practically nothing"],["1359.919","that people agree on anymore. And a house divided against itself"],["1364.96","cannot stand. The prophet Amos said this in uh Amos chapter 3. He said, \"Can two"],["1371.6","walk together unless they agree?\" The mistake being na made in the nation"],["1378.64","is also made in the church. The churches of America are not of one accord."],["1384.48","Consequently, the people of faith have received mixed messages, contradictory messages, and there's very little I can"],["1391.12","do about the churches in America. But a Faith Bible Church, we have to be of one"],["1396.32","accord. It's easy to say. It's not so easy to do. In order to make it a reality, it"],["1403.12","requires commitment to the concept of unity, indivisible."],["1409.6","So, as an elder board, we endeavor to make decisions that everyone agrees with. We don't take votes in the"],["1416.72","majority rules, right? So, you know, well, it's 5 to three, so you know, never mind, Pastor Mark and John"],["1422.799","Murdoch, just be quiet. We voted you down, right? That's not how we operate."],["1428","Uh we if one if one elder has a concern with something we're doing, uh we don't"],["1433.76","press the issue. we will we will pause and we'll take time to listen and reflect and we'll even go away from"],["1439.12","meetings and pray about something dive into the biblical instructions and seek"],["1444.24","to apply them accurately to the scenario that we're debating since we believe in"],["1449.52","the concept of one accord. We want uh unanimous decisions. We want everyone"],["1455.76","agreeing and satisfied with the decision. And as we strive for this at"],["1461.52","every level of relationship in this church, that's what we're aiming for."],["1466.64","But it's not easy, is it? Because, you know, people got strong opinions on different issues. There's uh opinions on"],["1473.76","rights and freedoms and people got opinions on, you know, proper medical care and educational options. And"],["1480.24","there's opinions on outreach and community interaction, opinions about politics, about finances. There's"],["1486.32","opinions about music. There's opinions galore. And everyone's entitled to their opinions. But when the"],["1493.84","opinions drive us to division and disunityity, that's when we have to"],["1498.96","evaluate the motives. Our mission is simple to glorify God by"],["1504.159","sharing the good news of Christ in establishing believers to pursue God's plans for their lives. And our"],["1511.76","authoritative foundation for what we're doing is the word of God. 2 Timothy"],["1517.52","2:16-1 17 says, \"All scripture is given by inspiration of God and is profitable for"],["1524.24","doctrine, reproof, correction, instruction in righteousness, that the"],["1529.679","man of God, the woman of God might be complete, thoroughly equipped for every"],["1535.76","good work.\" The word of God is the standard that determines what is right and wrong, what is true and what is"],["1542.72","false. And if we are steadfast in our commitment to love God and keep his commandments, that value will pull us"],["1550.88","together, endeavoring to keep the unity of the spirit in the bond of peace. The"],["1557.2","enemy uses the strategy divide and conquer. And it works so well"],["1564.159","to break up homes, communities, societies, churches."],["1569.679","We learned when we were over in Germany that the Germans pay a tax. They called"],["1574.88","it a church tax. They pay a a tax comes out of their income and it goes directly"],["1580.32","to the church. And uh wow, you know, wow, the and it's not all churches. It's"],["1585.679","the Lutheran church. So, well, man, the Lutheran church, they must really be very effective uh with all that money."],["1592.159","They're probably doing great things for God. Nope. They are ineffective and almost dead. The buildings are empty and"],["1599.36","uh they don't even let anybody else use them. No power because of false doctrine"],["1604.48","that the false teachers have brought in and rendered those churches powerless, void of the working of the Holy Spirit,"],["1612.32","divided from truth and from God and the people from one another. We have to"],["1617.76","strive for unity in our marriages, our homes, and our church. And Lord willing,"],["1624.24","we could then be a light to a divided nation. And we could show them the truth. The"],["1632.24","world's always at war, isn't it? They always talk about peace deals and they never work out. But that shouldn't be"],["1638.799","because we are all we're all one race, right? We are all made in the image of God. We are all loved by our heavenly"],["1645.679","father. God loves the world and Christ died for for all. The world just can't see the"],["1653.36","devil's schemes to divide and conquer. But we can. So we have to stand firm"],["1658.48","against them because of offenses, because of disagreements. We will always"],["1663.52","be tempted and tested to pull away, to break fellowship. It takes great effort,"],["1671.279","spiritual maturity, love, and forgiveness to be in one accord."],["1677.36","Some of you today, you know, like you you barely made it to church together, right? That was a stressful driving the"],["1684.24","car. You know, some people don't even want to sit together. It's a spiritual battle. It's a spiritual battle that"],["1691.2","we're fighting. Satan wants us divided. And Jesus prays that we would all be"],["1696.559","one. So each and every one of us must be responsible"],["1701.6","for the part that we play in being of one accord. We must understand the awesome victories that are achieved when"],["1708.24","we are and the ways that it honors and blesses our heavenly father and how he works in and through us when we all come"],["1714.559","together as one body. We all have a part to play. We all have a role to fulfill in the body. The disciples were in one"],["1721.6","accord in prayer and supplication. Why do we why do we take this, you know,"],["1727.919","long prayer time during our services and, you know, boy oh boy, sometimes, yeah, people get wordy and it turns into"],["1734.08","story time and somebody preaches a sermon in the mid mid mid prayer time"],["1739.52","can drag out. Well, maybe, but there's power in praying in one accord. Praying"],["1745.279","for one another. It takes time and and intentionality to fulfill the command to"],["1750.64","be of one accord. and listening here and and and sitting here and listening to people's needs. That's an investment of"],["1757.76","time. But we believe it is an act of faith. What we do here on Sunday mornings is what the followers of Jesus"],["1765.2","were doing in the upper room, right? When we sing praises in one accord, uh"],["1770.799","when we are uh praying together in one accord, we're in one accord. When we"],["1776","give our tithes and offerings for the furtherance of the gospel, we're in one accord. When we listen to the preaching of the word and we seek to apply it to"],["1782.88","our everyday lives and in and through this God's presence will fill us. God,"],["1789.2","the Holy Spirit inhabits the praises of his people. The Holy Spirit falls upon"],["1794.48","the congregation, convicting us of sin and regenerating our spirits. The Holy Spirit restores us and sanctifies us,"],["1802.24","empowering us, guiding us to a furtherance obedience and service with the gifts that the Holy Spirit bestows"],["1808.48","upon us. And one day when our time is over and our work on here is done, the Holy Spirit resurrects us to new life"],["1816","and all of that is happening when we come together in one accord."],["1823.279","I was uh really planning to finish this chapter this week, but uh once I got"],["1828.64","through all that, I was like, \"Oo, that's that's enough.\" So, we're going to uh break there, and you'll have to come back uh next week to find out"],["1835.279","what's next. But two things we learned today. what you want your name to be affiliated with, you'll have to be"],["1841.679","intentional about cultivating in your own life. And what's the other thing we learned? The importance and responsibility that we all have to"],["1847.919","foster a community where we're in one accord. Come back next week and we'll"],["1853.039","learn what decisions and actions the apostles made being in one accord. Lord"],["1858.08","Jesus, we thank you for these observations. We thank you for the uh way that we can see uh the reoccurring"],["1864.399","themes in scripture. we can pick them out and then we can look at our lives and we can say well how am I applying"],["1870.08","that? Am I am I being a a someone whose name is affiliated with things that are"],["1875.279","honoring and glorifying to God. Uh is there things that I need to change and improve in my life? And also then we can"],["1881.52","we can look at at the at the the concept of being of one accord and say how am I"],["1887.279","orienting my life around a way that is uh pleasing to my heavenly father that we are joining together not being"],["1893.679","divided but being united uh and one lord one faith one baptism. Give us uh the"],["1901.12","spirit and the heart to continue to work on these things. Guide us we pray in Jesus name. Amen."]]}]