[{"id":"GU324q60DxI","name":"2025-10-19  One Accord in Jesus' Name (Pastor Rob McNutt)","date":"2025-10-19","transcript":[["21.68","Well, last week we heard the instructions that Jesus gave to the disciples in Acts chapter 1 verse number"],["30.72","four that they were to not leave Jerusalem"],["37.12","uh but wait for the promise of the Father promise of the father. Is it the crown?"],["44.64","Is it the kingdom? No, it's not the kingdom. It's"],["51.039","power. You shall receive power when the Holy Spirit has come upon you being my"],["56.399","witnesses in Jerusalem, Judea, Samaria, to the ends of the earth. That's the"],["62.16","last word spoken by Jesus during his earthly ministry. And now we will turn"],["67.68","our attentions to the acts of the apostles. So verse number 12 and we need to know"],["74.24","well who are these guys exactly. So Acts 1:12 they returned to Jerusalem from the"],["81.36","mount of Olivet which is near Jerusalem a Sabbath day's journey. And when they entered, they went up to the upper room"],["88.479","where they were staying. Peter, James, John and Andrew, Philip and Thomas, Bartholomew and Matthew, James the son"],["95.6","of Alphus, Simon the Zealot, and Judas the son of James. These all continued"],["101.36","with one accord in prayer and supplication with the women and Mary the"],["106.479","mother of Jesus and with his brothers. So here they travel a Sabbath days"],["112.24","journey back to Jerusalem. Well, how long is that? Well, that's half a mile. According to Jewish traditions, that's"],["119.119","as far as you could walk on a Sabbath. Any further than that would be considered work and thus breaking of the"],["124.799","Sabbath. So, they're allowed to travel a half a mile. Who's in the upper room? Luke gives us the roll call. Starting"],["130.72","off, first of all, is Peter, the leader, the rock. We know"],["135.92","Peter well. He's very outspoken. Uh he'd even argue with Jesus."],["141.2","Also is James. and he too has a fiery temperament."],["146.64","Both these guys kind of argumentative and edgy and yet here they are as part of Jesus disciples and even in Jesus"],["155.12","inner circle who's also in the inner circle you remember John the beloved right those three but"],["162.72","let's be honest like these two disciples Peter and James men"],["171.12","are prone to being disagreeable hotheaded impatient, quick to speak"],["177.76","without thinking things through, quick to wrath. These disciples are young fellas. Younger fellas, probably younger"],["183.44","than Jesus. Younger guys are even more edgy, more eager to fight."],["190.72","If you are going to be a leader of men, you have to deal with some crankiness,"],["196.4","some edgginess, some questioning. Amen. I've known, man, you're into this today,"],["201.92","aren't we? I've known pastors who could not handle anyone questioning or disagreeing with"],["208.879","them. But Jesus had to deal with that within his disciples. So nobody"],["216.879","gets 100% buy in on all their ideas. So mental note, if you're aspiring to lead"],["222","something and you're pitching new ideas and you're trying to make change, you should assume you should plan for a time"],["228.64","of questioning and disagreements. You should invite questions. You should"],["234.239","foster conversations because there's no avoiding people's natural tendency to be"],["240","disagreeable. If you're going to lead people, then you're going to have to work with that"],["246.159","tendency. Our treasurer, Mark Newkerk, is beginning the uh process of building"],["252.64","the 2026 budget. I started it last month. It's a three-month process. lots"],["258.4","of meetings, discussions, questions, disagreements within the leadership and then we try to get it out to you all uh"],["264.96","two to three weeks before the annual meeting so you could have a time to question it and discuss it and argue"],["271.52","with us and that's just part of working with people. All right, let's go back to the disciples and uh meet some more of"],["278.16","them. Then we got John the beloved uh which is the brother of James Andrew who is the brother of Peter. Now he's more"],["285.28","even killed. He's he's more humble. Andrew is obviously very spiritually in tune because he was a follower of John"],["292.32","the Baptist before he was a disciple of Jesus. He seems to be able to discern the working of the Lord because he's two"],["299.04","for two in believing in both the ministry of John the Baptist and finding"],["304.479","the Messiah. Next is Philillip who's a very analytical person. He too u"],["311.759","declared we have found the Messiah and he brought Nathaniel to Jesus but he's"],["317.199","also not afraid to ask questions. He asked Jesus uh remember how are we going to feed these multitudes? Send them"],["323.68","away. We can't we can't buy food to feed all these people. He also asked Jesus show us the father. So Philip likewise"],["330.16","has a tendency to analyze and ask good questions. And we'll learn more about Philip's acts when we get further on in"],["336.479","the book. Thomas names affiliated with"],["342.08","doubting doubting Thomas. Unless I see and touch the wounds and put my hands in"],["348","the holes, I will not believe. A little bit of a contankerousness there in him too. Bartholomew also called Nathaniel."],["356.16","And uh many of these guys have more than one name which makes reading the gospels and trying to keep everyone straight a"],["361.199","little bit tricky. But Philip has brought Nathaniel to Jesus. He told Nathaniel, \"We have found the one Moses"],["367.6","wrote about in the laws and about who the prophets wrote, Jesus of Nazareth. He is the son of Joseph.\" And"],["373.12","Nathaniel's response was, \"Nazareth? Can anything good come out of Nazareth?\""],["379.039","Jesus saw Nathaniel coming from a far off. And he said, \"Uh, a true Israelite in whom there is nothing false.\" And"],["386.96","then Jesus revealed that he'd seen Nathaniel sitting under a fig tree when, uh, Philip called him. And uh when Jesus"],["394.479","called Nathaniel a true Israelite, it the Lord affirmed his character as being a godly man, receptive to the Lord's"],["401.12","work. And then Jesus simple demonstration of his omniscience uh was enough to make Bartholomew change his"],["407.36","tone. He went from can anything good come out of Nazareth to oh you are the divine son of God. You are the king of"],["412.96","Israel. And Jesus is like really? It's cuz I said I saw you under a fig tree. I will show you a whole lot more. Next is"],["419.199","Matthew. Matthew was a tax collector. He which means he probably was uh very"],["425.52","wealthy and yet he abandoned that to follow Jesus which is a very very very"],["432.639","hard thing to do to leave the things of this world security and prosperity and seek first the kingdom. Now to the"],["440.24","Pharisees and the average Israelites, Matthew would have been a horrible sinner, a thief, a traitor of his"],["447.919","people, of his countrymen. But Matthew illustrates to us the grace of God and"],["453.919","the transformative power of Jesus. And we're thankful for that, aren't we?"],["458.96","Because you can be affiliated with the horrible actions and yet be accepted by"],["464.4","Jesus and transformed. James the son of Eltheus, also called James the Lesser,"],["471.199","least known, least mentioned disciple, doesn't get any quotes in the New"],["476.639","Testament. Simon the Zealot. The Zealots were a Jewish sect that were bent on"],["482.16","revolution, looking for the Messiah who would violently overthrow over overthrow Rome. That was their vision of what the"],["489.199","Messiah was going to do. So probably Simon the Zealot would have been into the uh you know the no kings revolution"],["494.4","this weekend been all excited about that type of action political action. And"],["500.56","then we have Judas the son of James. His other name was Thaddius. Uh possibly the"],["508.08","author of the book of Jude. Lucky for him, he has another name to go by because there was another Judas who was"],["514.959","a disciple. And that was Judas who betrayed Jesus for 30 pieces of silver."],["521.36","He led the temple guard at night to where Jesus was staying so they could arrest him in secret. And this helped"],["527.92","the Sanhedrin avoid the crowds. And that Judas will forever be known as the"],["533.519","betrayer. And that is still on the minds of the disciples which we'll see later"],["539.04","on in this chapter. But the naming of the disciples is how the book of acts begins. These are people whose faith and"],["546","works were foundational to who we are, what we believe, and how we live today."],["551.44","Take for example the detail here. We see in verse 14 that they all continued."],["556.88","Here's the action. with one accord in prayer and supplication with the women"],["562","and Mary and the mother of Jesus and with his brothers. So the detail of the"],["567.839","inclusiveness of the women, I think that's very interesting. Luke always uh speaks the most about the women and the"],["573.519","ladies that were in and around the the uh the entourage of Jesus. It it's it's"],["578.959","interesting because in the ancient world prior to Christianity, women were very"],["584.08","much viewed as inferior to men. The Greek wives were to be at home and"],["589.12","completely separate from the everyday comingings and goings of the their husbands and the men in society. Roman"],["594.72","men had legal guardianship over their wives which meant the women had limited"],["600.16","rights and freedoms and often were treated as property. Jesus involvement"],["605.279","and inclusion of women in his ministry showcased what Paul instructs the church"],["610.32","in Galatians where he says there's neither Jew nor Greek. There's neither slave nor free. There is neither male or"],["615.76","female. We are all one in Christ Jesus. One in Christ. Jesus illustrated or"],["623.2","instructed in Matthew chapter 19. He said uh let the little children come to me and forbid them not for such is the"],["629.92","kingdom of God. And the gospel is for all of humanity regardless of age or"],["635.76","gender or nationality. The western cultures understanding that all men are"],["641.2","created equal. There is liberty and justice for all. Women are to have equal rights. These values find their genesis"],["648.64","in the word of the Lord, especially the words and the acts of Jesus. Now, these"],["655.2","men and women are foundational to what we're doing here 1,970 years later."],["660.959","Their faith and works are examples to us. And even their names are imitated by"],["666.16","us. We use the same names. How many John's are here? It's the most popular name in this church is John. And we got"],["673.2","lots of John's. Uh Mary's, we have Mary's in this church. We have Peter's. We got James's. We got Jimmy's, right?"],["681.36","Andrews, Phillips, Thomas', Matthews. We had a Nate up here this morning."],["686.48","Nathaniel, right? Any Judas's?"],["691.839","That was once a very popular name in uh Israel. And so much so there was two disciples named Judas. the other um was"],["700.16","the author um of a book in the Bible. But uh you know it was there was it was"],["706.24","kind of complicated with the uh authors of the gospels. They had to kind of"],["711.279","qualify this is Judas the Saggariat speaking or this is the other Judas. But can you imagine having a name that"],["716.56","everyone affiliates with some someone who's evil? Now I I'm not sure you've noticed but I"],["724.72","have a rather unique last name. She knows that many people never heard of the name McNut until they met me. And"],["732.32","that's okay because it's given me the opportunity to control the branding."],["738.48","What comes to mind? What attributes do you associate with the name McNut and uh"],["744.72","I I get to control the narrative since there's so few of us. About eight years ago was one afternoon at the fair."],["750.56","Illean and I were at the hall where they uh you know stuff all the nonprofits out of the way where we can just not bother"],["756.32","anybody. And we were over there in the little hall and we were at the KCA table, Kings Christian Academy. And uh"],["762.72","I'm standing there and we're handing out, you know, I don't know why we're handing out stuff. And then um I look"],["768","over here and buddy beside me, he's got a name tag on and it says uh Pastor Tim"],["773.36","McNut. And I says uh Pastor McNut. Well, that's my name too. I'm Pastor Rob"],["779.36","McNut. and he said, \"I have heard of you.\" And uh we struck up a conversation. He was the pastor at the"],["785.279","uh Charlotte Hall Lutheran Church. And uh he says to me as we're talking, he"],["790.56","said, \"Well, do you happen to know Eugene McNut?\" He was a pastor from Canada who I met uh he was in the uh uh"],["798.24","Christian Missionary Alliance uh denomination. And he said, \"I met that guy and we used to always joke that we were related.\" And I said, \"Well, as a"],["804.959","matter of fact, I have heard of Pastor Eugene Mcnut. He is the first cousin to my father, Pastor Bob Mcnut. Have you"],["812.639","noticed the theme for Pastor McNuts? Now, the other Mcnut"],["819.04","I used to hear a lot about when I was growing up was a fellow whose name was Tal McNut. Anybody ever heard of Tal"],["824.639","McNut? Okay. He he he was a young when I was young in ministry, people would say,"],["830.16","\"You are you related to Tal?\" Uh, his name is Tolbert. Tolbert Tal Mcnut was"],["835.519","born in 1923 in New York City. Uh served in World War II, stationed in Japan. He"],["841.68","founded Tokyo Youth for Christ Ministries and Tal came home from the war and he devoted his life to youth"],["849.279","ministry, directed Boston Youth for Christ, started teen Bible clubs, did"],["854.8","evangelistic crusades all through New England up into the Maritime Provinces. He founded the Happy Tea Ranch in New"],["861.68","Hampshire, which is now called the uh White Mountain Ranch. I don't know if Becky, you've heard of the White Mountain Ranch, but he was in full-time"],["868.16","ministry until he passed away in 2010. He was 87 years old. You can Google Tal"],["874.56","McNutton and find all that out. So, while I do have a rare name that not many people heard of before, uh folks"],["881.519","who have known it have affiliated it with ministers, people trying to serve"],["886.56","the Lord. Well, that's better than Judas. The other Judas, he had to short his name to Jude. And even though he wrote a"],["892.72","book in the Bible, the name Judas is not affiliated with the good Judas. It's always affiliated with the traitor. The"],["898.959","traitor. You know, there's a lot of a lot of pregnant moms here, a lot of babies being born. And I say, \"Oh,"],["904.079","what's the baby's name?\" And nobody ever says, \"Uh, we named him Benedict Arnold.\""],["910.399","Not a lot of kids named Adolf. What does your name get affiliated with?"],["919.199","What is your reputation? Is it a name that makes people say, \"That's a guy I would trust. That that dude, he's"],["926","dependable. That gal, you know, she is so loving and kind, always giving and"],["931.04","sacrificing. That that person's wise, very respectable.\" Or does it have a"],["936.16","poor affiliation? You know, he he's a mess. He's very unreliable."],["942.56","You know, she's such a drama queen, you know, self-centered."],["949.279","Not everything affiliated with my name is positive. I've been described as an aggressive"],["955.6","driver. That's my wife's. She affiliates with my name. Very competitive. Uh some accuse"],["962.959","me of stretching rules in order to win. Maybe. Or maybe they're just sore losers. I mean,"],["971.44","forgetful that that's an affiliation I I can never live down. Not great attention"],["977.04","to details. So, there's a lot of poor qualities for me to continue to work on."],["982.48","If we would like our names to have positive affiliations, then we have to actually be about those character"],["988.88","qualities. We need to be doing things that we would like to be affiliated with. If we want to be loving and kind"],["995.6","and patient and meek, then those aren't those aren't things that we naturally are. Those are fruits of the spirit."],["1004.16","So, we need the holy spirit to help us generate those things in our lives. We"],["1010.24","need the holy spirit to change us to be these things. Uh they they all continued uh all the list of the disciples their"],["1017.04","names in one accord in prayer and supplication. Uh and and that was the"],["1022.639","other observation I made of the the the description Luke uses. One accord homo"],["1030.16","is the Greek word. It means unanimously. And I noticed that Luke really likes"],["1035.439","this word. He uses it 12 times throughout the book. And sometimes it's describing the work of the apostles in"],["1041.439","the church, how they were together in one accord. We see in Acts chapter 2 as"],["1046.48","an example, they continued daily with one accord in the temple breaking bread from house to house. They ate their"],["1051.84","foods with gladness and simplicity of heart. And then likewise uh through the hands of the apostles, many signs and"],["1056.96","wonders were done among the people and all the growing church was in one accord"],["1062.08","in the temple at Solomon's porch. Other times, one accord is used to describe the actions of the Pharisees, the"],["1067.84","religious leaders of the nation of Israel. when they were attacking the apostles, they were doing it uh in one"],["1075.039","accord. And uh and then we see the mob would react uh in one accord when they"],["1081.28","were uh uh violently attacking the apostles. But we see in Acts chapter 18, Galileo was a protocol uh and the Jews"],["1089.12","were in one accord when they rose up against Paul and brought him to the judgment seat. And so then we see in"],["1095.2","chapter 19, once again, the whole city was filled with confusion. And this is uh when they all were uh aggravated and"],["1102.08","they grabbed uh Gallas and uh this fellow's name who's a Macedonian and they were Paul's companions and they"],["1108.799","arrested them and they were all spooled off. They had this mom mentality where they were all acting in one accord. The"],["1116.16","point being in whatever situation that phrase is used being in one accord always provided strength and power to"],["1123.2","the group. There's a level of overwhelming force behind those who are"],["1128.64","standing in one accord. Due to the fact that you"],["1133.76","Luke uses the term often, I feel that it illustrates to us a biblical principle that is spoken of. First of all, we see"],["1139.679","it in wisdom literature. Ecclesiastes chapter 4, the one may be overpowered, two can defend themselves, a threest"],["1147.28","string cord is not quickly broken. We see it there and then we see it re repeated in the biblical principles"],["1153.919","mandated in the letters of the apostle Paul where he says to the church I therefore the prisoner of the Lord"],["1160","beseech you walk worthy of your calling which you're called. Here's how he describes that calling with all"],["1165.12","loneliness and gentleness longsuffering bearing one another in love endeavoring"],["1170.16","to keep the unity of the spirit in the bond of peace. There is one body and one"],["1177.2","spirit just as you are called by one hope. your calling. One Lord, one faith,"],["1182.24","one baptism, one God and father of all who is above all through all and in you"],["1187.52","all. Paul teaches and then we also see this reflected in what Jesus prays for his"],["1195.84","followers to have this. I do not pray for these alone but also those who will believe in me through their word. So"],["1201.679","he's praying for his disciples but he says not just for them but for those who believe because of their word. So that's"],["1207.039","who that's us. Jesus is praying for us. What does he pray for us? Verse 21. That"],["1214.559","they may all be one as you, Father, are in me and I in you. That they may also"],["1220.72","be one in us. That the world may believe that you sent me. And the glory which"],["1227.12","you gave me, I have given them that they may be one just as we are one. I in them and you in me. and they may be made"],["1234.799","perfect in one that the world may know that you sent me and have loved them as"],["1240","you loved me. The reoccurring theme in scripture is unity oneness."],["1247.28","One of the challenges of coming back after being away for a whole month was gathering everyone back together to"],["1254.08","ensure that we are all still in one accord. We elders hadn't met since"],["1259.76","August and there was a lot of things to catch up on and some discussions and decisions had gotten put on hold and we"],["1265.28","needed to review and reaffirm our plans and I had to catch up with the staff and"],["1270.64","with all the ministry leaders and with people who needed reassurance that we are still united. Got to make sure we're"],["1277.679","all on the same page. We value unity and I wanted to"],["1283.6","illustrate how we endeavor to accomplish that here at Faith Bible Church for you to better understand the philosophies of"],["1289.76","leadership that we are adhering to. So within our leadership, we operate as a"],["1295.039","plurality of elders. So it's not just, you know, Pastor Rob's the big cheese and pastor Mark does everything he says."],["1301.679","No, not at all. We are a plurality meaning we all the different elders are working together to in harmony to make"],["1309.2","decisions. Uh we have leadership classes. We do three classes. Uh one's on character of a biblical leader uh on"],["1316.88","the doctrines of the church and then uh we do a hermeneutic class which pastor"],["1321.919","Greg teaches uh principles of biblical interpretation. And this training helps"],["1327.039","all the leadership coming into the church to be on the same page. the leadership can all understand the"],["1333.28","biblical principles and so that we can all work together in one accord, not"],["1339.039","divided. Right? Well, I pledge allegiance to the flag of the United States of America and to the republic for which it stands, one nation under"],["1346.64","God, indivisible. Well, that's no longer an accurate"],["1352.08","description, now is it? We are very divided. There is practically nothing"],["1359.919","that people agree on anymore. And a house divided against itself"],["1364.96","cannot stand. The prophet Amos said this in uh Amos chapter 3. He said, \"Can two"],["1371.6","walk together unless they agree?\" The mistake being na made in the nation"],["1378.64","is also made in the church. The churches of America are not of one accord."],["1384.48","Consequently, the people of faith have received mixed messages, contradictory messages, and there's very little I can"],["1391.12","do about the churches in America. But a Faith Bible Church, we have to be of one"],["1396.32","accord. It's easy to say. It's not so easy to do. In order to make it a reality, it"],["1403.12","requires commitment to the concept of unity, indivisible."],["1409.6","So, as an elder board, we endeavor to make decisions that everyone agrees with. We don't take votes in the"],["1416.72","majority rules, right? So, you know, well, it's 5 to three, so you know, never mind, Pastor Mark and John"],["1422.799","Murdoch, just be quiet. We voted you down, right? That's not how we operate."],["1428","Uh we if one if one elder has a concern with something we're doing, uh we don't"],["1433.76","press the issue. we will we will pause and we'll take time to listen and reflect and we'll even go away from"],["1439.12","meetings and pray about something dive into the biblical instructions and seek"],["1444.24","to apply them accurately to the scenario that we're debating since we believe in"],["1449.52","the concept of one accord. We want uh unanimous decisions. We want everyone"],["1455.76","agreeing and satisfied with the decision. And as we strive for this at"],["1461.52","every level of relationship in this church, that's what we're aiming for."],["1466.64","But it's not easy, is it? Because, you know, people got strong opinions on different issues. There's uh opinions on"],["1473.76","rights and freedoms and people got opinions on, you know, proper medical care and educational options. And"],["1480.24","there's opinions on outreach and community interaction, opinions about politics, about finances. There's"],["1486.32","opinions about music. There's opinions galore. And everyone's entitled to their opinions. But when the"],["1493.84","opinions drive us to division and disunityity, that's when we have to"],["1498.96","evaluate the motives. Our mission is simple to glorify God by"],["1504.159","sharing the good news of Christ in establishing believers to pursue God's plans for their lives. And our"],["1511.76","authoritative foundation for what we're doing is the word of God. 2 Timothy"],["1517.52","2:16-1 17 says, \"All scripture is given by inspiration of God and is profitable for"],["1524.24","doctrine, reproof, correction, instruction in righteousness, that the"],["1529.679","man of God, the woman of God might be complete, thoroughly equipped for every"],["1535.76","good work.\" The word of God is the standard that determines what is right and wrong, what is true and what is"],["1542.72","false. And if we are steadfast in our commitment to love God and keep his commandments, that value will pull us"],["1550.88","together, endeavoring to keep the unity of the spirit in the bond of peace. The"],["1557.2","enemy uses the strategy divide and conquer. And it works so well"],["1564.159","to break up homes, communities, societies, churches."],["1569.679","We learned when we were over in Germany that the Germans pay a tax. They called"],["1574.88","it a church tax. They pay a a tax comes out of their income and it goes directly"],["1580.32","to the church. And uh wow, you know, wow, the and it's not all churches. It's"],["1585.679","the Lutheran church. So, well, man, the Lutheran church, they must really be very effective uh with all that money."],["1592.159","They're probably doing great things for God. Nope. They are ineffective and almost dead. The buildings are empty and"],["1599.36","uh they don't even let anybody else use them. No power because of false doctrine"],["1604.48","that the false teachers have brought in and rendered those churches powerless, void of the working of the Holy Spirit,"],["1612.32","divided from truth and from God and the people from one another. We have to"],["1617.76","strive for unity in our marriages, our homes, and our church. And Lord willing,"],["1624.24","we could then be a light to a divided nation. And we could show them the truth. The"],["1632.24","world's always at war, isn't it? They always talk about peace deals and they never work out. But that shouldn't be"],["1638.799","because we are all we're all one race, right? We are all made in the image of God. We are all loved by our heavenly"],["1645.679","father. God loves the world and Christ died for for all. The world just can't see the"],["1653.36","devil's schemes to divide and conquer. But we can. So we have to stand firm"],["1658.48","against them because of offenses, because of disagreements. We will always"],["1663.52","be tempted and tested to pull away, to break fellowship. It takes great effort,"],["1671.279","spiritual maturity, love, and forgiveness to be in one accord."],["1677.36","Some of you today, you know, like you you barely made it to church together, right? That was a stressful driving the"],["1684.24","car. You know, some people don't even want to sit together. It's a spiritual battle. It's a spiritual battle that"],["1691.2","we're fighting. Satan wants us divided. And Jesus prays that we would all be"],["1696.559","one. So each and every one of us must be responsible"],["1701.6","for the part that we play in being of one accord. We must understand the awesome victories that are achieved when"],["1708.24","we are and the ways that it honors and blesses our heavenly father and how he works in and through us when we all come"],["1714.559","together as one body. We all have a part to play. We all have a role to fulfill in the body. The disciples were in one"],["1721.6","accord in prayer and supplication. Why do we why do we take this, you know,"],["1727.919","long prayer time during our services and, you know, boy oh boy, sometimes, yeah, people get wordy and it turns into"],["1734.08","story time and somebody preaches a sermon in the mid mid mid prayer time"],["1739.52","can drag out. Well, maybe, but there's power in praying in one accord. Praying"],["1745.279","for one another. It takes time and and intentionality to fulfill the command to"],["1750.64","be of one accord. and listening here and and and sitting here and listening to people's needs. That's an investment of"],["1757.76","time. But we believe it is an act of faith. What we do here on Sunday mornings is what the followers of Jesus"],["1765.2","were doing in the upper room, right? When we sing praises in one accord, uh"],["1770.799","when we are uh praying together in one accord, we're in one accord. When we"],["1776","give our tithes and offerings for the furtherance of the gospel, we're in one accord. When we listen to the preaching of the word and we seek to apply it to"],["1782.88","our everyday lives and in and through this God's presence will fill us. God,"],["1789.2","the Holy Spirit inhabits the praises of his people. The Holy Spirit falls upon"],["1794.48","the congregation, convicting us of sin and regenerating our spirits. The Holy Spirit restores us and sanctifies us,"],["1802.24","empowering us, guiding us to a furtherance obedience and service with the gifts that the Holy Spirit bestows"],["1808.48","upon us. And one day when our time is over and our work on here is done, the Holy Spirit resurrects us to new life"],["1816","and all of that is happening when we come together in one accord."],["1823.279","I was uh really planning to finish this chapter this week, but uh once I got"],["1828.64","through all that, I was like, \"Oo, that's that's enough.\" So, we're going to uh break there, and you'll have to come back uh next week to find out"],["1835.279","what's next. But two things we learned today. what you want your name to be affiliated with, you'll have to be"],["1841.679","intentional about cultivating in your own life. And what's the other thing we learned? The importance and responsibility that we all have to"],["1847.919","foster a community where we're in one accord. Come back next week and we'll"],["1853.039","learn what decisions and actions the apostles made being in one accord. Lord"],["1858.08","Jesus, we thank you for these observations. We thank you for the uh way that we can see uh the reoccurring"],["1864.399","themes in scripture. we can pick them out and then we can look at our lives and we can say well how am I applying"],["1870.08","that? Am I am I being a a someone whose name is affiliated with things that are"],["1875.279","honoring and glorifying to God. Uh is there things that I need to change and improve in my life? And also then we can"],["1881.52","we can look at at the at the the concept of being of one accord and say how am I"],["1887.279","orienting my life around a way that is uh pleasing to my heavenly father that we are joining together not being"],["1893.679","divided but being united uh and one lord one faith one baptism. Give us uh the"],["1901.12","spirit and the heart to continue to work on these things. Guide us we pray in Jesus name. Amen."]]},{"id":"pWRR0ZGEix4","name":"2025-10-12  Be My Witness (Pastor Rob McNutt)","date":"2025-10-12","transcript":[["21.119","So, I remember uh when the Lord of the Rings trilogy came out, it's a long long"],["26.16","time ago, 2001. The Fellowship of the Ring was the first part of that"],["31.84","three-part series. And I watched it, was totally immersed in the experience. And"],["37.36","when the movie ended, I was so frustrated because the movie was over, but the saga"],["46.079","was just beginning. And since I never read the books, I didn't know how it was going to what was going to happen next."],["52.32","Maybe I should read. I don't know. But uh at the end of the movie, The Fellowship of the Ring was fractured."],["57.84","The main main characters were killed. Orcs and evil were winning. Froto and his friends were in danger and it would"],["64.64","be another whole year before the next movie came out. So, I didn't know what was going to happen next."],["72.08","The New Testament begins with the four gospel accounts, Matthew, Mark, Luke, and John. Whichever one you read, or if"],["79.119","you read through all of them, you're left with the same question after watching the Lord of the Rings first"],["85.52","movie. What's happening next? Matthew chapter 28 ends like this. The last"],["91.2","chapter of Matthew, the 11 disciples went away into Galilee to the mount which Jesus appointed them. Jesus came"],["96.72","and spoke to them saying, \"All authority is given to me in heaven and on earth. Go make disciples of all nations."],["102","Baptize them in the name of the father, son, and the holy spirit, seeking to observe all that I've commanded you to"],["107.439","do. Lo, I'm with you always till the end of the earth.\" End of chap of end of the book of Mark. And he said to them, \"Go"],["114.56","into all the world and preach the gospel to every creature. He who believes and is baptized will be saved. He who does"],["120.479","not believe will be condemned. So then after the Lord had spoken to them, he was received up into heaven, sat down at"],["126.56","the right hand of God, and they went out preaching everywhere as the Lord working with them, confirming the word through"],["132.319","the accompanying signs in the book of Luke. Luke ends this way. He said to"],["137.68","them, \"Thus it is written, and thus it is necessary for the Christ to suffer and to rise from the dead on the third"],["143.52","day, and that repentance or remission of sin will be preached in his name to all nations, beginning in Jerusalem. You'll"],["149.84","be my witnesses of these things. Behold, I send the promise of my father upon you, but tarry in the city of Jerusalem"],["156.08","until you are endued with power from on high.\" And he led them out to Bethany."],["162.879","He lifted up his hands to bless them. And it came to pass while he blessed them, he parted from them, carried up"],["169.36","into heaven, and they worshiped and returned to Jerusalem with great joy."],["176","That's how the earthly ministry of Jesus concludes. But the saga is just beginning. And"],["184.64","that's what Acts is. What happens next? The acts of the apostles once Jesus"],["191.519","leaves. turn to chapter one as we start in with this study. So um as we did last"],["199.84","week, chapter 1 vers1, the former account I made, O Theophilles, of all that Jesus began both to do and teach"],["205.68","until the day which he was taken up after through the Holy Spirit having given commandments to the apostles whom"],["211.2","he had chosen, to whom he presented himself alive after his suffering by many infallible proofs, being seen by"],["217.84","them during 40 days, and speaking of the things pertaining to the kingdom of God."],["223.84","And being assembled together with them, he commanded them not to depart from Jerusalem, but to wait for the promise"],["230.56","of the Father, which he said, you have heard of me. For John surely baptized"],["236.72","with water, but you shall be baptized with the Holy Spirit, not many days from"],["243.2","now. Therefore, when they had come together, they asked him, saying, Lord, will you at this time restore the"],["249.76","kingdom of Israel? And he said to them, \"It is not for you to know the times and"],["255.12","the seasons which the Father has put in his own authority, but you shall receive power when the Holy Spirit has come upon"],["261.199","you. You will be witnesses to me in Jerusalem, Judea, Samaria, and the ends"],["267.68","of the earth.\" Now when he had spoken these things, while they watched, he was taken up, and a cloud received him out"],["274.8","of their sight. And while they looked steadfastly towards heaven, as he went up, behold, two men stood by them in"],["281.919","white apparel, who also said, \"Men of Galilee, why do you stand gazing up into"],["287.919","heaven? This same Jesus who is taken up from you into heaven will so come in"],["293.04","like manner as you saw him go up into heaven.\" So Luke gives his audience, who's his"],["300.24","audience? Who's the book written to? Theophilles. Who's Theophilus? What does"],["306.4","his name mean? I heard a good sermon on that recently. Friend of God. If you are a friend of"],["313.199","God, this you're theophilus and this book is written to you. That's kind of a big deal. So, last week we learned how"],["319.12","to be a friend of God. Go back. All you creative guys, go back and watch it. It's a pretty good sermon. Luke begins"],["326.56","Acts with a summary. In my previous account, I told you all about Jesus, who"],["331.68","he was, what he did. That was the book of Luke. His amazing teachings, his miraculous acts. He chose disciples. He"],["337.84","mentored them. He was crucified. He rose again. Presented himself to all of his followers for 40 days. And he gave them"],["345.28","instructions which were what? What were the instructions? Verse number four."],["351.919","You have heard from me that John baptized with water, but you will baptize with the Holy Spirit not many"],["357.84","days from now. So he commanded them not to depart from Jerusalem but to wait there for the promise."],["365.6","Now that information ought to elicit some questions."],["371.919","Who or what is the Holy Spirit? What does it mean to be baptized without"],["378.24","water? How many days are we to stay in Jerusalem? It's kind of unsafe there right now. Like you know they just got"],["384.24","crucified. And what are you going to be doing, Jesus? where what's going to happen with you based on what Jesus just"],["391.919","said those would have been logical questions what question do they ask"],["397.6","verse number six their question is Lord will you at this"],["403.52","time restore the kingdom of Israel"],["409.759","did that have anything to do with what Jesus just instructed not really why did they ask that"],["415.919","question because it was what the disciples had expected. It's what they had originally"],["423.12","signed up to be disciples for the kingdom of God, the kingdom of"],["430.4","Israel. So when will you restore is the question. The Greek word for restore is"],["436.88","apocahmy. It means restore to a former state or"],["442.08","maybe reassemble. See, at one point there was a kingdom. Something happened to it. It's been"],["448.16","broken down. And they're excited for Jesus to reassemble it. At the time of"],["455.919","the writing of the book of Acts, Israel was not an independent nation. They were an occupied people. They were ruled over"],["462","by the Roman Empire, which means they were subjects of Rome. They were under"],["467.12","Roman law. They had to pay Roman taxes. They had to yield to Roman authorities. and they had foreign Roman troops"],["474.639","occupying their land. Now, that's not a new situation for Israel. Before Rome"],["479.68","took over the land, the Israelites were under the authority of the Greeks. And we don't hear a lot about that because"],["486.319","that was uh during the intertestamental period, also called the 400 years of"],["494.24","silence. Why? Well, the last prophet sent by God from"],["500.479","the Old Testament was the prophet Malachi. That was in 420 BC. And no word"],["507.039","of the Lord came for 400 years. Not to say that there was no revelations or no"],["512.64","explanations of what was going on. Actually, the prophet Daniel had been g had been given incredibly detailed"],["519.76","accounts of all that the nation of Israel was going to go through and exactly how long would it be till the"],["525.44","Messiah arrives. That's uh chapters 9- 12 of the book of Daniel. The people"],["530.8","watching Daniel's prophecies being fulfilled before their very eyes, if they were paying attention to that book,"],["537.76","they would have known what was going on, what the empires were, and they if they"],["543.12","had interpreted it properly, they would have been fully aware. But that's the"],["548.16","challenge now, isn't it? Interpreting it properly because we have God's word. We"],["554","have all this revelation but often people do not interpret it properly. Uh"],["561.04","many churches do not use a literal historical grammatical consistent"],["566.16","hermeneutic. Well, why not? Well, because you know there's things that God said we don't agree with and there's"],["573.04","things that we don't find acceptable and some of these doctrines are offensive or"],["578.16","you know people in the congregation, they're going to get a little weirded out by it. So, let's just ignore those parts. It's confusing. It's hard. It's"],["585.76","It's challenging to live by. So, we'll pick and choose the parts that we want"],["591.519","to accept. How about that? It's called 400 years of silence, but"],["598.56","there was plenty of prophecies to pay attention to, and Israel pretty well missed all of them."],["604.959","Now here we have been 1,925 years since the last prophecy since the"],["611.04","author was last author was inspired by the Holy Spirit to write the word of God. 1,925 years of silence. Is God"],["619.76","silent with us? No. Because the word of God is d is"],["625.68","dynamic. It's quick and powerful and sharper than any two-edged sword that"],["631.44","divides us under soul and spirit. joint and marrow and is a discerner of the"],["636.8","thoughts and the intents of our very heart. We need to listen to it and"],["642","interpret it properly and apply it consistently to our everyday lives. But"],["647.76","the disciples back in their time being occupied by Rome before them the 400 years of"],["654.56","silence that was during the Greeks occupation and then before the Greeks it was the Persians and then before the"],["659.6","Persians it was the Babylonians and they had been ruled over and and oppressed by"],["665.279","these world empires for 600 years. So none of Jesus disciples knew anything"],["671.68","about being a free independent people. They were a conquered, oppressed people,"],["678.32","but they had read about a time when things were different. When will you"],["683.36","restore the kingdom of Israel? They were thinking about a time in the Old Testament when the nation of Israel was"],["689.68","not divided into two kingdoms. They were thinking about a time when they had a great king who led them to victory over"],["695.279","their enemies. They were thinking about a time when the kingdom of Israel was prosperous and flourishing. King David"],["701.76","with the power of God had brought military victory and built a strong nation. King Solomon his son with the"],["709.12","wisdom of God had made the nation prosperous, wealthy beyond compare. He built a glorious temple that was"],["716.079","overlaid with gold. And people from every nation would travel to Israel to marvel at its riches and splendor. But"],["722.56","all that was destroyed in 580 BC when the Babylonians disassembled that temple and they tore down the city of"],["728.88","Jerusalem. Nevertheless, the Old Testament prophets foretold of a son of David, the Messiah, who would rise up"],["736.639","and restore, reassemble the kingdom of Israel. He would sit on his Dave, father David's"],["743.519","throne, and he would rule the whole world. And this is what the disciples had in mind when they signed up to"],["749.92","follow Jesus. They believed he was the Messiah. They believed he was going to restore the kingdom of Israel, reclaim"],["756.079","their sovereignty and independence. And when he did, they would be rich rulers"],["763.2","in a restored kingdom. That's what they had in mind. Those were their plans,"],["771.279","but they're about to learn through the Acts of the Apostles that their plans are not God's plans. You got"],["779.76","any plans? What do you have in mind? What do you want to do with your life? You know,"],["785.6","some young people, you know, maybe they're here and they love sports and they're thinking, you know, well, maybe I could get a college scholarship"],["792.16","playing baseball and and then I could go pro and then I could sign on with the Blue Jays and beat the Yankees and go on"],["798.88","to the World Series. No amens on that."],["804.32","I mean, you knew I was going to talk about the Blue Jays at some point, right? Some people are in here and they're and"],["810.399","they're in school and they're working on their education. and they're thinking, well, I'm planning to go into this field and I'm going to get a career when I'm"],["815.76","done my studies and I'm going to rise up in that industry. I'm going to make really good money. And some people here, what they have in mind is like, you"],["821.519","know, I'm going to fall in love and I'm going to start a family. I'm just going to be so happy raising my kids. Well,"],["827.6","everybody has something in mind. So did the disciples. We expect to be rulers in"],["833.12","the messianic kingdom. Lord, when will you do that? Have you ever considered"],["839.12","that maybe your big plans are not God's plans for your life? The disciples had"],["845.519","not considered that Jesus had a different plan. Lord, when will you restore the kingdom? And Jesus said,"],["851.92","\"It's not for you to know when the kingdom is going to be restored.\""],["857.92","Lots of people think they know when Jesus is coming back. I I missed all the"],["863.68","fun in Spain because there was all these predictions last month that maybe that was going to be the rapture. It's going"],["871.04","to be in September. Either that or we all missed it cuz I don't know. But anyways, didn't happen. Well, now well"],["876.8","maybe it's maybe it's this month. Maybe it's the end of October. Personally, I think that would be great. I'd love for Jesus to come back. I think it will be"],["883.76","soon. But just as the disciples, the people who went on the internet uh and"],["889.76","said the rapture is going to happen last month, they learned the hard way what it says here, we do not know when"],["897.36","the time will be. However, there are specific things that we do know that God wants us to perform. Verse number eight,"],["905.279","he says you, it's not for you to know the time, but you will receive power"],["910.88","when the Holy Spirit has come upon you and you will be witnesses of me in Jerusalem, Judea, Samaria, and to the"],["917.519","ends of the earth. We have been given a specific task to be"],["923.199","what? Witnesses. The Greek word for witness is, you know,"],["929.6","martyr. Martyr. It originally meant in the Greek someone who gives a testimony"],["935.68","of what they saw. Maybe they go to court and they go on record telling being a witness. Now for us, the word martyr"],["942.959","means someone who's killed for their convictions. That's not"],["948.079","what the Greek word originally meant, but it's what the word became to mean. Why? Why does it get used like that now?"],["956.959","Because when all the disciples went out to be witnesses of Jesus, what happened"],["962.48","to all them except John the beloved? They were all killed. They were all put to death because of their testimony."],["970.24","That was God's plan for his disciples. What a horrible plan. Why would anyone"],["978.639","sign up to be a disciple? Why did Jesus want his disciples to be"],["984.56","killed? It's not that Jesus wanted his disciples or any of us to be killed. Matter of"],["991.12","fact, God is not willing that any should perish."],["996.959","So much so that he made a way to save us from perishing. For God so loved the"],["1003.759","world that he gave his only begotten son that whosoever believes in him should not"],["1009.68","perish but have everlasting life. God doesn't want anyone to perish. But people have a free will. And if people"],["1016.959","choose to kill others because of hate, because they reject the will of God, then people perish. When people want to"],["1024.559","remain in their sins and reject the gospel message that the gift of God is eternal life through Jesus Christ our Lord, if they reject that gift, then"],["1031.52","they will perish. But since God doesn't want them to perish, he wants them to"],["1036.559","hear the good news, to receive the gift of eternal life. He instructs his disciples to take the message out to the"],["1043.919","whole world so that everyone can hear that Christ died for our sins and that he was buried and that he rose again and"],["1051.919","whosoever calls upon the name of the Lord shall be saved. That's God's plan."],["1059.039","That is what he wants each and every one of us to be about. Just as he told his disciples, the great commission here"],["1065.679","applies to all of us. We are to be witnesses taking that message of Jesus"],["1071.12","to the uttermost parts of the earth. Jerusalem, Judea, Samaria, uttermost"],["1077.919","parts of the earth. And that's what we've been trying to do. That's what I personally been trying to do for the past 33 years. 1992. I said to the Lord"],["1085.36","or look, I really don't know what I'm doing with my life here. Uh it's just kind of a mess. So, you take over and I"],["1092","will do what you want me to do. And since then, I've been trying to follow these instructions. And and the first"],["1098.88","thing he did was he took me to the hometown that I was born in Toronto, Nova Scotia. And he took me there to"],["1105.44","serve as a youth pastor trying to reach teenagers with the gospel, plus shoot"],["1111.6","them with paintballs and play basketball and take them skiing and all kinds of fun things with teens. But then they got"],["1116.799","I got I got promoted into more of a assistant pastor role and and serve in the church and learn to do a little"],["1123.52","more. And uh then he took me from and that would have been my Jerusalem, you"],["1129.36","know, where I was from. And then he took me to uh a part of Canada where I had"],["1135.12","grown up, uh New Brunswick, and that would have been my Judea. And I was pastoring a church there, trying to help"],["1141.12","those people and reach them likewise with the gospel. And then he took me right across the border to the United"],["1146.799","States of America and uh different country, different people but neighbors, you know, kind of similar to Canadians"],["1152.88","kind of. Uh and now in America, this would be my Samaria. And as the pastor"],["1159.44","of Faith Bible Church, when Elelliana and I first came to Faith Bible Church 18 years ago, this church was was very"],["1166.16","small. It's like 150 people here. Now the interesting thing about the members"],["1171.44","of faith bible church is you people are true to the name of the church faith"],["1178.32","bible you believe that practicing your faith is doing what the bible says so we"],["1185.84","have been striving to follow Jesus commandment here in verse number eight we've been making disciples for the last"],["1193.36","18 years and the church has been growing and because of this faith bible church,"],["1198.799","which 18 years ago had a missions budget of about $25,000. Today, we do well over"],["1204.32","$200,000 to missions and to ministries that are witnesses of Jesus Christ. And"],["1212","we have missionaries all over. Praise the Lord for that. We have missionaries all over the world that we're trying to"],["1217.6","support. And on top of that, every year we have a portion of people here that go out to do some short-term missions"],["1224.64","trips. And this past year, we had people go to the Dominican Republic and go to Panama and go back to the Dominican"],["1230.159","Republic and go back again. I don't know, Mark, everybody likes the DR. You started something there. We've had folks"],["1235.28","go to Africa. We had 50 people go to Kentucky because, you know, that's just a place that needs revival, right? And"],["1240.96","we sent people out to Kentucky. And I a year ago, we were we were asked by our"],["1246.24","missionaries in Spain, could we come over there for a month, preach at their church, and help at a uh their"],["1252.24","ministries? And one of their ministries is a refugee center that they support. And originally we thought, well, this"],["1258.08","would be good because Illiana could provide some counseling services for the refugees who've experienced a lot of trauma. And she has been trained in in"],["1264.96","in trauma counseling. And there were a lot of Ukrainians fleeing the war, their"],["1270.08","war torn country. A lot of Ukrainians were dumped into Spain. And these classes were full. Um, but once we got"],["1276.88","there, they they didn't really need the they didn't ask for the trauma counseling. what they really needed was"],["1282.08","a Spanish teacher because uh they didn't have anybody to teach Spanish uh that week. And in Spain,"],["1289.84","uh they will not permit you to advance in the immigration process until you can"],["1294.88","speak the language, which is Spanish. Imagine that. Requiring people to learn"],["1301.679","the language of the culture that you're attempting to assimilate into. What a concept. So the demand for the Spanish"],["1308.4","classes gives the center an excellent opportunity to interface with the people who are needy and to minister to them."],["1315.679","So they didn't charge them for these Spanish classes. They just all show up. And uh in the Spanish classes, Illana"],["1321.6","was able to weave into her lessons Christian values. Uh she taught them how"],["1326.72","to pray in Spanish. She teaching the uh colors in in Spanish. She used the"],["1332.64","wordless book. So she went through the wordless book to teach them colors and teach them the gospel while she was"],["1338.24","going through the colors. Uh so she was very effective in connecting with these people. I was much less effective than"],["1345.28","her. Uh no compren no ablan there. I just gave you all my"],["1351.12","Spanish. When I say I'm familiar with Spanish, it means I know the word taco."],["1359.84","But I got to uh serve lunch and I washed dishes and I went grocery shopping and I set clothes out that were donated for"],["1366.4","the people and I assembled chairs that the students could sit on and I cleaned the tables afterwards and I did all this"],["1372.159","behindthescenes ministry but that was needed to help support the program. And"],["1377.84","there's are many aspects to ministry that make the proclamation of the gospel effective. We do that here, right? Our"],["1385.12","video ministry, it it goes out to the whole world. Matter of fact, people in Spain were telling me, \"Oh, yeah, we've"],["1390.159","been we were doing your study and we were following along with your teaching at Faith Bible Church.\" But that doesn't"],["1395.6","happen if there's not somebody behind the scenes going to run the camera. People can hear the preaching so much"],["1402.96","better when all the beautiful little toddlers and children are not crying and"],["1409.6","laughing in the service. You know, some Sundays we got 25 kids down there in the nursery. And if they were all in here,"],["1416.799","probably be hard to hear what was going on. So these behind the scenes ministry"],["1422","help make disciples. So whether you're up front preaching or you're behind the scenes assisting, whether you go on a"],["1428.48","missions trip or whether you are donating money with the churros and chocolate last week, which I heard was great, but I didn't get any churo or"],["1434.88","chocolate, so I'm a little salty about that. But if you donated money at that for someone to go on the trip, we all"],["1442.64","have a part to play in fulfilling the commandment of Jesus. Go and be witnesses in Jerusalem, Judea, Samaria,"],["1451.279","and the ends of the earth. And we were able to witness to people from the ends"],["1457.679","of the earth in Spain because at the center there were people from Morocco and Ukraine, Brazil, Iraq, Nigeria."],["1466","There was people, there was a gal from China and for a few days we actually were able to take this little side trip"],["1472.48","to Tangier, Morocco and while in Morocco we were seeing the country. We had this young fella who was driving us around"],["1478.48","for the afternoon and over the course of that trip we got to talk to him about Jesus. So that's what we did the whole"],["1485.279","month of September trying to be witnesses for Jesus to all the people that we came in contact with in all the"],["1491.76","different countries we got to see. That's God's plan for all of the followers of Jesus. All who claim to be"],["1498.08","a friend of God. Jesus followers ask about the kingdom. And Jesus said, \"It's not for you to know that. Focus on being"],["1505.039","a witness.\" Are you focused on God's plans"],["1510.24","or like the disciples? Are you thinking about your own plans? You shall be my witnesses. Jerusalem,"],["1516.48","Judea, Samaria, the ends of the earth. That is the commandment. That is the"],["1521.76","purpose statement. the mission statement that we followers of Jesus are still to"],["1526.799","follow. Nothing has changed. However, that doesn't mean that the messiac messianic kingdom is not coming. Look at"],["1533.84","the next thing that happens here. This is so interesting. Verse number nine. While he had spoken these things, while"],["1539.679","they watched, he was taken up and a cloud received him out of sight. And while they were looking steadfastly"],["1546.159","towards heaven, as he went up, two men stood by them in white apparel. So we"],["1552.559","say, yeah, those are angels, right? Angels stood there and they said, \"Men of Galilee, why do you stand gazing up"],["1558.64","into heaven, the same Jesus who was taken up from you into heaven will so come in like manner as you saw him go up"],["1565.679","to heaven.\" So, I heard last month that uh since people thought the rapture was"],["1570.799","coming that some people quit their jobs and some people had stopped paying their bills and uh I I I heard this story that"],["1578.159","one neighbor asked their their neighbor uh would you take care of my dog when I'm raptured next month? It's like what"],["1584.96","do you mean like I'm not going to heaven? It's just you. Yeah, that was kind of salty. But um I"],["1590.799","think the angel's instructions to the disciples is still relevant for people today. We're not supposed to be standing"],["1597.84","around gazing up into heaven. That's not the proper life application of the prophetic information that Jesus is"],["1604.64","coming back. I think it is human nature to you know"],["1609.679","complicate things. You remember the Pharisees? They were a prime example of this in their earnest attempts to follow"],["1615.52","the laws of Moses. They they made some instruction manuals. They devised some policies and procedures. They formulated"],["1622.799","governance and it did not help anyone follow the Lord. All it did was lead"],["1628.96","them away. Jesus says, \"Woe to you scribes and Pharisees. You you put burdens around people's necks. You do"],["1635.039","you shut the kingdom of heaven. You don't enter and you don't let anybody else enter.\" It's just a It was just a bunch of when"],["1641.919","Jesus showed up on the scene, it was just a bunch of standing around gazing at religious activities, but no actual"],["1648.96","obedience was being accomplished. And we too can get wrapped up in talking about"],["1654","spirituality and discussing ministries and studying the subject matter and reading books and taking classes and a"],["1661.36","lot of philosophy about following Jesus. But it can turn into a lot of standing"],["1666.72","around gazing up into heaven and not actually being witnesses. And at"],["1673.039","some point we need to reach out to people who don't know Jesus and communicate the message to them. You"],["1679.6","know, many times we're praying, you know, God, what do you want me to do? You know, where do you want me to go to school? What should I do for work? Or"],["1685.679","what state should I move into? Should I ask this girl out? You know, what investment should I put in? What church should I go to? And we distract"],["1692.24","ourselves with our plans. But the clear instructions are be my"],["1698.96","witnesses. We talk to God about ourselves and sure we can. You know, he's available. He listens because he"],["1704.159","loves us. But at some point, we need to just get at doing what we know we're supposed to be doing. Make disciples."],["1710.64","Share the good news so that when he does return, you're not standing around doing nothing, but he finds you faithfully"],["1718.48","busy, not idle. Well, I believe Jesus is coming back. And I believe he's coming"],["1724.159","soon. And I believe we're supposed to watch and be ready because that's what scripture said. But the gospel is not"],["1730.88","the rapture is coming soon. The gospel is not Jesus is going to judge all the"],["1736.559","evil empires of the world. The gospel is not God wants you to be happy and healthy and prosperous. You know, get"],["1742.399","out of debt. That's what that's not the gospel. The gospel is not homeschool your kids."],["1749.12","The gospel is not political messaging. free Palestine or make America great,"],["1754.24","whichever one you prefer. The gospel is the wages of sin is death, but the gift"],["1761.679","of God is eternal life through Jesus Christ our Lord. He was buried and he"],["1767.679","rose again. And if you confess with your mouth and believe in your heart, God has raised him from the dead, you shall be"],["1774.399","saved. And that is what we should be focusing on."],["1779.44","being driven around Morocco by this 20-year-old young fella. He was a Muslim. So, as we're a couple hours in"],["1785.76","the car with him, and Ilan and I were trying to, you know, uh, ask questions"],["1790.96","and kind of steer the subject where like, how can we get how can we kind of move this conversation towards talking"],["1797.12","about the Lord? And, uh, well, I was we had ask him questions about his values and his culture and up growing up in"],["1803.12","Morocco. And he was very got very interested and was as answering our questions and sharing things. and we"],["1808.799","make little observations like okay that's similar or we can connect with that and then I asked him and you know"],["1814.96","when you're doing this and you're praying at the same time Lord you know kind of tell me what to say so I says to"],["1820.159","him um what's your favorite holiday and he said oh it's one that we as Muslims"],["1826.96","are not supposed to celebrate but my favorite holiday is Christmas and I was"],["1832.72","like whoa really why and he said oh I I like the vibe"],["1838.72","He says, \"Everyone is so peaceful and everyone is so generous at Christmas time.\" And I said, \"Well,"],["1844.48","that's because the message of Christmas, the angels came with the message from"],["1849.679","God saying peace on earth and goodwill to men.\" And Jesus was God's gift to"],["1856.399","bring us peace. And God's will is for us to have peace. He wants to have peace with us. And he said, \"Oh, I did not"],["1862.559","know that.\" and we talked about how we believe that Jesus is the son of God and that is the gift. And when our drive"],["1868.88","came to an end, as we got near our hotel, I asked him, you know, could I I could I say a word of prayer for you, a"],["1875.679","blessing? And he said, oh yes, I would love that. So I prayed for him in the car and will I see him in heaven"],["1882.559","someday? I don't know. But maybe God had us there to just be a witness and to"],["1888.159","plant a seed and to water maybe some seeds of faith and let the Holy Spirit"],["1894","draw him in due time because we never know when or where or whom we can be a"],["1899.519","witness and we just got to try you know just bake some cookies and take him to"],["1904.88","your neighbor and try to develop a relationship that you can talk about these things you know uh child"],["1910.48","evangelism fellowship Carolanne was telling us in the first service that they need a few more workers, but"],["1916.08","there's children that get saved even this week at Bible club, in the public school, first time hearing the gospel."],["1922.159","And um I I heard I saw on Facebook and Mark, you posted this that Fellowship of Christian Athletes had a meeting at"],["1929.039","Leonardtown High School and the place was packed. All these young teenagers packed out looking for an opportunity."],["1936.559","How can we be a witness in our school? any number of ways that we can look to"],["1943.279","start a conversation. We just got to try. We got to get started. The point is not to stand"],["1949.919","around gazing up into heaven hoping Jesus comes back so I don't have to pay the mortgage, right? He's coming back."],["1956.799","But in the meantime, we have something to do. What is it? To be"],["1962.08","witnesses. So, how did the disciples do with these instructions? Well, you know,"],["1969.2","for the next three years, focus and we will learn all about the Acts of the"],["1974.72","Apostles. All right. Lord Jesus, we thank you so much for this message. We"],["1979.84","thank you so much for the study. May we learn what happened, your instructions to the the apostles, and then how that"],["1987.679","played out in their lives that got us to where we are today. How we got there was tied back to these acts. So Lord, we"],["1994.559","pray that we will learn and we will apply and we will be your witnesses. Praying all this in Jesus name. Amen."]]},{"id":"35tLCCy8dc4","name":"2025-10-26  Cleaning Up Other People's Messes (Pastor Rob McNutt)","date":"2025-10-26","transcript":[["21.199","Well, while we were in Spain, I just got to tell you Spain stories, don't I? It's"],["26.64","like rubbing it in. While we were in Spain, we did a lot of walking through the city of Malaga, and every morning we"],["32.8","took the same route to the immigration center where Elelliana was teaching Spanish to the refugees. The first time"],["39.28","we walked to the center, we were concentrating hard on, you know, the Google Maps instructions. Where did my"],["44.719","phone go? I thought it was here. Anybody see my phone? Oh well. Anyways, uh we"],["50.399","were using the Google map instructions, trying to find the proper se streets, you know, not getting lost. But once"],["57.039","you've walked a particular route a time or two, you no longer need that map. And uh that's when you can kind of look"],["64.4","around at your surroundings and make some observations. I noticed that this particular business,"],["71.76","this same woman came out every morning right at the time we were walking by and she would sweep the sidewalk and uh"],["78.72","clean up and pick up all the trash around the business. And I thought, I like that. You know, they they have such"],["84.32","an attention to detail. They even want the street outside of their establishment to be clean, which means"],["91.52","this lady was cleaning up other people's messes, cigarette butts that people had"],["96.799","thrown there. Uh, man, they smoke a lot in Europe. I'm just saying it was smoke"],["102","break all the time. And, you know, trash that would blow uh, you know, from the night before. None of it was that"],["108.479","business's trash. Certainly not that lady's trash, but nevertheless, she came out every morning to clean up someone"],["115.2","else's mess. And I noticed that phenomena at different businesses. People would come out in the morning and"],["120.479","they would they would kind of hose down and sweep up in front of the front of the business. But I also noticed that"],["126.079","other businesses did not do that and there would be trash outside and they just you had to step over it. They did"],["132.56","not even bother a bit with it. Uh after all, you know, the sidewalk is not or the street is not theirs. They don't own"],["139.2","that. So why would they pick it up? It's someone else's mess. Have you ever had"],["144.879","to clean someone else's mess? Why would you do that? You know, my dad"],["151.76","um by the way, I want to say this about my father. Uh he has retired in 2021 and"],["159.12","just been in the community and uh up there in Woodstock, New Brunswick, Carlton County. He's been 60 years now a"],["165.519","minister in that area. and uh he told me this past week a a church in that town"],["171.599","called him and said could you come in and resume ministry here uh we don't have anybody and uh he prayed about it"],["178.64","and he said yes and so today was his first Sunday at St. James United Church in Woodstock, New Brunswick. And he"],["184.56","said, \"I'm a little nervous.\" And I said, \"Well, you know, you at half speed is better than most up there.\" So, you"],["190.159","know, we praying for him. So, pray for Pastor Bob as he uh he once again resumes uh ministering the gospel there."],["196.48","But, you know, Pastor Bob, I'll tell you a Pastor Bob story. Um he loves to get out and cut grass. And"],["203.04","in the winter, he loves blowing snow. Maybe he doesn't love it, but he just he has to. He's obsessive. So he'll get out"],["209.76","there and cut his grass and then he looks at the street where he lives and"],["214.879","if he sees somebody else's yard is untidy, he'll go over and he'll cut their grass, too. And uh just he's"],["222.239","obsessive guy. Just wants everything to look a certain way. So when he drives"],["227.519","down the street, all the grass is neat and tidy on the whole street. And uh lo"],["235.04","and behold, as he's done this, he gets to meet neighbors who he's cutting the grass for. It's kind of awkward. Here's"],["240.879","here's Bob out here cutting the grass, you know, they go out. And lo and behold, he has found that many times people are sick or they're just kind of"],["247.36","weak. They're recovering from something or they just got old and they can't do it for themselves anymore. And uh it"],["252.64","opens up a door for him to minister to them and share the gospel. So by working on their yards, he's been able to also"],["259.759","work on their souls and uh the street you conduct business on, the community"],["265.199","you live in. How do you want it to look? Now, some people can ignore it and and"],["270.24","they they they feel that you know that that's fine, but other people can't function. They can't concentrate when"],["277.52","there's so much mess in order to move forward and get anything accomplished. They're like, \"First, I need to clean up"],["283.84","this mess.\" Well, that's what I see happening here in Acts 1. And I promise"],["290.4","we are going to finish this chapter and move on. But Acts 1 verse number 15"],["295.84","through 22. Let's read this and see if you can see what I'm getting at. So verse number 15. In those days Peter"],["302.56","stood up in the midst of the disciples altogether. The number of the names was about 120 and said, \"Men and brethren,"],["311.36","this scripture had to be fulfilled, which the Holy Spirit spoke before by the mouth of David concerning Judas.\""],["319.36","Oh, something in scripture about Judas, who became a guide to those who arrested Jesus, for he was numbered with us and"],["328.08","obtained part of this ministry. Now this man purchased a field with the wages of iniquity and falling headlong he burst"],["335.919","open in the midst and his entrils gushed out. It's very appropriate for ghoulish"],["342.24","Halloween, right? We can talk about guts rushing out. And it became known to those dwelling in Jerusalem. So the"],["348.08","field is called in their own language achiema"],["354.56","that is field of blood. For it is written in the book of Psalms, \"Let his dwelling place be desolate, and let no"],["361.44","one live in it, and let another take his office.\""],["367.44","Therefore, of these men who have accompanied us all the time that the Lord Jesus went in and out among us,"],["373.68","beginning with the ba with the from the baptism of John to that day when he was taken up from us, one of these must"],["380.4","become a witness with us of his resurrection. Let's stop right there. Last week we saw"],["386.88","the disciples were following Jesus instructions which we saw in verse number four this chapter which was to do"],["393.68","not depart from Jerusalem but wait for the promise of the father and Luke gives"],["398.8","the roll call of the disciples and we uh went through their names and we observed that they were all in one accord while"],["405.28","waiting for the promise of the father which was the baptism of the holy spirit. How long did that take? Just out"],["411.68","of curiosity. How long did they have to wait in Jerusalem? It was actually 10"],["416.88","days. Uh there how do I know that? Because there's 50 days between the"],["422.16","Jewish festival of first fruits where Jesus rose from the dead and the 50 days"],["428.8","between that and the Jewish celebration of Pentecost. And we know the Holy Spirit comes on Pentecost. So Jesus was"],["435.84","with his disciples according to uh Luke 40 days after he rose from the dead"],["442.08","before he was ascended up into heaven. So he told them wait in Jerusalem till the promise comes. He was within 40"],["447.919","days. It means there's 10 days left. So those are interesting numbers by the"],["453.12","way. Do do you recognize the number 40 and the number of 10? You know where where do we see 40? Remember the"],["459.68","Israelites wandered for 40 years in the wilderness and Jesus spent 40 days"],["465.36","fasting in the wilderness and it's always affiliated with the number of a"],["470.88","time of testing. Uh likewise the number 10 they had to wait 10 days in Jerusalem"],["477.599","and 10 symbolizes you recognize 10 from original scripture 10 commandments maybe"],["485.039","the 10 plagues right so 10 symbolizes completeness divine order human responsibility so you can think of 10 as"],["493.68","a divine reset point a moment where God completes a cycle and invites a response"],["500.56","so in those 10 days of waiting The disciples are going to take care of a little business. They're using this time"],["506.72","to reset, regroup, and replace Judas."],["512","Judas betrayal clearly had an impact on the whole group. He made a big what? He"],["518.88","made a big mess for the group, also for himself. Judas made such a mess, he"],["524","broke his own spirit and his own will to live. And instead of trying to find any way to clean up his mess, make amends"],["531.44","with the group, ask for forgiveness from from Jesus, he goes out and what did he do? He hung himself. And uh we see this"],["540.08","account here briefly, but it tells it in more detail in Matthew chap 27. I'll read that for you. Uh Judas, his"],["547.279","betrayer, seeing that he had been condemned, was remorseful, brought back the 30 pieces of silver to the chief"],["553.44","priests and elders, threw down the pieces of silver in the temple and departed, went out and hanged himself."],["560","But the chief priest took the silver and said, \"Well, this is not lawful for us to put it back in the treasury cuz it's the price of blood.\" And they consulted"],["567.04","together, bought with it a potter's field to bury strangers. Therefore, that"],["573.12","field was called the field of blood. And then we get a little more of the story here in Acts where that was the field"],["578.72","that he hung himself and fell and split his guts all open and it became called the field of blood. But there is more to"],["585.2","the mess than just his guts spilling in the field. There is broken unity. The"],["591.279","offense of the friends, the disciples, the followers of Jesus, and their reputation as a group. It's a big mess."],["599.92","How do they make sense of this? I think this is a scenario that many can"],["604.959","relate to. We know there are people in here who are feeling the pain of broken"],["611.12","relationships, very messy situations because of hurt and offense and even"],["617.04","feeling betrayed. Someone did something to you and it's just made a big mess for"],["622.079","you. Do you wallow in it or do you clean it up? It seems unjust that we have this"],["630","responsibility thrust upon us. Where would we even start? How do we make sense of it? Well, what I saw here is"],["637.2","Peter turns the group's attention to the word of the Lord. Look at verse number"],["642.8","16. So Peter stood up in the midst of the disciples, verse 15, and he said, \"Men and brethren, this scripture has"],["650.48","been fulfilled that the Holy Spirit spoke from the mouth of David concerning Judas.\""],["656.72","And then verse number 20, he quotes the scripture. It's written in the book of Psalms, \"Let his dwelling be desolate."],["662.88","Let no one live in it, and let another take his office.\""],["668.16","So, Peter's quoting the Old Testament, and we're going to check out these passages from the Psalms in just a"],["673.6","moment. But I wanted I did not want to miss the opportunity to stress the importance of finding the answers to all"],["680.56","of life's challenges in the word of God. We live in a world,"],["686.48","we are living in a time when our culture is fragmented. And people can hear about"],["693.12","everything, but they can discern nothing. A gale force wind of information is"],["700.079","hitting us. Do we have any objective standard of truth that will anchor us?"],["705.76","Many people do not. Consequently, when the storm of life crashes down on them,"],["711.04","when chaos and conflict assaults them, they have feelings. They have all these opinions and all these emotions of fear"],["717.519","and anger. But where can they go to find the right answer? Where can they go for the truth? Is your iPhone algorithm that"],["726.079","is designed to keep you addicted to spending time on your phone going to provide you the answers?"],["732","I think it's just going to serve another round of emotional opinions laced with political talking points but void of any"],["738.079","context to keep you engaged in your echo chamber echo chamber and addicted to its contents."],["744.959","People have subjective emotional reactions, but those are not solid foundations to base important life"],["750.959","decisions upon. Our fragment culture is offering you sand to build your life on."],["757.76","Sand that sifts with the storms. And Peter appoints everyone to the objective"],["763.839","truth of God's word. Something to be anchored to that will hold when the storms blow. A rock that will not shift."],["771.12","How firm a foundation you saints of the Lord is laid in this most excellent"],["777.12","word. Remember that song we used to sing that one. You have to decide when the storms of"],["784.079","life blow. What will be your foundation? Will it be the fragment opinions of"],["789.92","society fed to you by an AI algorithm? Or will it be the word of the Lord, the"],["796.32","objective standard of truth? If you say, \"Well, it's going to be the word of the Lord.\" then probably you should spend"],["802","more time paying attention to it as opposed to what the echo chamber screams"],["807.92","on your phone. Meaning you need to put the phone down and you need to get into"],["813.12","that. Now I just made some of you very defensive because the idea of what"],["818.959","stepping away from something that you might be addicted to is going to incite an emotional reaction. It it may be"],["825.92","upsetting that I would call that out. Be that as it may, I have a duty to warn you. If your phone influences your"],["833.12","worldview more than the word of God, you're on shifting stand. If your modern-day PC curated opinions"],["841.199","contradict God's word, you're going to fall for deception. Peter turns to the"],["846.56","word of the Lord to find proper perspective on how to think and feel about the betrayal of Judas. This"],["854.079","scripture had to be fulfilled. Peter says this horrible thing that the group is experiencing, this mess that we now"],["860.32","got to clean up, Judas's mess, it's a fulfillment of prophecy."],["865.76","Really, look at this verse. Psalms 41:9. Even my own familiar friend whom I"],["872.88","trusted in, who I ate my bread, has lifted up his heel against me. Well,"],["878.24","that just sounds like on face value David is lamenting about some injustice he's experiencing."],["884.48","But in hindsight, it's so much more. David had his own countrymen who he"],["889.68","fought to liberate from the Philistine oppression turn on him. His own father-in-law tossed javelins at him."],["896.72","His own son betrayed him and tried to take his throne. David was a man who"],["902.959","knew about betrayal and wrote psalms crying out to God for help. And in doing"],["908.16","so, in those psalms, David expressed emotions that all of us feel at some"],["913.519","point in our lives. And under the inspiration of the Holy Spirit, David described the very scenario that Jesus"],["919.839","would endure the detail about the bread. Even my own familiar friend whom I"],["925.12","trusted who ate my bread. Remember when it was the soop of bread that Jesus used"],["930.8","to identify his betrayer? He said, \"Someone's going to betray me.\" John asked him, \"Who's it going to be,"],["936.8","Lord?\" And Jesus said, \"It's going to be who I give this bread dipped in wine to.\" And he dipped it and he gave it to"],["944.8","gave it to Judas. Like David, like Jesus, you too"],["953.04","have had people betray your trust. They've hurt you. They've wounded you. It's created a big mess for you. We see"],["960.24","it all around from our personal relationships to the mess on the national scale."],["967.279","Everything in this world is one big mess. But Peter's words ring true to all of"],["974.639","us. The scriptures had to be fulfilled."],["979.759","All this injustice, unrighteousness, brokenness, is it not to be expected?"],["988.079","Things are exactly as the word of the Lord describes them. Since the fall of mankind, when sin and death entered the"],["994.32","world, all have been put under a curse. Fear, hatred, greed, envy, pride,"],["1000.8","selfishness, lies. This is in the hearts of all people from the greatest to the"],["1006.959","least. The empires, the kingdoms of men are corrupt. And this leads to all this poverty and shame. Everything happening"],["1013.92","in the world today is exactly as Peter says, a fulfillment of prophecy."],["1020.079","It could be no other way. Likewise, what you're feeling and experiencing on a personal level is a"],["1026.079","fulfillment of what God's word tells us is going on in the universal level. And once you get redpilled, you start to see"],["1034.319","the reality of the world we live in. That's when you can start making sense of it all. But many people are suffering"],["1041.679","with what is called cognitive dissonance. Cognitive dissonance is a psychological theory that describes the"],["1048.4","mental dis comfort we feel when we hold two or more conflicting beliefs, values or attitudes or when our behaviors"],["1055.36","contradict our beliefs. On the one hand, people want to believe that themselves"],["1060.88","and the people around them are generally good people. And since they're"],["1066.799","good, life should be good. Pain is avoidable and bad things aren't supposed"],["1072.08","to happen. And yet reality is the opposite of their beliefs. They're"],["1078.08","living in a big mess. And it's shocking to them. Why all this pain and suffering? Why are things so bad? I"],["1083.919","don't understand. We have all these really smart scientists. We got all these people winning these Nobel Peace Prizes and all these Noble people."],["1090.16","They're they're being paid lots of money. Why can't they fix this? Why isn't this mess getting cleaned up?"],["1097.6","People believe they deserve better. They deserve good things, a good life, a good environment, completely in denial of"],["1104.48","reality. The reality that everyone is sick and dying. Everyone is under the curse. As"],["1111.679","the prophet says in Isaiah 64, we are all an unclean thing. And all of our"],["1118.72","righteousness, it's just filthy rags. And we all fade as a leaf. and our"],["1124","iniquity is like the wind. It's just takes us away. And then Paul reinforces that in Romans 3:23 where he says"],["1132.16","you people but not me. No, he says all all have sinned and fallen short of the"],["1137.84","glory of God. So just like Peter, the word of the Lord makes sense of what we are experiencing. Your pain, this mess"],["1144.88","is a fulfillment of prophecy. And just as the word of the Lord helps us make sense of why things are so bad, it also"],["1151.6","tells us what we are supposed to do about it. And that's the part you need."],["1156.64","However, I don't know if you're going to like my answer, but I'm going to give it to you regardless. Three steps and how"],["1161.919","to deal with the mess. Ready? Step one, write it down. Here we go. Step one is"],["1169.039","you need to let God deal with injustice. You need to let God deal with injustice."],["1176.16","Let's look at the Psalms that Peter quotes. Psalm 69. Turn over to Psalms"],["1181.2","69. Verse 19. I want to read a little bit more of it for context, not just the"],["1187.84","verse itself. So, let's pick it up in verse 19. You might recognize this when I start to"],["1194.24","read it. The psalmist writes verse 19, \"You know my reproach, my shame, and my"],["1200.4","dishonor. My adversaries are all before you. Reproach has broken my heart. I am"],["1206.4","full of heaviness. I looked for someone to take pity, but there was none. For comforters, but I found none. They also"],["1212.96","gave me g for my food, and for my thirst, they gave me vinegar to drink. Oo, what is this? Recognize that one?"],["1221.44","That's Jesus on the cross. This is messianic prophecy. Let their table become a snare before"],["1229.039","them. Let their well-being a trap. Let their eyes be darkened so that they will not"],["1235.76","see. Make their loins to shake continually. Pour out your indignation upon them. Let"],["1241.44","your wrathful anger take a hold of them. Let their dwelling place be desolate and let no one live in their tents. Pick it"],["1248.88","up in verse 28. Let them be blotted out from the book of the living. Let and not be written with the righteous. But I am"],["1257.2","poor and sorrowful. Let your salvation, oh God, set me on high. I will praise"],["1262.72","the name of God with a song and will magnify him with thanksgiving. Verse 33,"],["1268.64","the Lord hears the poor and does not repo reprise his prisoners. Let heaven"],["1273.84","and earth praise him. The seas and everything move in them. For God will save Zion and will build the cities of"],["1279.76","Judah that they may dwell there and possess it. Also the descendants of his servant shall inherit it. Those who love"],["1285.36","his name shall dwell in. Now turn to Psalms 109. Same"],["1292.559","same thing. We want to read a little bit of what Peter is quoting for context."],["1298.08","Picking it up at the beginning of the psalm. David writes,"],["1304.32","\"Do not keep silent, oh God, of my praise. For the mouth of the wicked and the mouth of the deceitful, they've"],["1309.6","opened up against me, have spoken against me with a lying tongue. They have also surrounded me with words of"],["1315.2","hatred, fought against me with out of cause in return for my love. They are my"],["1320.24","accusers, but I give myself to prayer. Thus, they will have rewarded me with"],["1325.76","evil for good and hatred for my love. Set a wicked man over him, and let an"],["1332.4","accuser stand at his right hand. When he is judged, let him be found guilty. Let his prayer come to become sin. Let his"],["1338.96","days be few, and let another take his office. That's the one Peter was quoting there. Go down to verse 20."],["1346.72","Let this be the Lord's reward to my accur accusers and to those who speak"],["1352.64","evil against my person. Verse 26. Help me, O Lord. Save me according to your"],["1359.12","mercy, that they may know that this is your hand, that you, Lord, have done it."],["1364.72","Let them curse, but you bless. When they arise, let them be ashamed,"],["1371.679","but let your servant rejoice. Verse number 30. I will greatly praise the Lord with my mouth. Yes, I will praise"],["1377.919","him among the multitude. For he shall stand at the right hand of the poor to save him from those who condemn him. So"],["1386.559","David's prayer against his enemy. It sounds very harsh, doesn't it? He's"],["1392.32","like, \"Wipe them out. Don't let anybody live in their tents.\" You know, blot their name out of the book of life."],["1397.6","These were his ways of processing his grievances and giving them over to God."],["1404.4","Because what we see here in these psalms and in the life of David is David does"],["1409.44","not plotting his revenge. He's not scheming of a way to get even with these people. He's not holding on to the"],["1415.84","bitterness or the resentment. Nor is he living in denial saying it's fine, it's good, whatever. No, he's telling the"],["1421.919","truth about all that he's experiencing, how it's making him feel, but can you spot the pattern? What is the pattern of"],["1427.36","the psalms? How do they always end? But you, oh Lord, will be my salvation. You, oh Lord, are going to do this. You, oh"],["1433.36","Lord, are going to bless. He leaves the judgment and the wrath with God."],["1439.679","What does David conclude in all these psalms? He knows God will save him, God"],["1445.2","will reward, and God will deal with the injustice."],["1451.2","David on multiple occasions had opportunities to take matters in his own hands, didn't he?"],["1456.64","two times he had the jump on King Saul. He was sleeping and they snuck up on him"],["1463.039","and they could have killed him, but David's like, \"I don't think I should do that. Uh I I know vengeance is the"],["1471.76","Lord's and he will repay.\" David was prepared to trust God's word and not"],["1477.919","justify or rationalize why he should kill Saul. And we used to have a saying,"],["1482.96","I don't if you remember this. We used to know that two wrongs don't make a right. You know, in in our"],["1489.279","fragmented culture, I don't know if people know these old sayings anymore. I don't know if those are on the Tik Tok videos or anything, but we grew up"],["1496","hearing in home and in school and at church, you know, two wrongs don't make a right. Our Christian values tells us"],["1502.24","to love our enemies, to not overcome evil with evil, but overcome it with good. But that really doesn't make very"],["1510.88","cool movies, now does it? When the bad guy bullies you and you bake him a pie."],["1516.159","You know, all of our cool action movies from the 80s would have been pretty boring if the good guys did not break"],["1521.679","out the guns and have vigilante justice. David, look, Saul's asleep. We could"],["1528.559","kill him and you could be king. Nah, I'm going to let God deal with it."],["1534.32","After all, this is part of God's sovereign plan."],["1540.32","That's how David looked at things and that's how Peter sings things. Judah's mess was all part of God's sovereign"],["1547.12","plan. So often in the midst of the mess, we see it and we're vexed by it and we"],["1552.32","start wallowing in it. We allow the storm to distract us from our faith. We stop believing. We're not concluding as"],["1558.24","David, I know you've got this, God. Rather, we're concluding, God, how could you do this? How could you fail?"],["1566","You're blowing it, God. I was reminded of this, the Psalm of Moses. Moses writes, \"I proclaim the"],["1574.96","name of the Lord. Ascribe greatness to our God. He is the rock.\" We talked"],["1580.96","about the rock versus the sand earlier, right? \"His work is perfect and all his ways are justice. A God of truth without"],["1587.76","injustice. Righteous and upright is he. That was Moses' conclusion of God. Moses"],["1596.24","whose children, his people suffered in slavery to Egypt for 400 years. Babies"],["1604.32","thrown into the Nile for birth control. And Moses should have been one of them."],["1609.44","And he led the people out of Egypt. And God put them through that for 400 years."],["1614.96","And God and Moses says, \"God is just.\""],["1620","Yes. Three steps to how to deal with mess. Step one, let God deal with the"],["1626","injustice. Does God have a plan?"],["1632","Can you trust him? What does that look like? What does trusting God through the storm look"],["1637.2","like? What practically does he ask you to do? Step two,"],["1643.6","it's tied up in this. I think you know this one. Our Father, who is in heaven,"],["1650.64","holy is your name. Your kingdom come, your will be done on earth as it is in"],["1656.159","heaven. Give us this day our daily bread. Forgive us our trespasses as we forgive"],["1664.4","those who trespass against us. You know, I I I pray that prayer every morning as a way to kind of be my template in my"],["1671.36","conversations with God. And I I elaborate on those points, you know, as I I say them. I elaborate. And when I"],["1677.679","get to that um forgive me of my trespasses, I expound."],["1684.64","I talk to him about all my failures and the things I need to be forgiven. And the conversation gets long and I talk"],["1690.64","about, \"God, forgive me for this and I'm sorry for that.\" And then as we forgive those who trespass, I"],["1697.52","start thinking about all the people I'm upset at and all the people who have offended me. And then I I ask God to get"],["1704.64","them. Forgive us our trespasses as we So I"],["1712.399","pray for a spirit of forgiveness because he tells me to forgive and I want to be forgiven. So I need to forgive. Amen."],["1722","Is there not things that you need to be forgiven of?"],["1727.52","Shouldn't you be consistent with that forgiving?"],["1733.679","That's how we clean up other people's messes. We forgive."],["1738.88","And then third step, we move on."],["1744.96","Let me read you Peter's words again. He quotes Psalm 69. Let their dwelling place be desolate. No one live in their"],["1751.2","tents. That was Judas's fate. Prophecy fulfilled."],["1756.64","And then it's like we don't have to spend any more time feeling sad or angry at Judas."],["1762.799","Forgive him. Move on. Psalms 109:8. Let"],["1767.919","his na days be few and let another take his office. Let another take his office."],["1774.559","And that is what Peter applies to this situation that he's going to say we need"],["1780","to put another person into this position, this opening. We have here uh"],["1785.279","we have 11, we need 12. Uh let another take his place. As I said earlier, there"],["1791.12","was more to the mess than Judah's bloody guts. There was the broken unity. The disciples feel incomplete. Something"],["1798.08","Jesus had instituted has been severed. There was 12 disciples in scripture."],["1803.919","There's another number for us. We recognize that number, right? 12 symbolizes divine authority,"],["1808.96","completeness, governmental foundations, and appears over 180 times in the Bible. The number 12 often marks a moment of"],["1816.64","covenant, leadership, and spiritual structure. 12 tribes of Israel, 12 gates"],["1823.679","in the new Jerusalem, 12 disciples."],["1828.72","There's only 11. Peter feels we got to restore the 12. And I think to"],["1834.559","a certain extent this is the way for the disciples to close the chapter on Judas and move on beyond the trauma of"],["1840.88","betrayal. Some people don't do so well moving on"],["1846.24","from the betrayal that they've experienced. It becomes a a great excuse"],["1852","for every unwise decision they make for the rest of their life. It's a it's an excuse to stay drunk or stay high or"],["1858.32","stay a victim. I I don't have to take responsibility for my life. I was betrayed."],["1863.679","The moment a consequence for their bad behavior starts to be administered, the excuses come out. It's not my fault."],["1871.36","My father left. My mother neglected me. My my husband cheated on me. I was abused. I was lied to. The system failed"],["1877.52","me. The government failed me. The church failed me. And all that may be true, but if we don't want to live in the mess"],["1883.679","forever, we got to clean it up and we got to move on. And this is the last"],["1889.84","time Judas betrayal is ever spoken of in scripture. He's never brought up again"],["1896.159","in the book of Acts. And this tells me that after this, everybody moves on."],["1901.44","They replace him and they got back to the business of following Jesus' commands."],["1907.6","Same's true for many of us here today. Cleaning up the mess is putting the old"],["1913.44","away and getting involved in something new like maybe a new job or a new"],["1919.44","relationship or some of you a new church, some of you a new ministry"],["1924.96","opportunity that you can get into. You know, when we first left Canada, we moved to the United States. I talked a"],["1930.64","lot about with people my the the painful situation that happened in that church"],["1936.24","that I used to pastor that that kind of motiv that was like one of the things that motivated us to leave. And for a"],["1942.24","time, I talked about the betrayal and my pain. And the reason why I kept talking about it is because I was hurting, you"],["1948.399","know, and when something's hurting you, you just keep going over it over and over. But, you know, I don't talk about"],["1954.08","it anymore. I rarely ever speak about that time. I I now only bring up the situation when I use it to relate to"],["1961.84","someone who is going through a painful time as a way to assure them you'll"],["1967.519","survive this betrayal and you will move on and you can thrive. I see now that God had a plan in that"],["1975.84","time and I played my part and the mess got cleaned up and God's word came true and now 18 years later I'm blessed and"],["1982.32","we're working on year 19 being down here with you all. So it's wonderful. You know when you've forgiven and you've"],["1989.279","moved on when the sight of and the mention of"],["1994.799","that person no longer hurts you. You don't have to retell all that bad"],["2000.24","history. uh Tom Foxworthy. Uh he did this to me one time. 400 time I've told"],["2006.72","that story, right? And you know, you can finally close the book and you can talk about Tom and say, \"Yeah, Tom, he's"],["2013.279","great man of the faith. Love him.\" Verse 21."],["2022.159","We'll close with this. Therefore, of these two men who have accompanied us all the time that the"],["2028.88","Lord Jesus went in and out among us, beginning from the baptism of John to the day when he was taken up from us,"],["2036.32","one of these must become a witness with us of his resurrection. Okay, we got two guys. Who are they? Well, there's Joseph"],["2043.279","and u called Baradas who was surname Justice. So, he's got"],["2049.839","three names. That's confusing. and Matias. And they prayed and said, \"Oh Lord, who"],["2057.04","knows the hearts of all, show which of these two you have chosen to take part in this ministry and apostilhip from"],["2063.919","which Judas by transgression fell that he might go to his own place"],["2069.52","and they cast their lots and the lot fell on Matias and he was numbered with the 11 apostles.\" Okay, let's close with"],["2076.96","this. This is a very interesting detail. Even though these two guys are not part of the 12, they had been following Jesus"],["2083.679","according to Peter from when? The time of Jesus' baptism till the time"],["2088.72","he went up. So according to verse 15, we read that this group, you know,"],["2094.24","because we always think of Jesus and the 12, right? Jesus and the 12. But according to verse 15, how many people were there?"],["2099.839","Like 120 people, right? And and this shows us that there were many people"],["2104.96","around Jesus all the years of his ministry. There was a congregation. And"],["2110","now the congregation begins to function in a new capacity. Not simply people"],["2115.68","walking along listening to Jesus. What you know standing around. Oh, Jesus is going to do something cool. Let's wait"],["2121.28","for Jesus to do some do a miracle. No, now they are beginning to participate to"],["2127.44","take an active role. Since Jesus is no longer there to appoint someone, the disciples use a criteria to determine"],["2134.48","who should be considered. Someone who's been with them from the beginning. And then they cast lots believing that God"],["2139.599","will direct the lot to fall on the person who he deems best. Now today, to a certain extent, we do the same"],["2145.92","tradition when it comes to appointing church leaders. We look at a person's track record in life and ministry and"],["2152.24","then we pray about it and we ask God, you know, to guide us and then we we cast lots. we take a vote and uh members"],["2158.96","of FA Faith Bible Church, you will have an opportunity to participate in this ancient tradition in just a few weeks at"],["2165.04","our annual meeting. You're going to have an opportunity members who you just got some of you got their uh got their"],["2171.04","membership. Hold that up, right? And you walk in with it. No, don't you don't have to walk in with it. We got the rolls. We know who's on them. Uh you"],["2177.92","have the opportunity to vote on some new deacons, some new leaders, and you get to vote on the budget. It's always fun."],["2184.72","So, show up for that. uh if you're a member, you get to you're"],["2190","part of the congregation, you get to do these things. And we also have gifts and talents that we use to actively serve"],["2196.32","the congregation. So the first acts of the apostles, clean"],["2201.92","up Judas mess, move forward in one accord as a"],["2207.04","congregation. And we too, we have to clean up other people's messes. And we"],["2213.04","got three steps. What are they? trusting in God to deal with the injustice."],["2219.52","Our part is to forget. Oh, you got that one good. That was that was the key. And"],["2224.88","then the last one is move on. Serving in one accord. So"],["2232.24","here's the question. Which step do you need to take?"],["2238.56","Which one are you on? Lord, we just pray that you'll help us to apply these acts of the apostles to"],["2246.88","our lives, to the messes that we are in. And there's no denying life is not perfect and happy and good. There's"],["2253.119","brokenness. There's hurt. There's pain. Uh as we sang that song earlier, one day"],["2259.359","in our homecoming, we will all be together. We'll all be united. All will"],["2264.48","be made whole. We're not there yet. Lord, help us to do our part each and"],["2269.599","every day to trust you with the injustice, with the pain and the brokenness, to forgive those who have"],["2276.079","offended us, and then to move forward with the ministry that needs to be done"],["2281.359","in your church, the church of the living God, the pillar and ground of truth. Bless us in this we pray in Jesus name."],["2288.079","Amen."]]},{"id":"_hj_XXWX5ro","name":"2025-10-05  Introduction to the Book of Acts (Pastor Rob McNutt)","date":"2025-10-05","transcript":[["10","invite"],["22.32","you to take your copy of the word of God and turn to the book of Acts,"],["28.16","chapter 1. Starting a brand new series, the book of Acts. This is going to take"],["36.48","seven years. Not even a joke."],["41.92","You wait. I got one word to preach on"],["47.28","today. Just one. Let's see if you can figure out which"],["52.719","one it is. Acts 1 verse number one. The It's the That's what it No. The former"],["59.039","account I made, oh the theophilos, of all that Jesus began to do and teach"],["65.92","until the day in which he was taken up after he through the Holy Spirit had given commandments to the apostles whom"],["72.159","he had chosen, to whom he also presented himself alive after his suffering by"],["79.119","many infallible proofs, being seen by them during 40 days and speaking of the"],["84.4","things pertaining to the kingdom of God. Now, most of you know I have been away"],["90.479","for a month, but if you came uh new to Faith Bible Church in the last month, I"],["97.92","want to apologize. Mark's done. Just put him back on the"],["103.52","bench. So, now I want to thank Pastor Mark. Didn't you do a great job? Praise the Lord."],["112.56","But to all you new people, the cool guy's gone and you're stuck with me. But anyways, we were preaching every day uh"],["118.64","every Sunday s every weekend at the worship place in a church in Spain. Uh they have services on Saturday because"],["125.52","they rent a building from another church and that's when they're available to have their services, our missionaries, our elders in that church and they asked"],["132.319","me to come take that to take a little break, give them a little break. Now last weekend I spoke Saturday at the"],["138.4","worship place in Spain and then that afternoon uh immediately we went to the airport after the service and hopped on"],["143.84","a plane to Germany. arriving in Germany around midnight and our missionaries in Germany picked us up at the airport and"],["151.28","we were scheduled to speak on their church on Sunday at 4 p.m. They have services at 4 p.m. because that's when"],["159.12","they get the building for the church that they lease because they likewise don't have a building that they own and"],["164.319","so they lease from another church. Now, Chris Hwitt, our missionary in Germany, Illana and Pastor Mark and I all met him"],["172.16","32 years ago when we were all students at Washington Bible College together. He has not seen me in 32 years. And even"],["181.12","when we attended uh Washington Bible College together, I wouldn't say we were we were we were besties. Uh we were more"],["187.519","like acquaintances. And his wife Nicola, she uh didn't know anything of any of"],["193.68","us. She didn't go to Bible college with us and so we were complete strangers to her. Nevertheless, once we got off the"],["201.2","plane, Chris greeted us like we were long lost relatives. Big hugs and so"],["208","happy to see us again. And likewise, when we came out to the car to meet Nicola, same thing. Oh, so happy to meet"],["216.159","you and treated us like we were dear friends. They hosted us in their home"],["221.28","for three nights. They provided wonderful breakfastes. They drove us"],["226.4","around Germany showing us the sites. And then on Tuesday when we were to fly out,"],["232","Chris got up at 3:30 in the morning, drove us to the airport. We said, \"Chris, we can get a Uber.\" No, he"],["239.04","insisted, wouldn't hear anything of it. So, they extended their hospitality"],["244.4","and friendship to us. And we of course relayed our church's appreciation for"],["250.56","their church planning and evangelistic missionary efforts in Germany. And we said that Faith Bible Church is praying"],["257.84","for you and are going to continue to financially support you. And they said,"],["262.96","\"Well, come on back anytime. We'd love to have you back again.\" And they said, \"We'd love to have Pastor Mark come."],["269.199","Send Pastor Mark.\" I said, \"Well, he's probably due. We'll send him anyways.\" Likewise, we said, \"When you come to"],["276.16","America, you have a place to stay with us. We would love to have you in our home.\" After all, we are all brothers"],["282.08","and sisters in Christ. We're all working to fulfill the great commission that Jesus gave us. But after the time we"],["288.479","spent staying in their home, we now feel closer. We feel like we have a genuine"],["294.639","friendship. It's really nice to have people you consider friends. Amen. We"],["300.96","got to spend time serving with Brian and Jennifer Lucas, our missionaries in"],["306.24","Spain. And for the last three years, we've been going over, we have been developing a close friendship with them"],["312.56","as well. So, it's wonderful to uh have that time to serve with our friends and grow these relationships. Nevertheless,"],["319.68","after a month, we were ready to come back home to be with our family and our"],["325.12","friends here at St. Mary's County. As much as they enjoyed our time away, we"],["330.16","missed all of you because you're a blessing to us. This fellowship, you're"],["337.199","these relationships. You folks have been good to us and we value these"],["342.24","friendships as well. Aren't you thankful for friends?"],["347.28","One person. Okay. I was thinking about friendship because when I started working on this new"],["352.96","series through the book of Acts, Luke is writing this account, this historical record of what happened to the disciples"],["358.88","after Jesus departed and he's writing to a man named Theophilles. Now, at first glance, it sounds like the"],["365.44","author of the book, you know, of Acts, Luke, speaking directly to the recipient,"],["372.16","and his name is Theophilles. And that's very ordinary because everyone's got a name, right? you know, I'm Rob and"],["377.28","you're Paul and you're Chuck and and uh you know, the author introduce themselves at the beginning of their"],["382.4","books, their letters, and they tell us who they're writing to. Uh you know, the recipients. However, theophilus is a"],["390.8","Greek word, theo, which is all you Greek scholars, God. And"],["398.56","philosoph"],["404.56","is writing to a guy's name literally is friend of God. Or Luke is writing to"],["412.16","anyone or everyone who would assume the title, anyone who considers himself a"],["417.28","friend of God is Theophilos. In other words, it could be a title."],["423.199","Luke is writing to the friends of God. Luke's addressing Theophilos. That's"],["428.56","exactly how he began his gospel. Uh Luke the the book and we studied Luke not"],["433.919","that long ago. Uh chapter 1 verse number 1-4. We read even then in that he says,"],["440.8","\"In as much as many have taken in hand to set in order a narrative of those things which have been fully fulfilled"],["447.12","among you, just as those who from the beginning were eyewitnesses and ministers of the word delivered them to"],["453.84","us.\" Verse three. It seemed good to me also, having had perfect understanding of all the things from the very first,"],["460.16","to write you an orderly account, most excellent"],["465.199","Theophilles, that you may know the certainty of those things in which you were instructed."],["472.24","And then again here in Luke, Acts likewise begins saying, \"The former"],["477.599","account I made to you.\" That was the gospel of Luke. Oh, Theophilles. talking again to Theophilles and I'm"],["485.12","saying, well, that could be you."],["491.039","Question. Do you consider yourself a friend of God? A few months ago, I reached out to Chris"],["499.44","Hwitt, the Mar missionary in Germany through Facebook Messenger. And I asked"],["505.36","him if uh we could be come to Germany and see his ministry and visit his"],["510.879","church. And he is one of my friends on Facebook. And I assumed he would act like a friend to me. But you know,"],["518.32","friends on Facebook are not the same as real friends in real life, right? You know that is you say, \"Oh, this is my friend on Facebook.\" and then they say"],["523.599","horrible things to you. So, but I was hopeful he would be acting more like a a real friend. And he did. He replied to"],["529.76","my request and extended this invitation. Come stay with us in Germany. And uh"],["534.8","then he took us in and then he shared his home and they fed us and they sheltered us and they drove us all around and we had deep talks with him"],["541.2","and his wife about their personal needs and their challenges in life and ministry because you know that's what"],["547.92","you do when you're spending time with friends. But what does a friend of God do? You"],["554.399","know, I I can't pick God up at the airport. I can't have lunch with God. If"],["560.8","Theophilos is a friend of God's, how does that work? What does that look like? How do you know if God considers"],["567.76","you a friend? Should you assume? If you're a friend of God, this book is"],["574.399","dressed addressed personally to you, which is amazing to consider because it was written 1,940 years ago. And it"],["582.56","could be written to you. But I want to know, are you Theophilus? Well, we don't have to wonder because"],["589.92","scripture actually tells us who is a considered a friend of God. So listen"],["595.2","carefully and I'm going to show you who is considered a friend of God. So first"],["600.72","of all, a friend of God is someone who has faith and trust in God. Abraham"],["608.399","believed God and it was counted to him as righteousness and he was called"],["614.64","Theophilles, a friend of God. So friendship with God begins with simply"],["622","faith, not just belief that, oh, I believe there is a God. Yeah, sure, I'm sure there's a God. No, the demons"],["628.32","believe and tremble and they're not counted as friends of God. No, it's not just I sort of believe there's a God."],["635.279","It's I have faith in his character, in his existence. I'm trusting in his"],["641.68","promises of who he says he is. So Chris told me he would pick us up at"],["649.2","the airport and we could stay in his home. And based on his words, Elelliana and I jumped online, booked a flight to"],["656.88","Germany, but we did not book a hotel or a car rental. We flew to Germany. We got"],["664.24","there at 12:30 at night, walked out of the airport,"],["672.88","and stood on the side of the road wondering if we could see a guy that"],["678.64","looked like he's from Trinidad playing a steel trim pan. Maybe he would pick us up. He does. He"],["685.12","plays a steel pan. So anyways, we walk out there and sure enough, see this guy,"],["690.48","looks exactly the same, just a little bit older, but looks really awesome. And he's like, and I'm like, 32 years,"],["698.56","hadn't seen each other, and big hugs, so glad to see you. So happy you're here."],["706.079","And we got reunited. We did not have a"],["712.56","signed contract, you know, when we booked uh our flights. The flights, you know, you send them their money and then"],["717.92","they send you a confirmation number, right? And then they send you a little"],["723.279","QR code and they send you all this paperwork that yes, you have a flight. But when I text Chris, I did not get a"],["732.16","confirmation code. I did not get a notorized letter proving that he was"],["738.56","going to pick me up and he would in fact be true to his word and he would he would let me stay in his house. I just"],["745.839","trusted what he said. I had a Facebook post and I said, \"Well, Chris says we're"],["752.959","going to stay with him.\" I was like, \"Okay.\" And he came through. He was true to his word. Are you a friend who is"],["759.76","true to your word? Well, I try to be. Sometimes I have to admit I forget what I said and uh that's embarrassing and I"],["767.2","don't keep my word because I couldn't remember what I said. Sometimes unforeseen events happen that prevent me"],["772.72","from keeping my word. But my honest intention is if I said it that I will do"],["778.88","it. I'll be true to my word so that my friends will trust me. Do you believe"],["785.36","God's word? Do you trust his promises? If you are Theophilus, you do. But if"],["792.959","you doubt his word, if you have misgivings about his declarations, probably you're not his friend. If Chris"],["801.76","said, \"I'll pick you up, Rob, and you and I, we got a room that you can stay in.\" And I said, \"Ah, that's okay. I'd"],["808.8","sooner rent a car, and I would sooner book a hotel. You know, I haven't seen you in 32 years. You know, I want to be"],["815.04","sure I got a place. I'm not prepared to trust you,"],["820.16","oh Facebook friend. That would have came across very"],["825.279","unfriendly. If I mandated, okay, Chris, uh, but I need to see that offer in writing. I"],["831.68","want you to go get a lawyer to notoriize that. Probably Chris would have said, you know what, on second thought, uh,"],["837.199","don't bother coming. You know, just stay in Spain. Uh, don't do that. If you can't trust me, then why even bother try"],["845.76","to visit us? Why have a relationship? Why invest the time?"],["851.36","Does that make sense? The first step to being a friend of God is you need to take a step of faith."],["858.88","Faith is the evidence of things hoped for, the knowledge of things"],["866.079","not seen. All that God has said in his word about who he is and what he's done"],["872.16","and what he's planning to do, you've not seen it. Can you believe him if you"],["877.839","haven't seen him? Did I believe Chris had a car in a house and would share with me? I had seen him"],["883.12","in 32 years. I believed him. I've never seen God. I I'd never met Luke, Moses,"],["890.48","King David, Jesus Christ, but I believe it. Do you?"],["896.72","Well, if you want to be a friend of God, you got to trust his word. Second,"],["903.68","obedience and alignment with his will. Jesus said in Luke 15:14, \"You are my"],["910.24","friends if you do what I commanded you.\" Jesus links friendship with obedience,"],["918.48","not out of duty, but out of a relationship of love and an alignment"],["924.079","with his heart. So Chris asked me to preach at his church and while we were"],["930.16","in Spain uh he was dialoguing with me and he said could I send him the title"],["935.36","to his message and could I give him the passage that I would be speaking from and then he asked if I could send a"],["940.959","picture of me and Iana so his little AV team could put a nice little slide up for us. And then he asked me if I could"],["947.199","send him all the verses that I was using so his translator could get that translated over into Germany for his"],["953.12","German audience. And then he asked me for all my slides. He asked me for all this two weeks"],["961.199","before we were even going to be in Germany. Now Suzanne's giggling about that right now because she will tell"],["967.6","you, Pastor Mark will tell you, Pastor Rob does not have a sermon title ready"],["973.04","until Friday afternoon before he preaches. Pastor Rob does not"],["980.32","have a sermon done until Saturday before he preaches."],["987.759","And to be honest, sometimes Sunday morning"],["994.16","at 6:45 as it was today, finishing it up."],["1002.16","When Pastor Mark first came on staff last year, he he was looking at all the things he wanted to get his hands on and"],["1007.92","do, and he's like, \"I want to I want to do the the title slides for you, Rob.\" And I'm like, \"Okay, you can do the title slides.\" And he's like, \"You know,"],["1014","it'd be great if you could give me the title on Wednesdays.\" And Suzanne just went,"],["1019.25","[Music] she said, \"That's not how it works with"],["1025.28","Pastor Rob. He hasn't even started a sermon on Wednesdays.\""],["1030.64","So Chris asked me two weeks ahead of time and that's not how I work. So you"],["1037.28","know what I said to my friend Chris who had asked me to come speak at his church, who had asked me to minister to"],["1042.799","his congregation, who had asked for all these things because it would help his team get ready ahead of time. I said,"],["1050.559","\"Brother, I will get that together for you.\" And I sat down and I collected my"],["1056.64","thoughts and I sent him a title and passages two weeks early."],["1066.64","And then a week before I sent his translator my entire manuscript. I wrote"],["1074.24","a sermon one whole week ahead of time. I did all that because my friend said it"],["1081.679","would help his people if I would do that for him. For a friend, you will honor a"],["1087.76","request. You will accommodate an appeal. My closest friend in the whole world is"],["1095.36","Illana. And says to me, \"Rob, could you run to the store and get this? And on"],["1101.28","your way, would you take the trash to the dump?\" And I say, \"Do it yourself."],["1107.52","Stop being so demanding."],["1117.52","I'm going to slide over here a little bit. I've been married 31 years."],["1124.16","If I says, \"Ah, stop clap.\" If I says,"],["1129.2","\"Could you do this for me and would you take the trash out?\" I say, \"Yes, dear."],["1136.72","She's my best friend. She bakes me brown bread. She manages"],["1142.88","all the accounts. I don't even have to do any paperwork. She kisses me good morning and good night. And because of"],["1150.08","our close friendship, when she asks me to do something, I"],["1155.919","do it. Do you do what God commands?"],["1161.2","If you do, you're his friend. If you tell God, \"No, stop being"],["1168.48","so demanding. Leave me alone.\" You're not his friend."],["1175.36","Third, intimacy and revelation. John 15:15, \"No longer have I called you"],["1182.32","servants, but I called you friends. For all that you heard from my father, I have made known to you.\" Friendship with"],["1190.08","God involves sharing in his plans, receiving his wisdom, and walking in"],["1196.88","spiritual intimacy. Chris and Nicola have two children,"],["1203.36","Joshua and Katie. They are 16 and they're 14. They are lovely children. Uh"],["1208.559","we enjoyed meeting them and we enjoyed hearing all about them. and uh he loves to play soccer and he's trying to learn"],["1214.24","some music and she likes dance and she likes handball and just very sweet children. And then they said, \"Well,"],["1220.72","Pastor Rob Iliana, what about your children? Do you have children?\" And it's like, \"Yes, we have grown young"],["1225.84","men.\" Roberto is 30 and matter of fact, we're going to be grandchildren. That's"],["1231.12","how old we are. We're going to have a grandbaby. We're excited about that. And then Ricky is, I think, almost 28,"],["1236.48","right? Coming up soon, real quick. Birthday's coming. and Tony's 25 and uh"],["1241.679","they asked you know you know how are your sons and we told them well they've all graduated from college and they're all working full-time jobs and they're"],["1248.48","all serving in church and they're all married and all have wonderful wives who"],["1254.24","love the Lord and they said oh well can we ask you some questions about"],["1260.08","parenting how do you handle this situation with teenagers and how do you handle this"],["1266.559","type of scenario and they asked us if we would open up and give some parenting advice and then we gave them some"],["1272.4","ministry advice and then we gave them some personal relationship advice and whatever question they asked us we gave"],["1278.96","them an honest answer and they said thank you this is so helpful this is so"],["1284.24","good to hear this information if they had said how did you help your children stay in the faith and we responded well"],["1293.039","now that's pretty personal we're not going to share our ideas you need to figure this stuff out for yourself. Is"],["1298.88","that what you'd expect from a friend? No. A friend will open up to you. A"],["1304.48","friend will share. Let me let me tell you how I was blessed. Let me tell you how I handled this challenging"],["1310.799","situation. Let me tell you what got me through this hardship. God opens up with"],["1316.32","us. God opens up with us. He said, \"This is what I created, and this is what I promised Adam and Eve, and this is what"],["1322.559","I promised Abraham and Moses and David and the children of Israel, and these are the plans that I have, and these are"],["1327.919","the plans that I have for you. But here's some mistakes that were made. Here's some pitfalls. Here's some"],["1333.2","concerns that I have.\" But then here's some ways that we're going to overcome. Here's the path. That's what a friend"],["1341.039","does. A friend listens and opens up and shares intimate details. Do you take"],["1346.799","time to listen to God's plans, his details, or do you say, \"Not now, God."],["1354.24","I'm kind of busy.\" Or you go, \"Wow, God.\" Like, tmi,"],["1361.76","too much information going on here. I mean, you want me to read all this, you know? I really don't have time to hear"],["1368","all this. The Lord is my shepherd. I shall not"],["1374.159","want. He makes me lie down in green pastures. He leads me."],["1381.84","Come along sheep. Sheep. Sheep. Beside still waters. He"],["1388.72","restores my soul. He leads me in the path of righteousness for his name's"],["1394.72","sake. Okay. Okay. Wait a sec. God"],["1400.72","kind of sounds like you think you're the leader or something like you expect me just to go along with your plans"],["1409.039","and you know just kind of go here and go well listen buddy I got my own plans. I"],["1415.44","got my own thoughts on the matter. I'm seeing some red flags."],["1421.28","Maybe we're not compatible. Lots of people hear God's thoughts and"],["1427.2","they conclude we're not compatible. If that's who God is and that's what he"],["1432.96","thinks, I I don't want to associate with him. Now, God's not going to force you to be"],["1439.2","his friend, but he's not going to change who he is for you either."],["1444.799","To be the you got to be open to his ways."],["1450.559","Fourth step, reverence and covenant loyalty. Psalms"],["1457.2","25:14, the friendship of the Lord is for those who fear him and he makes known to them"],["1466.559","his covenants. This isn't fear like, you know, Halloween jump scare. This is awe. This"],["1476","is respect and covenant faithfulness."],["1482.559","This is what opens the door to this relationship. Covenant faithfulness. So"],["1488.24","you know what that is, right? And so when I and I got married, we formally"],["1493.52","stood in front of family and friends, in front of the church, and we pledged vows"],["1499.44","of soberness, reverence, and the fear of God. And we"],["1506.4","comprehended that this marriage process, this wedding process is how we get to a"],["1513.84","deeper relationship. But I've also seen people on their"],["1518.88","wedding day show up completely hammered, you know, and stagger their way through"],["1525.44","the sam ceremony, not taking any of it seriously. I've seen brides focus on,"],["1531.44","you know, decorations and hair and makeup and everything's got to be perfect, but not fully grasping the"],["1539.36","vows. Well, not a bit of wonder. So many of our marriages don't last. There's no"],["1545.36","understanding of reverence, no comprehension of what covenant faithfulness implies. They're not ready"],["1552.4","for that level of friendship, that level that says, \"Till what?"],["1557.6","Death do us part.\" Some people are flippant and nonchalant"],["1564.64","about everything and they have a hard time taking things seriously or showing any amount of respect. But Jesus pledged"],["1573.2","his life. He died to give us eternal life. He is making us royalty. He is"],["1582.64","going to give us a inheritance in his eternal kingdom. And that ought to"],["1588.24","inspire awe and grandeur in us. But we if we are too ignorant and disrespectful"],["1594.799","to even understand the magnitude of the offer, too foolish to grasp the gravity of the situation and the importance of"],["1601.6","the moment, we don't value the covenantal friendship."],["1608.48","If instead of awe, we feel apathy, then we're not truly his friends. To go to a"],["1615.679","deep friendship, it requires a level of respect, a passion for loyalty, and a"],["1621.76","willingness to sacrifice. That's who God is, and that's who he"],["1627.44","makes covenants with. People are prepared to pledge their commitment to him. Have you ever had a friend who was"],["1635.2","prepared to get your back and fight for you? You knew like, if the chips are down, this guy is going to go to war"],["1642.08","with me. someone who took your relationship so seriously they would put themselves in"],["1647.76","danger. Now ladies, I know I know many of your husbands seem like they just"],["1654","don't care. They don't care about the little things or the details, you know, and they're just herp derping along like"],["1660.96","they don't know what's going on in the relationship. But answer me this."],["1667.12","If you were being threatened, do you think he would jump in and fight to save you? Would he take a beating on"],["1674.96","your behalf? So, here's something I know about a lot of the guys around here, and I've seen"],["1681.6","them in action. There are people in here prepared to die to protect others."],["1688.72","And you never you never know. You guys will never see everything that's happening around here, but there have"],["1693.76","been situations even in the service where people thought I I was in danger."],["1700.399","And I could see the eyes of my friends locking in on me and watching oh so"],["1708.159","intently. And they were watching everything I did, paying attention to my"],["1713.2","movements. And if I was like, they were paying very close attention."],["1719.44","And then I watched them just kind of poise themselves in and"],["1726.32","closer, prepared to get in harm's way to"],["1731.36","protect me, to protect us."],["1736.64","We have these covenants that have been made, not formally written down, but there are there's a band of brotherhood"],["1744.96","as the people of God that we know we value that we're prepared to sacrifice"],["1752.559","property or even our lives for one another. And as brothers and sisters in"],["1758.64","Christ, we have this example set for us. Greater love has no man than this, that"],["1764.08","a man would lay down his life for his friend. That's a covenant Jesus made with us, with his"],["1771.36","own blood. And I have been blessed. I am surrounded by people who aspire to those"],["1778.399","kinds of relationships, who want that level of commitment. But others, they"],["1784.64","have no kind of love or respect for anyone to be willing to pledge that"],["1790.559","level of loyalty. Consequently, they have none. They have"],["1796","no loyalty. They have none for others, but they've got none for themselves. So,"],["1801.36","if they were ever down and out, people would just be like, \"Who's that guy?\" Oh,"],["1806.399","sucks to be him. Cuz they've never made the effort. They've never put in the"],["1812.32","blood, sweat, and tears to develop those relationships. God offers covenantal,"],["1818.799","sacrificial loyalty. But flippant, irreverent people do not value those"],["1824.559","kinds of relationships. They're too shallow. They're not prepared for those types of deep friendships. To be a"],["1830.64","friend of God requires fear, awe, and respect of covenantal loyalty."],["1839.52","And number five, lastly, Exodus 33:11. The Lord used to speak to"],["1846.88","Moses face to face as a man speaks to his friend. Face-to-face"],["1852.88","communion. So Moses relationship with God marked was marked by direct personal"],["1860.24","communication. Personal communication with God."],["1866","had a good friend in high school after graduation. He went to college in Chicago and I came to college down here,"],["1871.84","Washington DC on Christmas or summer breaks. You know, we were home back in the back in New Brunswick. We would try"],["1877.919","to get together and hang out. But every year, life just took us further and further away from each other. And he met"],["1884.08","this girl in Chicago from Ohio. And uh he married her and I stayed with him at"],["1889.6","his wedding and he settled in and lived in Ohio for many years. And then a year later when I was getting married, he"],["1895.44","came down uh and stood with me on my wedding in DC. But after that, I hardly"],["1901.6","ever saw him again. He lived in Ohio and I lived in the Maritime Provinces of Canada and then I moved down here to the"],["1906.96","DMV. And so we just haven't seen each other. But in the last few years, I saw"],["1912.159","through Facebook that he had moved to Halifax, Nova Scotia. Okay, that's cool."],["1917.76","This past summer, we were in Halifax, Nova Scotia. And you know, I was posting"],["1923.6","all my little pictures, Halifax, you know, like here's here's me and the family down there on the harbor drinking"],["1929.519","some Tim Hortons, eating some poutine. And he commented on my pictures. He's"],["1934.64","like, \"Oh, Rob's in Hellifax.\" And he says on one of my pictures, he said, \"I'm sorry I missed you uh while you"],["1941.6","were in town.\" And I says, \"Actually, I'm still in town.\""],["1949.36","Now, the next response he gives is going to be telling, isn't it? Because if he"],["1956.32","says nothing, I know he's not sorry he missed me. If"],["1962.159","he says nothing, I will know that time has moved us beyond being friends. And"],["1968.88","now he is just somebody that I used to know. Now you're just somebody that I"],["1975.919","used to know. Somebody admit it. You have missed me breaking"],["1982.48","out in song and mid sermon, haven't you? I know you have."],["1991.519","I says, \"I'm still in town.\" He says, \"I suspect you have plans with"],["1997.76","your family, but could you possibly make time to see me?\" And I says, \"Absolutely. I'd love to see you.\" And"],["2004.24","he says, \"Well, I get off work at 6:00. can I meet you down by the harbor? And I says, I'll be sitting right here in front of the Tim Hortons waiting."],["2011.84","So at 5:50, I and I are sitting there at the Halifax Harbor eating a poutine"],["2018","waiting for him to show up. Actually, I don't have a watch. I I look"],["2023.76","at my phone. I just just acting. 5:55 I get a message. Sorry, Rob. Work"],["2031.519","was busy. I'm running 10 minutes late, but I'm"],["2037.2","coming. And I says, \"No problem. We're right here.\""],["2042.48","6:15, I look up and I see this familiar but older looking fella come walking"],["2050.879","down the harbor and get a big high five and a big hug. And we sat down for an"],["2056.24","hour on a bench and we caught up with each other on 30 years of what we've been doing. And that face-toface"],["2064.72","meeting after 30 years assured me he's still my friend."],["2071.679","We have not been able to see each other because we live thousands of miles apart. But once we finally were able to"],["2077.839","be in the same town, he was happy to come see me and I was so happy to see him."],["2084.399","remember uh I was telling you about my cousins and I threw they were doing the um the international"],["2091.359","uh fish bass fishing tournament in Mexico and I put the pictures up there of my cousins. They actually came in third place uh in that tournament."],["2098.24","America won of course but Canada they ran on the team Canada and they came in third place and I was telling you about"],["2103.92","them and and I said you know we're going to be there in the summer and there's going to be a family get together and uh maybe they'll come see me or maybe they"],["2110.4","won't. They might be fishing. fishing might be more fun than coming to see me. Well, guess what? They showed up and we"],["2116","had a chance to visit for the first time in 17 years. And these short visits"],["2121.839","meant a lot to me. When I left Canada to come here to serve the Lord, it meant I"],["2127.52","was leaving a lot of friends and family behind. And it meant that there would not be opportunities for us to do life"],["2134.48","and spend time together. And nobody got to see my kids grow up. And maybe we're all just strangers now. Maybe we're just"],["2142.16","somebody that we used to know, somebody."],["2147.28","But when the opportunity presented itself, these people took the time to come see me face to face. And it made me"],["2155.119","feel that I haven't lost these relationships. They're still my friends. They would see me if they could, and I"],["2162.32","would be there for them if I could. But if my friend did not show up in"],["2167.44","Hellifax, I would conclude, I'm really not worth his time. But I"],["2174","was. To be a friend, you have to make time to be with them. Moses spent time with God."],["2182.48","Jesus had all the disciples and he had all the multitude of people wanting his time. And he would pull away from all of"],["2188.72","them and go up in the hill and spend time with his heavenly father alone. And"],["2194.24","God is always with us. He's always available to meet with us. If you never"],["2200.16","talk to him, it's not because he's distant. It's because you don't value the relationship. You're not his friend."],["2208","He's giving you his word. He said all of these things that he wants you to know"],["2213.04","and wants you to hear from him. This is his family right here. All these are his"],["2218.32","children to see and know. My family got to meet my new daughter-in-law, Becky, this summer. They took the time. They"],["2224.96","wanted to find out who she was. And that meant a lot to Ricky because they hardly know him, but they wanted to meet his"],["2230.8","new bride. God's always with us. His family is always here. His word is right"],["2236.24","here speaking to us. If you were his friend, you would devote some time to"],["2241.92","being with him. So the question is, are you Theophilos?"],["2250.4","Told you I'm only preaching on one word here, right? If you're trusting in God, if you are"],["2256.4","obeying God, if you are taking his will seriously, if you're entering into a"],["2262.32","committed relationship with God, if you spend time with God, then yes, you are"],["2268.8","Theophilos. And the book of Acts is written directly to you. Now, if you're not a friend of God, well, the good news"],["2275.92","is that choice is yours because Jesus will"],["2281.28","be your friend. He even said, \"Behold, I stand at the door and I'm knocking. If"],["2288.96","anyone hears my voice and opens the door, I'm going to come in.\" Now, that might sound weird to some of the younger"],["2295.119","people because you don't know remember this, but back in the olden days when we didn't have cell phones, We"],["2302.48","didn't have any phones. I'm not joking. There was like we lived in a trailer park and like there was one"],["2308.8","phone in the whole park and we would all knock on the door to use somebody's phone. If we wanted to see our friends,"],["2314.8","we would walk over to their house."],["2323.52","Can Harry come out and play? Or Harry would say, \"Come on in.\" Right."],["2329.04","And then we go in the house and we would hang out together and mom bake cookies or we're going to go out and play ball,"],["2334.72","right? That we would knock on each other's doors. And that's what Jesus is saying here. I'm standing at the door."],["2340.56","I'm knocking. And he's waiting for the invitation. You"],["2345.68","want to be my friend? You want to hang with me? You want to let me in?"],["2351.52","I really think you should answer that door. I really think you should begin that relationship. be a friend of God's"],["2360.56","and then you'll know what this whole letter is about. Let's bow in prayer. Lord Jesus, we pray for each and every"],["2366.079","person here that they would want to be your friend that they would understand that yes, it is a commitment. Yes, there"],["2372.4","are steps, but yes, you are offering everything. The God of heaven and earth,"],["2378","the God who rules the nations, the God who has all of eternity in his hand, wants us to be"],["2386.48","in a relationship with him. I pray that each and everyone here would open that door and say, \"Dear Jesus, I want to I"],["2392.88","want to know you. Please come into my life. Please let me get to know you. Help me understand who you are.\" And"],["2398.64","pray for each and every heart, each and every home that we would all be your friend. Thank you for that offer. We"],["2406.48","pray in Jesus name."]]},{"id":"4xx9wKSmwZY","name":"2025-11-09  The Holy Spirit and the Messiah (Pastor Rob McNutt)","date":"2025-11-09","transcript":[["22.08","The other day I was at Harris Teter walking through the meat section because"],["29.92","that is one of my official jobs. Don't know when that happened, but it's"],["35.44","now my role to pick out the protein. So, I whatever grocery store we're in, I"],["40.96","always go check out if there's any deals on meat. And lo and behold, Harris Teter had a buy one bag of shrimp and get two"],["49.76","free. I know, right? I mean, everybody likes a buy one get one free. This is"],["55.039","buy one get two free. And I was like, Harris Teter, you have a deal. Take my"],["61.92","money. And since we all agree that we like uh to get two for the price of one,"],["67.119","you'll be so happy to know that Peter is going to give us two sermons in this one"],["72.64","passage today, which means you're going to get your money's worth today. You're going to get two sermons for the"],["79.04","price of one. And these sermons stem from Acts 2 verse number 12 and 13 where"],["87.439","it says they were so amazed and perplexed saying one to another, \"What could this mean?\" And others mocked and"],["93.52","said, \"They're full of new wine. The disciples were drunk.\" No. Last week we"],["100.24","learned all about Pentecost and saw the effects of the Holy Spirit filling the"],["105.84","disciples. There was a mighty rushing wind. What looked like tongues of fire stood over everyone and they all started"],["112.64","speaking in tongues. The multitude in Jerusalem heard this commotion and they"],["118.159","came running to see what was going on and they saw these Galileans speaking in foreign tongues, speaking in their"],["125.759","languages. We observed that this miracle validated the disciples message. Their"],["132.64","message of course was Jesus rose again. He rose from the dead. Yeah."],["139.28","But you know the grave is already open. Everyone could see that. So why did they need their message validated? Because"],["145.28","the religious leaders of the nation had another explanation. They said the disciples have stolen the body."],["154.239","But who's telling the truth? How do we know who speaks for God? Who really has"],["160.239","the word of the Lord? The conclusion for last week's sermon was the people who"],["165.36","the spirit of the Lord fills are the people who have the word of the Lord."],["170.56","But since the Jews had never seen anyone filled with the spirit of the Lord, they don't know what's going on and they're"],["176.72","like, well, these people are drunk. But then Peter takes everyone to the Old Testament to explain what is happening."],["183.28","So the first sermon what's happening chapter 2 verse number 14- 21 Peter"],["189.519","stands up raises his voice and says to them men of Judah and all who dwell in Jerusalem let me let it this be known to"],["197.519","you and heed my words for these are not drunk as you suppose since it's only the"],["202.72","third hour of the day but this is what is spoken of by the prophet Joel"],["208.08","and it shall come to pass in the last days says God I will pour out my spirit on all flesh. Your sons, your daughters"],["214.959","will prophesy. Your young men shall see visions. Your old men shall dream dreams"],["220.239","on your my men's servants and on my maid servants. I will pour out my spirit on"],["225.36","those days, and they shall prophesy. I will show wonders in the heavens above, signs in the earth beneath, blood and"],["231.519","fire, vapor of smoke, the sun will be turned to dark, the moon into blood before the coming of the great and"],["238.159","awesome day of the Lord. And it shall come to pass that whosoever calls on the"],["243.68","name of the Lord shall be saved. So the last days he says this is like the la as"],["250.799","it says in the last days says God. And when we think last days we think what?"],["257.199","We think end times. We think tribulation. We we think right before the return of"],["262.88","Jesus. But Peter is uh going to show us something just uh a little bit"],["268.639","different. the the New Testament authors referred to their times as the last days. An example of that is actually"],["276","Hebrews chapter 1 when it said uh in God in who at various times"],["282.96","in various ways spoke in times past to the fathers by the prophets but in these"],["288.32","last days he said spoke to us by his son. In these last days the author said"],["294.8","he spoke to us by his son who he appointed heir of all things. The former times was the prophets of the Old"],["302.16","Testament and they hadn't heard any thing from them for the last 400 years. So those were the former times. The last"],["308.16","days according to the authors of New Testament was their time. Now the last days compared to Joel's time, the events"],["314.88","that are folding here in the time of Jesus, that's all future compared to Joel. For Jesus disciples, they are most"],["322.479","definitely convinced that they are in the last days. Especially in the letters to the churches, one of the reoccurring"],["328.72","themes in the New Testament is the return of Jesus and we are always instructed to watch and be ready. So"],["337.28","Peter boldly says this is the fulfillment of Joel. This is the last days. But in hindsight now 2,000 years"],["344.479","later, uh what happened in Acts 2 is not the total fulfillment of Joel. It's not"],["350.32","the last days as we envision them. So what we have here is something we need"],["355.44","we see often in scripture a partial fulfillment an example of progressive"],["362.56","revelation. Progressive revelation. What is that? Well God didn't reveal"],["367.919","everything all at once. Instead he unfolds his plan step by step throughout"],["374","history. Early scriptures like Genesis or like what we observe today in Joel"],["379.199","introduce a foundational truth while later texts the gospels, the epistles"],["385.12","clarify and complete those truths. It's not a contradiction. It is a development"],["392.4","from shadow to substance, from promise to fulfillment. So the last day prophecy"],["399.12","of Joel is not completely fulfilled here at Pentecost. Peter doesn't really know"],["404.4","that. We do not get the entire revelation of the last days until"],["410","Revelation, right? The book of Revelation. Again, this is not a contradiction. We saw the same thing"],["415.52","with Jesus. Hey, he's called the Messiah. Uh he came to fulfill the Old Testament prophecies through his birth,"],["421.759","his ministry, his death and resurrection. But he did not fulfill all the Old Testament prophecies. There are"],["428","prophecies still waiting to be fulfilled at his return. But that doesn't mean he's not the Messiah. Remember that was"],["435.44","the mistake that the people made in the in his time in the gospels and even his"],["440.72","own disciples made that mistake. They were looking for the conquering king Messiah uh that Isaiah chapter 9 spoke"],["448","of. Isaiah chapter 9:6, \"Unto us a child is born. Unto us a son is given. The"],["454.08","government will be upon his shoulders and his name will be called Wonderful Counselor, Mighty God, Everlasting"],["461.28","Father, Prince of Peace, of the increase of his government and peace there will be no end. And upon the throne of David"],["467.28","and over his kingdom to order it and establish it with judgment and justice from that time forever more. That's what"],["475.919","they were looking for. Not the suffering servant sacrifice for sin Messiah"],["481.919","described by the same prophet Isaiah 53. You know this one as well. Surely he is"],["488","born our groove. He is carried our sorrows. Yet we esteemed him stricken, smitten of God, afflicted, but he was"],["494.96","wounded for our transgressions. He was bruised for our iniquities. The chastisement of our peace was upon him."],["501.039","And by his stripes we were healed. All we like sheep have gone astray. We have turned everyone to his own way and the"],["507.039","Lord has laid on him the iniquity of us all. He was oppressed and he was afflicted yet he opened not his mouth."],["513.2","He was led as a lamb to the slaughter as a sheep before his shears is silent. So"],["519.599","he opened not his mouth. Jesus' death did not contradict Isaiah's prophecies"],["526.48","of a future coming king. He fulfilled all of these prophecies and he will"],["532","fulfill them progressively. Likewise, Joel's prophecy is partially fulfilled"],["537.2","here in Acts two. The rest of the last days fulfillment is going to come later. So, I would submit to you that verses"],["544.48","17- 18 was a partial fulfillment that happened in the first century at the"],["549.519","filling of the Holy Spirit at Pentecost where there was the pouring out of the spirit and the sons and the daughters"],["555.6","prophesied. The young men saw visions. The old men dreamed dreams on the maid servants on the men's servants. The on"],["562.08","he poured out his spirits and they prophesied. But then 19 through 21,"],["568.399","wonders in the heavens, signs in the earth beneath, blood and fire, vapor smoke, the sun turned the darkness, the"],["573.839","moon to blood before the coming of the great and awesome day of the Lord. That was fulfilled in Revelation, which means"],["581.44","we're still waiting for it. These passages talk about that. The sun being black, uh the the fire in the blood, the"],["588.32","smoke rising out of the abyss, the sun scorching the earth, that's all coming in the future. But the part of Joel that"],["596.56","is relevant to the folks in Acts and to the folks for the last 2,000 years and"],["604.08","the part that is relevant to anyone here today is verse 21. And it shall come to"],["610.88","pass that whosoever shall call upon the name of the Lord shall be saved."],["617.92","Whosoever who is that? If you are looking for a job and you go"],["624.64","for a job search website, you know, don't go to USA jobs these days, but you know, find another. You click on it and"],["630.8","there's a job description. Oh, that sounds interesting. I I think I'd enjoy doing that. Scroll down. Oh, annual"],["636.16","salary. Hey, that looks good. Ah, qualifications. Uh, got to be an"],["641.44","engineer. 10 years of experience. Security clearance. Ah, I don't qualify."],["650.959","I tried out for the uh JV basketball team two weeks ago. No, not two. Years ago"],["658.399","when I was in when I was in JV junior high. And uh, you know, back in the 70s and 80s, they did this really cool thing"],["665.279","for children to traumatize them. They would uh if you if you didn't if you"],["670.32","tried out for something, they would turn around and post in the the main foyer"],["675.519","foyer lobby. They would put the list of everybody who made the cut. And so"],["680.72","everybody could see and uh so it's lunchtime and I go down and I go looking for my name and I don't see it. So I"],["687.92","read it again because you know I'm dyslexic and I don't read well and it's still not there."],["694.48","I didn't qualify. So, I went outside and found a quiet little place and shed a tear of"],["700.079","disappointment. Not good enough to make the team. I didn't have grades good enough to make"],["706.72","get scholarships. And uh there's all these things in life that I've never been qualified to be a part of. So,"],["713.6","that's why I'm so grateful for the grace of God. It's never going to be good enough to"],["720.8","qualify for saintthood, for heaven. I'm not faithful enough. I'm"],["726.399","not devote enough. I'm not pious enough. Good thing it's not those things that qualify you for salvation. What is the"],["733.68","criteria? Whosoever calls upon the name of the Lord shall be"],["741.44","saved. It's not about my abilities, my capabilities, my holiness. It's all about what he did, who he is. Neither is"],["750.079","there salvation in any other. There is no other name under heaven given among men whereby we must be saved. What is"],["757.12","that name that we must be saved? At the name of Jesus, every knee shall bow and every tongue will confess Jesus is Lord"],["764.959","to the glory of God the Father. Whosoever calls on that name. The only criteria is calling on the name of"],["770.88","Jesus. It was relevant for the people in Acts. It's been relevant for the past 2,000 years. The the message is relevant"],["776.88","for everyone here today. Is it relevant for people tomorrow?"],["782.32","Yes, perhaps. But what do we know about tomorrow?"],["787.36","Do you know you have tomorrow? Well, I I I know what I've done in the past. I know what I'm currently actively"],["794.8","doing at this very moment. Who knows what tomorrow will bring? You cannot"],["800","bank on having a tomorrow. All I know is you will be saved if you"],["807.44","call upon the name of the Lord. Whosoever means anyone can qualify if"],["812.72","they call on the name of the Lord. What if they don't?"],["819.279","Then you don't qualify. So why wait? Maybe we don't wake up"],["824.56","tomorrow. It's so very easy to be saved. And yet so many people will not participate in"],["831.519","the one qualifying act. My sadness, my regret for not qualifying"],["837.92","for JB basketball team lasted oh day or"],["843.279","two. The regret for not receiving salvation through calling on the name of"],["848.48","Jesus. Well, that's going to be forever. The author of Hebrews, I quote him once again, \"How shall we escape if we"],["856.32","neglect so great a salvation? If you neglect your car, don't change your oil."],["862.399","Car breaks down. If you neglect your health, your body can break down. If you"],["868","neglect your spouse, your relationship can break down. If you neglect to call"],["873.04","on the name of the Lord, your soul is lost."],["878.56","See how that statement, whosoever, is so important and how it would neatly wrap up a"],["884.56","sermon. We could give an alter call right there, right? And we'd be finished. But that's just one sermon. That's part one. So Peter now has more."],["891.519","He's not done. second sermon. Now that he's explained what we are seeing and hearing with the tongues, he"],["898","goes on to explain Jesus death and resurrection. And just like he did with his explanation of the Holy Spirit, he"],["904.48","likewise explains the mystery of the death and resurrection of the Messiah by showing them in the prophecies of the"],["911.36","holy scriptures. He shows it to them in the Old Testament. Hear these words,"],["917.12","Peter says verse number, what verse are we in? 22"],["922.88","Men of Israel, hear these words. Jesus of Nazareth, a man attest by God to you"],["929.04","by miracles and wonders and signs which God did through him in your midst. As you yourself also know, him being"],["935.04","delivered by the determined purpose and fornowledge of God, you have taken by lawless hands, have crucified and put to"],["942.639","death, whom God raised up, having loosed the pains of death, because it was not possible that he should be held by it."],["949.839","For as David also David says concerning him, \"I saw the Lord always before my"],["955.199","face, for he is at my right hand, that I may not be shaken. Therefore, my heart"],["960.48","rejoiced and my tongue was glad. Moreover, my flesh also will rest in hope. For you will not leave my soul in"],["967.36","Hades, nor will you allow your holy one to see corruption. You have made known to me the ways of life. You will make me"],["974.72","full of joy in your presence.\" Peter says in verse 23, God determined"],["981.92","plan and fornowledge. It was God's determined plan of fornowledge. When was that? When was that determined in in"],["988.8","before? Well, we already quoted it, right? Isaiah 53. Uh like a lamb led to the slaughter. And what these Jews had"],["997.199","celebrated 50 days prior, the Passover was a celebration of that sacrifice of"],["1003.6","the lamb. And we learned that's when Jesus was actually sacrificed. And we also connect that to what the the last"],["1010.399","prophet they received, John the Baptist, he said if they were paying attention"],["1016.16","when Jesus came, he said, \"Behold what? The lamb of God who takes away the sins"],["1022.079","of the world.\" So the Messiah's death was fornown. But then that wasn't just"],["1027.919","his death, but God raised him up and that too was the determined plan. And"],["1033.36","then he quotes Psalms 16:es 8-10. I have set the Lord always before me. Because"],["1040.16","he is at my right hand, I shall not be moved. Therefore, my heart is glad, my glory rejoice. My flesh also will rest"],["1047.199","in hope. For you did not leave my soul in hell, nor did you allow your holy one"],["1053.2","to see corruption. Now, what Peter says next is very interesting. Peter offers"],["1058.64","up a literal interpretation of Psalms 16, which most of you know is exactly"],["1065.36","how we interpret scripture. Listen to his commentary. Verse 29. Men and"],["1070.48","brethren, let me speak freely to you of the patriarch David that he is both dead"],["1076.559","and buried and his tomb is with us to this day. Therefore, being a prophet."],["1082.64","So, he's like, okay, he can't be talking about himself there, right? Because he's dead and buried and there's his tomb. You can go look at it. Therefore, being"],["1088.559","a prophet, verse 30, and knowing that God had sworn with an oath to him that was of the fruit of his body according"],["1095.52","to the flesh, he would raise up the Christ to sit on his throne. He"],["1101.039","foreseeing this spoke concerning the resurrection of the Christ, that his soul was not left in Hades, nor did his"],["1107.6","flesh see corruption. This Jesus God raised up of which we are witnesses."],["1113.919","Therefore, being exalted to the right hand of God, and having received from the Father the promise of the Holy"],["1119.039","Spirit, he poured out this which you now see and hear."],["1125.28","So, Peter asserts that this isn't a this"],["1130.559","Psalm 16 is not poetic pinings of David. This is a prophetic utterance. He says"],["1137.36","he was a prophet and Peter connects the dots. David was declaring messianic"],["1142.64","prophecy and behold that's what has been fulfilled before our very eyes. He says he he quotes it"],["1149.52","directly that this was Jesus. This Jesus God raised up that we are witnesses of."],["1157.039","Jesus went into the grave but he did not decay. He rose again. David's body decayed in the grave. Jesus did not."],["1164","Jesus is the holy one spoken of by David. For David, verse number 34, did"],["1170","not ascend into the heavens. But he says himself, \"The Lord said to my Lord, sit"],["1177.2","at my right hand till I make your enemies my foottool.\" He's talking about somebody. The Lord, David said, the Lord"],["1185.12","said to my Lord, sit at my right hand. And we already know that the Jews"],["1190.24","interpreted that quote right there as messianic prophecy because Jesus had this discussion with the Pharisees. I"],["1196.799","don't remember in chapter uh Matthew chapter 22. And uh the Pharisees were gathered together and Jesus asked them,"],["1204.559","\"What do you think about the Christ? Whose son is he?\" And and they said, \"Well, he's the son of David.\" And then"],["1210","he said, 'Well, how then does David in the spirit say, call him Lord, saying,"],["1215.36","'The Lord says to my Lord, sit at my right hand.' And so he used that very messianic"],["1221.2","prophecy to ask them a tough theological question. They accurately recognized Psalms 11:0ic"],["1228.08","prophecy. Peter again uses the scripture to show the crowds that's what the disciples were proclaiming as the"],["1234.559","fulfillment of scripture. The Lord said to my Lord. So when we look at that"],["1239.76","passage, if you look at it in your copy of the New of the Old Testament or if you look it up on my slide here, what do"],["1244.799","you notice about the two words Lord? One is uppercase letters and the other"],["1250.72","is lowercase letters. And we know why that is, right? Because the fourletter word Lord in the Hebrew is yad vi. It is"],["1261.12","the tetragamaton. It is the literal name of God. Yahweh."],["1268.08","Yahweh. It means in English, if we were going to translate it, it means what?"],["1273.679","Means I am. And do you see it up here anywhere?"],["1280.4","When Jesus said, \"I am the bread of life. I am the light of the world. I am the good shepherd. I am the resurrection"],["1286.64","life.\" He's saying, \"I am God, the way, the truth, and the life. I am Yahweh,"],["1295.52","the vine.\" He's claiming deity every time he said that. So, we understand"],["1301.12","this this uh this name of God, Yahweh. And then back to Psalms, Yahweh says to"],["1308.24","my Lord, lowercase. So, that would be English uh translated Adonai or we might say, you know, my master or maybe my"],["1314.96","boss. So who is David's Lord in that text? We know Yahweh but who is he"],["1320.72","saying my Lord? The Messiah. So Yahweh says to the Messiah,"],["1326.88","\"Sit at my right hand till I make your enemies your foottool.\" Which is what the"],["1333.52","disciples saw. The Messiah on the on the up there on the mount. Jesus ascending"],["1341.84","up into heaven. The disciples message is Jesus ascended into heaven. Peter's"],["1347.919","scriptural proof is Psalms 110. Another prophecy fulfilled before their"],["1355.84","very eyes. And you've heard me say it before, and as long as you keep coming to Faith Bible Church, you're going to hear me say it over and over again."],["1362","Fulfillment of predictive prophecies is our smoking gun evidence that the Bible"],["1367.6","is the word of God. The Bible is truth. The things that the God told the"],["1372.799","prophets hundreds of years ago, thousands of years ago came true."],["1378.32","Prophecies hundreds of them fulfilled. So I have given you in the last two"],["1383.6","weeks two pieces of evidence, two answers to the question, how do we know the word of God is true?"],["1391.52","last week. The first answer is the spirit of the Lord accompanies his word"],["1397.44","fills the people who abide by his teaching producing in them the fruits of"],["1403.039","the spirit which are love, joy, peace, patience,"],["1409.52","working on it, kindness, goodness, faithfulness, gentleness, self-control. The second evidence of how we know the"],["1414.799","Bible is the word of God is true is the fulfillment of prophecies. No other"],["1420.159","religion has what Christianity has. Hundreds and hundreds of fulfilled prophecies. Not even Judaism has what"],["1427.84","Christianity has. They got the same writings. They got the same books. They got the same prophecies. But they reject"],["1433.44","the fulfillment of their own prophecies. They rejected their Messiah. Thus, they neglect so great a salvation."],["1442.24","We were in New York this week walking around and we were walking around in New York. I saw this um this picture right"],["1449.039","here up on uh light uh on traffic lights. I like the Messiah's here. I was"],["1454.96","like, \"Oh, isn't that interesting?\" And uh I needed to figure figure this out cuz, you know, I was kind of looking for"],["1460.799","it myself. And uh so I'm like, \"Well, who's this? Is is this is this the Messiah?\" And uh I did a little research"],["1468","and uh which means I Googled it. And this is Rabbi Manish"],["1474.48","Mendel Shin Shinserson, a revered figure in modern day Judaism"],["1482.32","that some of his followers believe he is the Messiah. Now, most Jews don't believe that guy's the Messiah. But this"],["1489.039","poster proves my point. Judaism continues to look for another Messiah."],["1494.96","The Jews continue to neglect the fulfillment of hundreds of their own prophecies as evidence that Jesus was,"],["1502.72","is, and forever will be the savior of the world. The prophecies spoken by"],["1508.559","David make no sense until they were fulfilled in the death and the resurrection of Jesus. It was foretold"],["1515.12","and then it came true before the very eyes of the population. All they had to do was read it here and look what what"],["1521.44","was happening. And there it was right there. right there."],["1526.72","I've had a lot of uh practice recently assembling furniture."],["1532","We have this great system. Uh Elelliana shops for furniture,"],["1538.48","buys it, click, and then it gets delivered to the house and I lug it in"],["1544.08","and I assemble it. We're a great team. Uh none of that stuff we would ever get to use if she didn't buy it. Oh, Emily's"],["1551.279","like, \"See, Ryer, see this is why I got to work.\" Huh. that none of that. We'd never get any of that stuff if she"],["1556.32","didn't buy it, but we wouldn't get to use it if I didn't lug it in the house and set it up. But the thing about"],["1561.76","assembling it is one needs to look carefully at the directions because it"],["1567.36","will show you a piece and it's a part and it is is labeled piece A and it'll say connect this piece to piece B and"],["1574.08","it'll say use screws CC and DD and uh connect them. And I'll say, \"Well, that seems easy enough, but wait a second."],["1580.32","Part A, uh, which which way's up?\" You know, is this the front? Is this the back? And likewise, part B, is this the"],["1586","front? Is this the back? And, uh, you have to look very carefully at the diagram and observe all the pre-drilled"],["1591.84","holes, observe all the new nuances, the details of the diagram and what they're portraying. Because if you don't, you"],["1598.64","won't connect it correctly. And you may have the wrong screws that were intended for another piece. And by the time you"],["1604","realize that, you're halfway through the project and have to assemble the whole thing and start all over. I'm speaking from personal experience"],["1610.96","here. [Music] And that's what's happening here. The"],["1617.039","people have been attending the synagogues and reciting the laws and the prophets and they've been traveling to"],["1623.279","Jerusalem and observing all of the feasts, but they have not been paying close attention to the details that are"],["1629.36","happening before their very eyes. all these passages that they know so well"],["1634.799","that Peter's quoting these prophecies just happened."],["1640.559","A couple years ago, we were uh it was predicted that it was an eclipse was going to happen. You remember the eclipse? And uh we were like, \"Hey, we"],["1646.72","should go over to Solomon's cuz we'll be able to sit out by the water and have a clear view.\" And we went over there and my dad was here, Bob and Sandy was with"],["1653.36","us. So, uh they were with us, too. And we went out there and sat there and we had the little, you know, the little paper glasses, prescribed glasses and we"],["1660.64","had those on and uh sure enough it happened just as they said and we got to watch this spectacular, you know, maybe"],["1666.24","once in a lifetime thing. Uh, now some people could have said uh an eclipse and"],["1671.279","whatever. You know, I'm too busy playing Minecraft to to want to go out there and look at an eclipse. Or people could have"],["1678.72","said, you know, oh, I'm going to watch this eclipse, but don't you tell me how to do it. I'm going to watch it with my"],["1685.279","naked eyes and just burn the retinas right out of my head. That's how I roll."],["1694.72","But those of us who listen to the experts got to witness a spectacular event safely. Hey Jerusalem,"],["1702.08","you're witnessing a spectacular event. Predictive prophecy coming true right"],["1707.84","before your very eyes. That's Peter's sermon, his second sermon."],["1712.88","And then interesting enough, the people responded. Verse 37, they were cut to"],["1718.799","their heart and they said to Peter and the rest of the disciples, \"Men and brethren, what shall we do?\" And Peter"],["1724.559","said, \"Repent and let everyone be baptized in the name of Jesus Christ for"],["1729.6","the remission of sins, and you will receive the Holy Spirit. For the promise is for you and your children, and to all"],["1735.84","those aar as many as the Lord our God will call.\" Now this answer has created"],["1743.679","much debate in Christianity. Is one saved if they are not baptized?"],["1749.6","After all, Peter clearly said, \"Repent and be baptized.\" So some people will"],["1756.24","say, \"You're not truly saved until you get in the tank.\" And while it is true"],["1761.84","after the book of Acts, everyone who confesses faith in Jesus, they do take that step to get baptized. We need to be"],["1767.039","careful not to add to scripture by saying you must be baptized. People have"],["1772.08","added a physical step, a work of righteousness that someone has to take in order to be saved, which would"],["1778.799","contradict what Paul says in other passages. Ephesians chapter 2, for by grace you are saved through faith. And"],["1785.52","that is not of yourself. That is a gift of God, not works, lest any man should"],["1790.799","boast. Not by works of righteousness that we have done, Paul says, but according to his mercy, he saves us."],["1797.84","Now, bear in mind, I'm not preaching you should not get baptized. What I'm trying to do is I'm just trying to split a theological hair here. Just splitting a"],["1804.799","hair. If someone was on a plane and that plane's going down, and they cried out, \"Jesus, save me of my sins, but you"],["1811.84","know, they didn't run to the little, you know, bathroom, get in the water.\""],["1817.52","Are are they going to make it to heaven? If someone's in the hospital bed and they prayed the sinner's prayer, \"Dear"],["1823.44","Lord Jesus, I believe you died on the cross for my sins. Please forgive me. Please make me your child.\" But we didn't get him there out of the bed and"],["1829.279","get him into the shower and get him baptized. Do we believe that he's not going to heaven? No. We believe that"],["1834.96","person has confessed with their mouth and believed in their heart the very simplest boiled down instruction that"],["1842.64","Peter said just a few verses ago reciting Joel. Whosoever"],["1849.12","calls on the name of the Lord shall be saved."],["1854.159","But let's talk about baptism. For the Jew in the New Testament era, being baptized meant publicly repenting,"],["1862.72","identifying with a new spiritual movement and signaling readiness for the coming of the kingdom of God. It was a"],["1868.72","radical act of renewal, often tied to the messianic expectation of personal"],["1874.88","and personal transformation. When John the Baptist was baptized in Jordan River, it wasn't just a ritual. It was a"],["1881.6","call to repentance, turning from sin, and preparing for the Messiah. So for the Jews, this was spiritually and"],["1889.76","socially very disruptive because it meant stepping outside of their religious establishment and embracing a"],["1897.279","new covenant. In Acts, Jewish believers were baptized to show faith in Jesus as"],["1902.64","the risen Messiah. And it marked entry into a new community of believers, the"],["1908.08","church. And while that why that was radical is it challenged the traditional authority of the temple centered"],["1915.36","worship. It redefined how people belong to God not by birth. We're Jews. We're"],["1921.84","circumcised. We follow the laws and the rituals of Moses. But by faith and by"],["1927.679","spirit. And it was a public declaration that would result in them as Jews being"],["1934.399","persecuted and even executed. So this is why it was important for Peter's audience. It was a public"],["1940.88","declaration of fulfillment of Jesus what Jesus taught in Matthew chapter 10 which"],["1946.64","I always uh I always tell the folks when we do the interview for baptism. So this is why we we got to get in the tank in"],["1952.88","front of everybody and this is also why you got to do your testimony because not everybody wants to give their testimony. I know I got to talk in front of"],["1958.96","everybody and I don't like to talk cuz I'm kind of shy. And I say, well, this is this is why we got to give our testimony because Jesus said, \"Whoever"],["1966.72","confesses me before men, I will confess before my father in heaven. Anyone who denies me before men will deny I will"],["1973.44","deny before my father in heaven.\" So, it's like this is our opportunity to make sure we confess Jesus. We confess"],["1980.48","Jesus as Lord. And that's the point of baptism. And we're going to do that here just in a minute."],["1988.08","Pastor Chess Mackenzie. I haven't told you a Chess McKenzie story in a while, have I? Anybody Anybody remember who Chess McKenzie is? It's been a been a"],["1994.799","been a minute. Nobody remembers. Okay. Well, Pastor Chess Mackenzie was my mentor uh for two years from 98 to 2000."],["2002.24","And uh he was he had planted a church in Bridgewater, Nova Scotia, and he retired uh and he moved to Toronto, Nova Scotia."],["2008.48","And then we asked if he would come on at the people's church and mentor me because I was 27 years old and I needed"],["2013.679","to learn a lot. So we brought chess on and in his early years before he he had planted that church he was a missionary"],["2020.559","in India in the in the 60s and the 70s and uh he was he had a lot of experience"],["2026.48","working with the sheik and the Hindus and I remember one missionary from India"],["2032","had sent one of the newsletters and they were talking about all these people that have believed in Jesus all these all"],["2037.12","these Hindus that believed in Jesus and uh as evidence they showed a picture of uh all these people at a dinner and And"],["2044","they all had their hands raised and they were explaining, you know, we we had this dinner and we invited people to believe in Jesus to raise their hands."],["2050","Well, that's something we do here in America, don't we? We raise our hands. Anybody want to believe in Jesus? Raise your hand and I'll pray for you. So,"],["2055.44","see, well, okay. Yeah. Thank you. Uh, but you know, we all do that, right? So, that's what they were practicing and uh"],["2061.2","and so they're like, \"Hey, praise God. Everybody, everybody had dinner and believe in Jesus.\" And um Chess looked"],["2067.919","at the picture and he says uh Indian folks are very are very polite. If you give them a nice"],["2075.119","meal and you ask them to believe in Jesus by raising their hands, they'll"],["2080.32","raise their hands because they want to be polite and they they want to you were kind to them. So they want to respond by"],["2087.52","doing something that'll make you feel good. And then he says, \"If you want to know"],["2092.639","who truly is a believer, see who takes the dot off their head.\""],["2098.16","When they take the dot off their head, that means they've moved away from Hinduism and now they are believing in"],["2104.56","Jesus. And that's what baptism did for the Jews. The message of Jesus is"],["2110.88","calling the nation of Israel away from the temple rituals. No longer sacrificing the lambs, but understanding"],["2117.599","that the once-forall death of Jesus, the shedding of his blood is the atonement for our sins. This bread is my body"],["2125.2","broken for you. This cup is the new covenant in my blood."],["2132","Baptized in the name of the Father, the Son, and the Holy Spirit. And baptism is"],["2137.68","our time to make that public declaration. I'm a follower of Jesus. I've been washed of my sins. He died for"],["2143.76","me. Washed. I've died to self. And I have"],["2150.079","been born again. Any man be in Christ, he is a new creation. Old things pass away. Behold,"],["2156.64","all things new become new. So what Peter prescribed back in Acts 2 is something that we are"],["2163.359","going to literally practice today. And if you haven't taken this step of faith and you're very concerned about it, you"],["2168.72","know, well, we got the tank right here. So, we can do that. But, you know, we'd nice to talk with you and interview you"],["2173.76","and then you could have a towel and be ready for the next time we do this. But you can pray and ask Jesus in your heart"],["2179.28","right here, right now, just simply praying, \"Whosoever calls on the name of the Lord. Dear Lord Jesus, please"],["2184.88","forgive me of my sins.\" Will the people in Acts accept Peter's"],["2190.16","literal interpretation of these events? Well, you'll have to come back next week"],["2195.44","and we got another whole sermon on Acts chapter 2. Lord Jesus, we thank you so much for this clear presentation, this"],["2202.16","this example of all these predictive prophecies that have come true uh in"],["2207.359","before their very eyes. And may we understand these things and may we know that these these covenants have been"],["2212.8","fulfilled through what you did on the cross for us and that you did not stay dead, but you rose again and you"],["2218.88","descended up into heaven fulfilling yet again more prophecies. And yet you're coming back again and you will fulfill"],["2224.56","yet again even more prophecies. May we in this moment, in this time"],["2229.92","just hold that one peace and that we will call on your name and be saved. Everyone here will call on your name and"],["2237.599","receive the salvation through faith in Jesus. Lord, help us. We pray in Jesus name. Amen."]]},{"id":"KqaS9MQrZ2w","name":"2025-11-02 Speaking In Tongues (Pastor Rob McNutt)","date":"2025-11-02","transcript":[["21.439","There are certain occasions when people give you gifts, graduations, wedding showers, baby"],["29.039","showers, but they're only going to happen once. Nobody is going to give you a gift every year to celebrate the fact"],["36.399","that you graduated 30 years ago. It's a onetime gift. But then there are other"],["41.68","times of the year that we receive gifts annually. The big two being"],["47.44","birthdays and Christmas. Every year you expect someone is going to give you something to celebrate your birth. Yay"],["55.28","me. Some people care enough that I was born that they want to give me gifts to"],["60.48","celebrate that. The nation of Israel had seven feast days that they annually"],["67.439","celebrated uh which God gave gifts to them. Three of those feast days were all in one"],["74.72","week. So just one big week of celebration starting with Passover, unleaven bread, and then first fruits."],["81.52","Passover, God spared the Israelites from death, the death angel back in Egypt by"],["87.04","sacrificing a spotless lamb and putting the blood on their doorpost. The angel of death saw the blood of the lamb and"],["93.28","passed over their homes. Second feast on that week is unleavened bread. The bread"],["99.04","Moses told the Israelites to prepare the night of the Passover. It was the last meal that the Israelites ate in"],["106.24","captivity. The feast of unleavened bread reminded the nation of the hasty Exodus"],["111.36","when God gave them deliverance from slavery in Egypt. After the 10th plague, the death of the firstborn of all of"],["117.52","Egypt, Pharaoh told Moses, \"Get your people and get out of here, unleaven"],["122.96","bread became synonymous with sinlessness, being sanctified by the blood of the lamb and ready to leave"],["130.72","Egypt.\" Now, here's the thing. Just like you get gifts on your birthday every"],["135.92","year, God decided on these special feast days to circle back and give yet more"],["142.239","gifts. So Jesus was crucified on Passover. The lamb of God sacrificed for"],["149.36","the sins of the whole world. Jesus' blood redeems us from death. So not only"],["155.44","did Israel get saved on Passover. Now all who believe in Jesus' death on the"],["160.959","cross as payment for their sins, everyone is offered salvation from death"],["166.4","because of the sacrifice of the lamb of God. Jesus sinless body was buried on"],["172.959","the feast of unleavened bread. But then Jesus rose again on the feast of first"],["178.8","fruits. The first harvest of the year was celebrated on the same week of Passover and unleaven bread. Jesus c the"],["186.72","Israelites celebrated their spring harvest and brought their tithe to the Lord thanking them for their provisions"],["193.68","that he had given them. That was the uh the first fruits. And Jesus rose again"],["199.92","on the feast of first fruits, became the first fruits, Paul said, of those who"],["205.04","inherit eternal life through faith in Jesus Christ. So, do you see how God gave more gifts to the world on those"],["213.28","annual feast days of Israel? Passover, unleven bread, and first fruits were all"],["218.56","feasts that Jesus was crucified, buried, and rose again. But there's one more spring"],["227.36","feast and something spiritually significant happens on that day as well."],["234.64","What feast am I referring to? Acts chapter 2, the feast of Pentecost. So"],["241.2","after Exodus, after e after exiting Egypt, the nation of Israel traveled 50"],["246.799","days to Mount Si where the Lord would give them yet again another big gift."],["252.4","What was the big gift they got at Si? ten commandments. The law was given and"],["259.04","a promise was given with that. So turn to Exodus chapter 19, Exodus chapter 19,"],["265.12","and it tells us uh after they gone out of the land of Egypt, uh they came to the wilderness of Si."],["272.72","Exodus 19:E 2, it says, \"And when they departed from"],["278.16","the Refodm, they came to the wilderness of Si camped in the wilderness. So Israel camped there before the mountain."],["285.68","Moses went up to God, and the Lord called to him from the mountain, saying, \"Thus you shall say to the house of"],["292.479","Jacob, and tell the children of Israel, you have seen what I did to the Egyptians, and how I bore you on eagle's"],["299.44","wings and brought you to myself. Now therefore, if you will indeed obey my"],["304.72","voice, keep my covenant, then you shall be a special treasure to me above all"],["311.039","people, for all the earth is mine, and you shall be to me a kingdom of priests"],["316.96","and of holy nation. These are the words which you shall speak to the children of Israel.\" So Moses came, and he called"],["323.759","the elders of the people, and laid before them all the words which the Lord commanded him. And all the people answered together and said, \"All that"],["330.4","the Lord has spoken, we will do.\" So Moses brought back the words of the"],["335.84","people to the Lord. So the gift that they're going to receive now at Mount"],["341.12","Si, of course, is the law of God. But also this promise, Exodus chapter 19:5,"],["348.56","if you obey my voice, keep my covenant, you'll be a special treasure to me above"],["354.24","all for all the earth is mine. So obey the law and be blessed. That is the gift"],["360.639","that they received at Pentecost. But there is more that Israel celebrated at the feast of Pentecost than just the"],["367.52","giving of the law. They also celebrated the wheat harvest. God's gift of bountiful harvest of food of of bread."],["376.16","After the wheat harvest, people had the flour they needed to make the bread that would sustain them for another year. And"],["381.6","they celebrated the giving of the law because they knew how to live a life in a manner that God would bless and the"],["388.319","wheat harvest. The bread was proof that God was pleased with them because he gave them a bountiful harvest. So the"],["394.16","gift of the wheat harvest was evidence to the people that God was blessing them. That's two gifts that Israel"],["400.96","celebrated on Pentecost. Now there's a third gift that's going to be given."],["406.56","Just like on your birthday, you get gifts every year. God's giving another gift on this special day."],["413.68","So when Jesus instructed his disciples, wait in Jerusalem for the promise of the father, it's very fitting that this"],["419.759","promise, this gift is going to come on the feast of Pentecost. What will the gift be? He said it's well it's earlier"],["426.96","we learned it's going to be the baptism of the Holy Spirit. And uh was there any way of knowing what that would mean or"],["432.56","what that would be like? Well, the prophet Joel had said back uh in the Old"],["438.24","Testament, \"It shall come to pass afterwards, I will pour out my spirit on"],["444.479","all flesh, on your sons and your daughters shall prophesy, your old men"],["449.52","shall dream dreams, and your young men shall see visions.\" And that is the"],["454.56","earliest clearest prophetic reference to a future outpouring of the Holy Spirit"],["460.56","to come down on people. Not just on prophets and kings, but on everyone."],["466.88","See, in the Old Testament, you remember that King David, King Solomon, even King"],["472.56","Saul, they prophesied. It's like, wow, the leaders, they are supposed to have the spirit of God on them. And we see"],["478.72","different individuals had the Holy Spirit on them. like Samson, he was supernaturally anointed and the spirit"],["484.56","of the Lord gave him supernatural power. And then there was these prophets that could perform signs and wonders like"],["491.12","Moses and Elijah and Elisha. But they those those individuals were all outliers. Most of the people of the"],["498.08","nation of Israel did not have a divine filling of the Holy Spirit. They had no gifts of the spirit. Only certain people"],["505.28","had the spirit of the Lord. But all of that is about to change here. Acts"],["510.56","chapter 2 verse number one. Hey, we starting a new chapter. Acts chapter 2"],["515.599","verse number one. When the day of Pentecost had fully come, so they're celebrating those feast. They were all"],["522.399","there in one accord in one place. Suddenly there came a sound from heaven,"],["527.519","a rushing mighty wind and it filled the whole house and where they were sitting. And there appeared to them divided"],["535.279","tongues as of fire that sat on each one of them. So when we were singing just a few minutes ago, come now spirit, uh,"],["543.68","fire and wind, come and do it again. That's what we were singing. That's what that whole song was talking about. It"],["550.16","wasn't just really poetic or cool. It was literally talking about this very time when this rushing mighty wind came"],["556.56","in and these tongues of fire landed on each one. And verse four, they were all filled with the Holy Spirit and began to"],["562.64","speak with other tongues as the spirit gave them utterance. And there were dwelling in Jerusalem Jews, devout men"],["568.959","from every nation under heaven. And then they heard the sound occurred. The multitude came together. They were"],["575.04","confused because everyone heard them speak in their own language. And they were all amazed and marveled, saying to"],["581.279","one another, \"Look, are not all of these who speak Galileans?\" And and how is it"],["587.12","that we hear each in our own language in which we were born? the Parthnians and"],["592.48","the Mes and the Elmalites and who dwell in Mesopotamia and Judea and Capidoshia"],["597.839","and Pontius and Asia in Fria and Panilia and Egypt, parts of Libya adjoining"],["606.08","Syria, Sirene, visitors from Rome and Arabs. We hear them speaking in our own"],["613.04","tongues the wonderful works of God. And they were amazed and perplexed, saying,"],["618.8","\"What could this mean? What could this mean? What is going on?\""],["625.36","One more detail about the feast of Pentecost before we we really explore this this passage. Pentecost is one of"],["632.64","the three feasts of Israel that the Israelites were supposed to travel to Jerusalem to celebrate in the city of"],["638.959","Jerusalem. Passover, Pentecost, and in the fall, the feast of tabernacles."],["644.72","three feasts that they were supposed to observe in Jerusalem. Now, since the first three feasts were all in the same"],["651.279","week, Passover, like the ones I told you earlier, Passover, unleven bread, and first fruits, since they're all in the"],["657.12","same week, people generally did all three of those together in Jerusalem, just like we saw in the Gospels with uh"],["663.2","the disciples and Jesus. So, they would be there for that and then they would go home and then 50 days days later, they'd"],["668.959","come back for Pentecost. And I was thinking about that and that kind of reminded me of how like we are about to have Thanksgiving and how the the the"],["675.839","college kids come home from Thanksgiving and uh then they go back to college and then you know 30 days later they come"],["682.48","home for Christmas and uh that's nice, right? So it's kind of that same idea. They leave and come back. Uh by the way,"],["689.2","when I was in Canada uh and I I moved down here to go to college, it was 16 hour drive and I I could never go home"],["695.839","for Thanksgiving. First of all, there wasn't any Thanksgiving in Canada, so I was like, \"What do you do at home?\" And"],["701.36","uh second of all, I for the the little turnaround, I couldn't make it. So, uh"],["707.36","instead of eating ramen noodles in my dorm room, sometimes people would invite me over for Thanksgiving dinner, and"],["712.88","that was nice. So, I want to just give a shout out to Jason and Amber for offering that ministry to people because"],["719.36","it is nice to have a good Thanksgiving meal and not ramen noodles in your dorm."],["725.92","So anyways, 50 days Pentecost um this is uh the time here in Acts is around 33 AD"],["735.04","and it estimates the scholars estimate there's about 50 to maybe 80,000 people"],["740.16","living in Jerusalem. Uh but on the feast days on those three feast days when people came the the the population would"],["747.04","swell to 100 to 200,000 people would be in the city. So the author of Acts tells"],["755.04","us the disciples, they didn't leave Jerusalem after the resurrection. Jesus was with them 40 days and then he left"],["762.24","and after 40 days and they were waiting in Jerusalem for 10 more days till the feast of Pentecost when a 100,000 people"],["770.56","have showed back up into Jerusalem and they're all there. And then this is when"],["776.88","this happens. Verse number one, they are there in one accord. And suddenly the"],["782.88","sound from heaven, rushing mighty wind filling the whole house in divided"],["788.639","tongues of fire sat upon each one. So the interesting thing about wind is"],["794.56","what? You can't see it, but you can feel it."],["799.839","Yeah, you can smell it. You can hear it and you see the effects of it. What it"],["805.6","moves. You can see that but you can't see the wind. So wind is an excellent analogy to"],["812.24","help us understand spirit. Someone who you can hear, feel,"],["819.44","see the effects of who he's moving, but you don't see him. Jesus compares spirit"],["825.76","to the movement of wind in John 3:8. He says, \"The wind blows wherever pleases."],["831.36","Hear the sound of it. Cannot tell where it's coming or where it's going. So is it with everyone born of the spirit. So"],["837.36","he makes the same connection in the Old Testament. Spirit of the Lord is"],["842.399","interchangeable with the Hebrew word ruach which is the breath. The breath of"],["848.32","God. Job chapter 33. Job says both at the same time. The spirit of God has"],["853.76","made me. The breath of the almighty gives me life. And the psalmist right"],["859.04","likewise says by the word of the Lord the heavens were made. by the breath of his mouth all their hosts. And then even"],["867.279","Jesus when he uh resurrected and he met with his disciples in John 20, he breathed on them and said, you know,"],["875.279","receive the Holy Spirit. It's the breath of God. These verses"],["880.48","tell us that wind and breath is not just poetic imagery in the Old Testament, but"],["885.68","it's expressing describing the Holy Spirit, his power and his presence. But"],["890.88","we need to remember that spirit, the spirit spoken of here is qualified by a"],["896.88","title. How is he described? What's his title?"],["902.24","Holy Spirits. And that's important to remember because there are other spirits"],["908.24","spoken of in the scripture, ones that are not holy. All throughout the gospels, Jesus is driving out the"],["914.88","impure, the unclean spirits out of people. 1 John chapter uh 4, John tells"],["921.68","us, \"Beloved, do not believe every spirit, but test the spirits. See if"],["928.48","they're from God because there's false prophets that have gone out into the world.\" Test the spirits."],["934.24","Meaning do not do the messages do the actions of those prophets of those"],["939.839","messengers align with God's word God's revelations God's descriptions of what"],["945.519","Holy Spirit does. We are in a time when all kinds of"],["951.92","spirits are working. We feel them. We hear their messages. We see the fruits"],["957.519","of their labor. Deceiving spirits, lying spirits. I recognize them because of"],["962.56","what they produce in people. I see how they're impacting society, sowing spirits of fear and hatred, fostering"],["971.68","immorality and depravity in our people, justifying stealing and violence,"],["978.399","outbursts of wrath, selfish ambitions, dissensions and heresies."],["984.079","These are not the works of the Holy Spirit. These are the works of evil spirits. Yes."],["990.56","Listen to me for a minute. Let me explain what these evil spirits are"],["995.759","attempting to do. I told you the other week it's to"],["1001.36","divide and divide and conquer. Fear and hatred leads to stealing, killing, and"],["1007.519","destroying. And we're about to see a season of looting, violence, and death."],["1013.519","It's what the evil spirits are going to produce in our society for the purpose of creating division and destruction. We"],["1021.519","learned about the power of being in one accord. We learned about the strength of unity."],["1028.079","Well, our country is now weak because it is so divided. Like Rome, the Roman"],["1033.839","Empire who wasn't conquered by outside forces. They were destroyed from within."],["1039.28","The spirit of greed is infecting us from the top down to the bottom up."],["1046.959","I take a moment to point out these things because they are the evidences of"],["1052.799","the spirit world that we're speaking of. And sometimes people read the Bible and they go, \"Ah, the spirits that's just"],["1059.679","make believe. You know, you can't see spirits. They don't really exist.\" But spirits are like wind. You feel them."],["1066.64","You see how they're affecting people, how they're affecting culture, and I'm"],["1072.4","pointing out these obvious effects of these different spirits and they're having on our land before our very eyes."],["1079.76","Do you see them? See, I'm old, right? Me and Jimmy, we're"],["1085.36","old. And I remember a time I was telling my my daughter-in-law, I remember a time"],["1091.84","when businesses were closed on Sundays. like you couldn't you couldn't get a bag"],["1097.039","of chips, you couldn't get a tank of gas. Nothing was open on Sundays. Culturally, most people were either"],["1104.24","attending church or if they weren't attending church, they were spending time with their families. And nobody was"],["1110.32","working and nobody was expected to work. The day of rest as prescribed in the Ten"],["1116.16","Commandments was very much something that the culture observed. Even if they"],["1121.36","didn't know the ten commandments, everyone was doing that. Culturally, people were were united."],["1127.84","We were united. There was prayers in schools. There was standing for the"],["1133.039","national anthem. There was pledge allegiance to the flag. There was thanking God for liberty. Celebrating"],["1139.679","Christmas as the birth of Jesus. Easter as a time to remember the death and the"],["1146.4","resurrection of Jesus. Whether you were black or white or Spanish or French or Italian or Irish or German or Greek, it"],["1152.96","didn't matter. They were all united by Christianity, by Judeo-Christian values."],["1158.799","Thou shalt not lie. Thou shalt not kill. Thou shalt not steal. Love the Lord your"],["1165.44","God. Love your neighbor. These beliefs joined us together in unity in love."],["1170.88","Love for God. Love for one another. Faithfulness to God. Faithfulness to our spouses. one accord."],["1179.44","That was the impact of the Holy Spirit. The believers of Jesus are instructed to"],["1185.28","be filled with the Holy Spirit. And we're going to talk about that in a minute. But when the spirit came at Pentecost, what first happened? There"],["1192.16","was a sound, a wind that filled the room. And then there was"],["1198.96","what else? Fire. Tongues of fire. Now, that's very"],["1204.48","interesting. Here it says that the the wind filled the room and then there appeared on them divided tongues of fire"],["1210.4","that sat on each one of them. This description here is never spoken of again in scripture. Even though in other"],["1217.919","passages people speak in tongues, the wind and the fire is not duplicated in"],["1224.4","those passages. It should not surprise us that on Sunday"],["1229.76","morning that even though we were singing about fire and wind come and do it again, we didn't hear a big rush of wind"],["1235.44","and we didn't see fire landing, you know, here on Kevin and then jumping over here to Faith when she was singing,"],["1240.799","right? We didn't see the fire bouncing around. Yet,"],["1246.159","Christians are instructed to be filled with the Holy Spirit. That was a one-time event that the Holy"],["1253.039","Spirit showed up with fire and wind. So you could be filled with the spirit but not see fire landing on people or wind"],["1260.64","blowing because that was describing the first time the Holy Spirit came. Now"],["1265.84","just like the wind reveals an aspect of the Holy Spirit, so does the fire. What does fire what where do you see it at in"],["1273.2","scripture in the Old Testament? You think of Moses when he first meets God, it's a it's a burning bush, right? And"],["1280","then we see in Malachi where uh the prophet talks about purification. He"],["1285.6","says, \"But who can endure the day of his coming? Who can stand? He appears for he"],["1290.88","is like a refiner's fire that burns away that that test everything.\" Uh the"],["1297.84","author of Hebrews says, \"Our God is a consuming fire.\" So fire is also a"],["1302.88","common reference in scripture that has to deal with this judgment and purification. But this here uh is new"],["1311.76","that is never spoken of in the Old Testament. Not just fire, but what comes with the fire?"],["1319.2","Tongues. Speech and communication. A supernatural ability to speak another language. This"],["1326.48","is a special moving of the Holy Spirit. And the gift of tongues reverses the confusion of languages that took place"],["1334.559","at the Tower of Babel. This is undoing the curse of the"],["1340","judgment of Babel. God confused the languages so that the post flood population would cease from their"],["1346.4","disobedience and go spread throughout all the earth. Now here in Acts, he is un the Holy Spirit is undoing that"],["1353.2","judgment as a sign to show people particularly the Jews who know the book"],["1359.84","of Genesis. They know the story of the Tower of Babel. They know that not being able to understand another person's"],["1365.919","language was it indeed a judgment from God. But now they can hear someone who doesn't know their language and they're"],["1371.76","speaking it. And what is the message that they are hearing? They're hearing about the gospel."],["1378.4","They're hearing about the testimony of Jesus. They were it says in verse number 11 here they hear speaking in their own"],["1385.919","tongues the wonderful works of God. The s this this the wonderful works of"],["1391.919","God. So people get excited about the gift of tongues, get excited about the miracles, and that's cool. But don't"],["1397.84","miss the point. The sign was so that the people would hear this allimportant"],["1404.48","message. And this gift of the Holy Spirit launches the global missions of"],["1412.159","the church. So when you read down through that, and I could do it again, but I just butchered all the names of"],["1418.48","the countries. But from verse number nine all the way down to 11, it tells you all these different places where"],["1425.12","people, it says from all over the world. Why? Why were they from all over the world? Because they were Jews that lived all over the world and they came to"],["1431.919","Jerusalem for Pentecost. And while they're there, 100,000 people from all"],["1438.32","over, they were born in these countries. And then they hear the disciples"],["1444.48","speaking in their language. So somebody made this really nice map. I didn't do this. I'm just, you know, ripping somebody off. And uh when you when it"],["1451.679","shows you where these countries are, look at which direction they're going in. Isn't that interesting?"],["1457.679","What do you observe? These people are coming from where"],["1465.039","all directions. So it's like the compass where they're going out from here in"],["1471.12","every direction. people will take this message, take this story back to their"],["1476.32","homeland with their own languages and they're going to tell of this great miracle they saw. I thought that was"],["1483.12","very interesting. Verse number six and um so verse 5 it says they were uh dwelling in"],["1489.76","Jerusalem, the Jews, devout men from every nation under the earth under heaven."],["1495.12","And when they this sound occurred, the sound of the the mighty wind, the multitude came together. They were"],["1501.679","confused because they heard them speak in their own language."],["1508.24","Remember what we said at the feast of Pentecost. There was like 100,000 people in Jerusalem and all these people,"],["1514.559","they're, you know, they're hearing this commotion because this is this big sound of this wind and now all of a sudden all"],["1520.4","these people are breaking out and it's kind of grabs their attention like, wow, what's going on? And uh they go to check"],["1525.919","it out and they see these these Galileans. Uh at this point everyone knows who"],["1531.919","these guys are. How how does everybody know who these Galileans are? Cuz you know the first feast that they"],["1537.52","came was the feast of Passover when they came into town and that's when Jesus"],["1543.039","came riding in on a on a donkey and everyone was claiming him to be the Messiah. and these guys were coming"],["1550.72","along with Jesus and they recognized, oh, that's the guys that were with Jesus. And uh that happened the last"],["1556.48","time they were in town. But then they also remember that um when they were in"],["1561.52","town that the uh Sanhedrin condemned Jesus to death and then uh everyone saw"],["1567.36","Jesus crucified. Rome crucified him and that happened at the second feast. And"],["1572.88","then probably most of these people heard the rumor that uh the grave was empty."],["1580.88","They probably heard that story. You know what happened to that Jesus guy? They crucified him and then the news spread that he rose again. But they also heard"],["1588.72","another story too because there was two stories. What were the two stories going around? The story from the temple from the"],["1594.72","religious leaders is uh his uh disciples came in the middle of the night and stole his body and"],["1600.64","that's why there was an empty tomb because there was an empty tomb. There was like physically nobody in the tomb. So they stole his body and uh but the"],["1608.08","disciples had another story and they were telling everybody he rose again and"],["1613.12","there was 500 witnesses that were saying I saw Jesus he rose again. So the crowd"],["1618.559","has heard both stories. Now, which one are they going to believe? That's very confusing, right? Because just like us,"],["1624.72","something happens up in DC uh or someplace else in the country and we weren't there or we don't know anybody"],["1630","who was there who was involved, but then some news outlets report it one way and other newslet outlets report it another"],["1636.48","way and then we go, \"Oh, which story is true?\" And some people decide which side"],["1642.08","they're going to believe, but many people, they're just not sure. Now, verse five tells us that these are devote men from every nation. So they're"],["1649.52","not people that are caught up in the politics of Jerusalem with the Sanhedrin or the Pharisees or the issues with"],["1655.52","Rome. They these these people have no personal agendas. They're simply people trying their best to be devoted to God"],["1662.24","and abide by the laws of Moses which is why they're in Jerusalem to celebrate the feast of Passover. Just there trying"],["1668.64","to figure out life and obey God as best they can. And then they hear this commotion and then they observe these"],["1674.24","followers of Jesus claiming these people who claim Jesus rose from the dead and they're speaking in their own tongues."],["1681.6","They're speaking in a language that they recognize from their childhood. And we"],["1686.799","ought not miss that detail. Speaking in tongues as as described here in Acts is"],["1692","someone who automatically is speaking a recognizable language that they did not"],["1697.679","know. So it wouldn't be like Illana jumping up speaking in Spanish, not speaking in tongues because she already"],["1702.96","knows Spanish, right? If she jumps up and speaks in Swahili, that would be a different thing. So it's just like all"],["1708.159","of a sudden you can speak a language that you did not know, but somebody else says, \"Oh, that's my language. I"],["1713.76","recognize that.\" And the purpose of it was for these devout men. The purpose of"],["1719.279","of hearing the tongues was for these devout men to hear about the wonderful works of God in their own language. It"],["1726.72","was a sign. It was a miracle to validate the disciples of Jesus message."],["1734.88","It was to prove that God was with the disciples and their story, not with the"],["1742.08","religious leaders of the nation of Israel and their story. And this is important for what's going to happen"],["1748.799","next in the church history, but it's also important for us here today because people still wonder, how do we know who"],["1756.24","has the true message of God? That's an important question to ask and"],["1761.52","maybe people in here ask it. How do we know the Bible is true? How do we know"],["1767.44","the message of Jesus is really from God versus all the other religions and their"],["1773.76","claims that they have messages from God? How do we know? And the answer is"],["1781.76","who has the Holy Spirit of God? Who does God pour out his spirit upon? The"],["1789.12","believer in Jesus is instructed to be filled with the Holy Spirit. Well, what does that look like? Well, we already"],["1795.6","said it's not wind. It's not seeing flames of fire jumping around."],["1801.039","So, what is being filled with the Holy Spirit look like? How do you know you have the Holy"],["1807.36","Spirit, which validates that our message is from God? To be filled with the Holy Spirit means to be"],["1813.679","empowered, guided, and transformed by God's presence living within you. So let"],["1819.919","me give you some of the evidences listed in scripture of how someone is described"],["1825.76","who's filled with the Holy Spirit. So the first description, the first evidence of being filled with the spirit"],["1830.88","is found in the book of Acts, which makes sense because that's when the spirit first came. In Acts 4:31, it says"],["1836.88","about the disciples, they were filled with the Holy Spirit. And what did they do? They spoke the word of God boldly,"],["1844.96","being filled with courage and clarity in proclaiming the truth."],["1852","This is often frowned upon in our culture. When you speak the truth,"],["1857.76","you'll be accused of sounding judgmental and so non-inclusive."],["1863.52","And they'll label you names. And I will tell you why. When the evil spirits are sowing lies"],["1870.48","and deception, they don't want to compete with truth spoken boldly and clearly because lies"],["1878.24","can't compete with truth. Instead of winning the debate with facts, what the evil will do is they'll attack the"],["1885.6","person speaking. It's called an ad homin attack, which is Latin, which means"],["1892.399","against the man. Against the man, against the person. When evil can't win the debate based on facts, it attacks"],["1899.2","the persons who's speaking the truth attacks his character. This is what the Pharisees tried to do with Jesus. Remember, accused him of breaking the"],["1905.6","law, accused him of performing miracles by the power of demons, by being in league with Satan. So when we speak the"],["1912.72","truth, we will be attacked. But it ought not to shut us up because Jesus told us"],["1919.6","this is going to happen. Matthew chapter 5, he says, \"Blessed are you when you're reviled and persecuted. They say all"],["1925.2","kinds of evil against you falsely for my sake. Rejoice. Be exceedingly glad."],["1930.24","Great is your reward in heaven. For so they persecuted the prophets who were before you.\" When we speak the truth,"],["1937.679","the Holy Spirit will give us boldness, will give us clarity to do so. That's"],["1943.679","how we know we're filled. Second way, evidence of being filled with the spirit. Acts 13:52,"],["1950.08","the disciples were filled with joy and with the spirit. Isn't that neat? Filled with joy and with the spirit. A"],["1956.559","spiritfilled life is marked with joy. Even in hardship,"],["1962.799","especially in hardship. James said, \"My brethren, count it all.\""],["1968.32","Joy when you fall under intense trials. When"],["1974.48","you're filled with the spirit, you strive to see the higher purpose in everything. Your life is not about"],["1980.559","getting everything you want all the time. It's not about things being perfect and and everything being"],["1986.24","pleasurable. We know there are hardships, trials, and tribulations. But even in the midst of that, if you are"],["1992.48","spiritfilled, you're not in despair. Romans 15, Paul says, \"May the God of"],["1998.48","hope fill you with all joy and peace by the power of the Holy Spirit.\""],["2006.88","The Holy Spirit fills us with hope and peace and purpose. And that's also the"],["2012.24","third evidence of being filled with the spirit. This is a good one, isn't it? Paul says, \"Don't be drunk with wine,"],["2019.44","for that's it leads to debauchery. Be filled with the spirit.\" So, a command"],["2024.559","to live under the spirit's influence and not under for fleeting pleasures. Paul"],["2030.64","clearly contrasts the difference between those who are carnal versus those who are spiritfilled. And he gives us an"],["2036.64","elaborate list. Turn to Galatians chapter 5. And I didn't make a slide because it's too long and uh I got lazy."],["2044.32","But also, many of you know this anyways, but turn to Galatians chapter 5 so you know I'm not making it up. Verse 19,"],["2052.32","Paul writes, Galatians 5:19, \"The works of the flesh are evident. They are adultery, fornication, uncleanliness,"],["2060","lwdness, idolatry, sorcery, hatred, contentions, jealousy, outburst of"],["2066.079","wrath, selfish ambitions, dissensions, heresies, envy, murder, drunkenness,"],["2071.839","rivalries, and the like, of which I told you beforehand, just as I also told you in times past, that those who practice"],["2077.119","such things do not inherit the kingdom of God. But the fruit of the spirit is"],["2084","love, joy, peace, longsuffering, another word for patience, suffering long,"],["2092.72","kindness, goodness, faithfulness, gentleness, self-control. Against such there is no law, and those who are"],["2100.079","Christ are crucified have crucified the flesh with its passions and desires. So"],["2105.119","all these things that are dealing with the the the passions of this world uh"],["2111.04","you are going to sacrifice that and live by the spirit. If you live in the spirit"],["2116.24","let's walk in the spirit. So going back to our question how do we know who has the true message of God?"],["2124.72","How do we know this Bible is true? How do we know the message of Jesus is really from God versus all the other"],["2130.88","religions who claim their message is from God? And the answer is, but who did the Holy Spirit come upon?"],["2138.16","The believer in Jesus is instructed to be filled with the Holy Spirit. And what does that look like? Love, joy, peace,"],["2146.32","patience, kindness, goodness, faithfulness, gentleness, self-control."],["2152.72","In the midst of a fractured, fragmented culture that is at war, that is tearing"],["2160.16","itself apart, those filled with the Holy Spirit are those who respond to the hatred and the fear with kindness and"],["2167.76","goodness, peace in the midst of the storm."],["2173.52","We are to boldly speak the truth, but we are to do it in a spirit of"],["2180.88","love. You know that one, don't you? Jesus says, \"By this they will know"],["2186","you're my disciples if you have love, especially for one another.\" Like brothers and sisters in Christ. You know"],["2192.32","how many churches, how many families get tore apart? We're just supposed to love each other. And this is how we prove who"],["2199.839","has the true word of God. First, it's the joy in the midst of"],["2205.44","hardships, boldness to speak the truth, but you're speaking it with the spirit of love. And this is the gift God is"],["2214.64","giving to his people so that they can be witnesses of Jesus to a lost and dying world. We will suffer hardships for"],["2222.4","following Jesus. We will need boldness to speak the truth and we will need the"],["2228.56","love of God for our brothers and sisters in Christ who we're supposed to be inite unit be a unit with. And we'll also need"],["2235.68","that love for a messy broken world. We're going to need the love for that."],["2241.359","The Holy Spirit was the gift that the father had given to the followers of Jesus at Pentecost. The Holy Spirit is"],["2248","not a one-time gift. He is uh with us, renewing us, transforming us every day."],["2256.64","How about that? You get your birthday, you get a gift once a year, you get the Holy Spirit, every day. And do you need him daily?"],["2264.32","I sure do. Do you have him? you do if you're trusting in Jesus. But"],["2271.359","you can choose not to listen to him. That's another whole point. I could preach all day about the Holy Spirit."],["2276.64","But let me just finish with this one whole point. First Thessalonians chapter 5. This is a great passage because it's just bullet form. You know those people"],["2283.04","like to get to it and stop with the stories and the illustrations. Pastor, just give me the facts. Here it is. Rejoice evermore. Pray without ceasing."],["2289.52","In everything give thanks. This is the will of God. Don't quench the spirit. Don't despise prophecies. Test these"],["2294.88","things. Hold fast to what is good and abstain from what is evil. there bullet form. Write it down. Do those things."],["2300.96","You can quench the Holy Spirit by doing the opposite of what is prescribed here. If you are not rejoicing, not praying,"],["2307.839","not giving thanks, not holding fast the truth, not abstaining from evil, you will quench the Holy Spirit's work in"],["2313.52","your life. Sometimes when people are in a relationship and they break up, they get"],["2320.4","so hurt, they want to return all the gifts to the person, right? You know, you said you love me when you gave me"],["2325.839","these gifts. I don't I don't want this anymore. Here, take this. I don't want your love and I don't want this relationship and I don't want these"],["2331.04","gifts. God has given you some gifts. Salvation is a gift. The Holy Spirit is"],["2337.839","a gift. Do you accept these gifts or do you want to give them back?"],["2344.48","Let's pray. Holy Spirit, we need you to fill us. We prayed, we sang, we've"],["2349.839","looked at your word, but we need you to fill us in order to be the followers that you've called us to be so that we"],["2356.24","can show a broken world your gifts of salvation and eternal life. So we pray"],["2362.96","that you will fill us and that you will use us. And we pray this in Jesus name."],["2368.64","Amen."]]},{"id":"05fkwNYsSeI","name":"2025-11-16  Is the Early Church Practicing Communism? (Pastor Rob McNutt)","date":"2025-11-16","transcript":[["10","invite"],["21.68","you to take your copy of the word of God. Turn to Acts chapter 2. Acts chapter 2. We want to uh just read a"],["31.76","couple of verses to set the stage for what we're going to look at today. Um, of course we know uh the what has"],["39.84","happened so far in the book of Acts. You've been following along with us uh here or online. And I want to say hello"],["45.12","to all the online people. We have people watching us. We now have our interactive ministry going on where we're"],["50.399","interacting with people online and Pastor Mark has set up a team and now they're talking back and forth and"],["55.92","answering prayers for people. So, uh it is just a growing ministry and so we want to thank all the folks uh who are"],["63.12","joining us online. But uh as you know we have uh been seeing the uh Pentecost,"],["69.28","the moving of the Holy Spirit, filling the disciples uh speaking in tongues and"],["74.4","then everyone coming out to see what was going on. And then uh Peter preached this great sermon and that's where we"],["81.68","are now in verse 37 of chapter 2. Uh after they Peter preached the big sermon, uh when they heard this, they"],["89.52","were cut to the heart and said to Peter and the rest of the apostles, \"Men and brethren, what shall we do?\" Peter said,"],["96.24","\"Repent every one of you. Be baptized in the name of Jesus Christ.\" And we yet again have another baptism that we're"],["102.88","going to have later on today. Uh we're going to see folks take that step of faith and uh share uh what God is doing"],["109.2","in their life. Uh be baptized in the name of Jesus Christ for the remission of your sin. and you'll receive the Holy"],["115.52","Spirit. For the promise is to you and your children and to all who are far off, as many as the Lord our God will"],["122.32","call. That was last week. And with many other words he testified and exhorted"],["128.08","them, saying, \"Be saved from this perverse generation.\" Be saved from this"],["134.319","perverse generation. Often when we use the word English word perverse, it has a sexual deviant connotation. You pervert."],["143.04","Uh while that was without a doubt plenty of that going on in Peter's day, I don't think that was the specific issue he has"],["150.16","in mind uh here in Acts chapter 2. The Greek word escolios uh crooked. It's"],["156.8","where we get our English name for the medical condition. Scoliosis, crooked back, curved spine. Crooked. Sometimes"],["164.879","we use that term to mean what? A dishonest person, a thief. He's a"],["170.48","crook. But again, too narrow of a definition for this Greek word scolios."],["176.239","I think John the Baptist's message to the nation clarifies how people in"],["181.84","Jesus' day used the term scolios. As uh Paul uh John said uh this is the"],["188.64","testimony of John when the Jews sent priests and Levites from Jerusalem and asked him who are you and he said I am"],["198","the voice of the one crying in the wilderness make straight the way of the"],["203.92","Lord. John the Baptist quoting the prophet Isaiah make straight the opposite of crooked. make straight his"],["212.159","path is a metaphor for spiritual preparation, removing obstacles,"],["218","repenting, aligning hearts to receive the Messiah. In ancient times, roads"],["223.2","were leveled and cleared for the arrival of the King. And John is calling that to be done inwardly before the coming of"],["230.08","Jesus. It's a call to repentance, humility, and readiness. Prepare ye the"],["236.08","way of the Lord. Make straight his path. It's a timeless invitation to clear out"],["242.239","the clutter of pride, distractions, and sin. The crooked, perverse"],["249.12","generation. Is it is it sexual perversion? Yeah. It is it dishonesty"],["254.959","and theft? Yes, it is any and all deviations,"],["260.32","any or all sinful behaviors. Peter says, \"Escape from this crooked, perverse"],["267.44","gana.\" Generation is our English word. A whole multitude of people living at the"],["273.52","same time an age or maybe we say popular culture."],["279.04","What Peter is saying is society is on the wrong path. His exhortation is"],["286.08","a warning to the people to be saved from that path. Get off the wrong path. And"],["291.759","that I think is a very relevant message. A poll at the end of October was taken and 67% of those pled said the United"],["299.6","States is on the wrong track. And that's uh slightly an improvement from the poll"],["306.32","that was taken in November 2024 where 75% said the country is on the wrong"],["312.32","track. So, you know, we had a switch in administration between last November and uh October this year. So regardless of"],["319.68","what party's in power, it seems that Americans all agree on one thing. The country's"],["326.16","on the wrong track. It's on a crooked path. Everyone can point out something"],["331.44","that they think is wrong. And I can look at both sides, both parties, and agree"],["337.36","no matter who's in power, there are things happening that are wrong."],["343.759","So what is the right track? What's the right path? Well, guess what? Acts"],["349.199","chapter 2 is going to show us what is the straight path. Now, I guarantee"],["355.199","there are millions of Americans who will listen to the sermon. No, they won't. There won't be millions listen, but if"],["361.12","they did, they would, unless Mark does a great job over there with We'll see if"],["367.44","millions of people, if they heard the sermon, would vehemently disagree with me. But I think Peter and the disciples"],["374.96","had the church on the right path. So if you're curious to at least take a look at the path, let's go to verse 40."],["382.72","Chapter 2, verse 40. And with many other words, he testified and exhorted them,"],["388.08","saying, \"Be saved from this perverse generation. Then those who gladly"],["393.36","received the word were baptized. And that day about 3,000 souls were added to them.\" So instant megaurch. They"],["401.039","continued steadfastly in the apostles doctrine and fellowship in breaking of bread and in prayers. Then fear came"],["408.16","upon every soul. Many many signs and wonders were done through the apostles. Now all who believed were together and"],["415.84","had all things in common. They sold their possessions and goods and divided them among all as anyone had need. So"],["423.199","continuing daily in one accord in the temple, breaking bread from house to house, they ate their food with gladness"],["429.759","and simplicity of heart, praising God, having favor with all people. And the Lord added to the church daily those who"],["437.759","were being saved. Wow."],["442.88","Did you catch that? Is that is that socialism?"],["448","I is that communism? Is is that what Bernie Sanders AOC and Mandi is saying"],["454.4","is the right direction for society? Tax the rich and redistribute the wealth. Verse 45. Did you catch that? All"],["461.44","believed they sold their possessions, their goods, and divided them to all. Has anyone had need? Oo, is that making"],["470.16","all the conservative capitalist nervous? Well, before we pull out Das Capal and"],["477.36","convert to Marxism, let's make sure that we interpret the church's actions in the proper historical context, we don't want"],["484.319","to be guilty of isogesis. Isogesis is the process of reading one's own ideas,"],["490.08","biases, or assumptions into the text rather than drawing meaning out of the text itself. It's the opposite of"],["496","exugesus, which seeks to understand the original intent and context of the author. We don't want to read"],["502.4","current-day economic theory into this historical setting. The path is not"],["508","straight by the implementation of the social gospel. The path is made straight"],["514.32","by people being born again. Again, verse 38, repent and every one of you be"],["521.36","baptized in the name of Jesus for the remission of your sins, confessing faith in Jesus Christ and committing"],["527.36","themselves to follow in his way. After all, Jesus said, \"I am the way, the"],["534.959","truth, and the life, and no one comes to the father but by me.\" The actions the peoples take here in chapter 2:45."],["543.36","Their reasons for redistributing their wealth cannot be divorced from the theological foundations."],["550.48","This is not tax the rich and give it to the poor. This is repent and follow"],["555.6","after the way of Jesus. The way of Jesus starts with you humbling and admitting"],["561.2","that you are wrong. You are a sinner. Apart from Jesus, you don't know the"],["566.399","right way. And that's why I will never be a politician. And that's why I'm never going to be president because you"],["572.48","don't get elected by telling your constituents, your donors, your base, your you people are wrong. Your"],["578.56","lifestyle is wrong. Your beliefs are wrong. The culture's wrong. Repent and be saved from this perverse generation."],["585.519","Doesn't sell. But that is the message. That's the first step to getting on the"],["590.72","right path. Admitting unless you're following Jesus, you're on the wrong path. And that is the theological"],["596.8","foundation for everything else that is going to happen in this chapter. So they start with that. Next, verse number 41."],["602.56","Those gladly received the word were baptized. And that's what they did. They received"],["608.88","the word. They were baptized into the faith. And we talked all about that last week, what that meant for the Jews. and"],["614.079","they continued steadfastly in the apostles doctrine, fellowship, breaking bread, and prayers. This is the verse"],["622.24","that I shared with the elders back in 2007 when I was interviewing for the"],["628","pastoral position here at Faith Bible Church. And I submitted to them back then that this was what I was going to"],["634.399","focus on when it came to ministries and programs. Everything we endeavor to do"],["640.56","at Faith Bible Church ought to fit into one of these four categories. Because as"],["646.32","I been saying for the last 18 years, these are the four things you have to have to have church. We can have all"],["652.32","kinds of visions and strategies, programs, and facilities, but if you don't have these four things happening, you're not really doing church. I says"],["659.68","to the elders, just like a plant needs four things to live, it needs"],["665.44","sunlight, water, soil, and CO2, right? Carbon dioxide. If it gets"],["672.56","that, it will grow. It will reproduce because that's what God created it to do. And sames true for the church"],["678.8","because that's what God created it to do. When it has these four things, it grows. It reproduces."],["686.16","These four things are the basics of what we have to have. Doctrine,"],["692.16","prayer, break bread and fellowship. So first of all, you have to have doctrine."],["699.36","Adherence to the apostles doctrine. What is the apostles doctrine? Basically, it"],["704.72","is the Bible. It is the teaching of the word of God maintaining the authority of"],["711.04","scripture. The scripture comes from God and adherence to it to its precepts is"],["717.279","obedience to God himself. How do I know this? Well, first of all, the testimony of Jesus where he prayed, sanctify them"],["725.12","with truth, your word is truth. Jesus said in"],["730.639","Matthew 5:18, \"Surely I say to you, till heaven and earth pass away, not one yard, what one tit will by no means pass"],["738.56","from the law till it is fulfilled.\" And we know that the the yode, the yacht is"],["743.76","the smallest Hebrew letter in the Hebrew alphabet. And the title is the smallest"],["748.8","portion on a letter. It's like the dot on the eye, so to speak. The very smallest portion. The scriptures will"],["756.079","not none of it will pass away is to Jesus emphasized there. The scriptures"],["761.12","are to be um fulfilled. The scriptures are forever according to the prophets of"],["768.079","the Old Testament. Isaiah says, \"The grass withers, the flower fades. The word of God stands forever.\" The"],["774.639","psalmist David says, \"Forever, O Lord, your word is settled in heaven.\" And so"],["780.639","the apostles doctrine in their own words, it says in first of all with"],["786","Peter, second Peter, know this. No prophecy of scripture is of any private interpretation. Prophecy never came by"],["792.48","the will of man, but by but holy men of God spoke as they were moved by the Holy"],["798.88","Spirit. The inspiration of the Holy Spirit. And of course, we can't get away without putting this verse in there. All"],["804.079","scripture is given by inspiration of God and is profitable for what? Verse one?"],["810.72","doctrine, the teachings of the church, reproof, correction, instruction in"],["816.399","righteousness, that the man, the woman of God may be complete, thoroughly furnished unto all good works. This is"],["822","why we are a Bible church. Our name communicates what the emphasis is going"],["828.16","to be. If you go to Dunkin Donuts, you're expecting to get some"],["834.079","donuts, right? If you go to Pizza Hut, you're expecting to get some pizza. It's in the name. If you go to Taco Bell,"],["840","you're expecting to get some diarrhea. What? No. Expecting to get tacos. Tacos."],["846.959","The apostles doctrine is the truth found in the word of God."],["853.199","The word of God claims to be the inspired, infallible, authoritative."],["859.36","Therefore, if someone is teaching something that contradicts what the word of God plainly says,"],["865.6","they're taking you down the wrong path. So once someone repents of their sin,"],["871.6","trusts in Jesus, commits themselves to the apostles doctrine, we're not going"],["877.6","to find ourselves having violent disagreements about what's the right path."],["884.16","Their path is not crooked. Their path is made straight when the word of God is the lamp unto our feet and the light"],["891.68","unto our path. Apostles doctrine. Second, prayers. We"],["898.8","have countless instructions. Ask and it will be given to you. Praying always with every prayer and supplication."],["905.6","James 5:16, confess your sins to each other. Pray that you may be healed. The"],["911.36","prayer of the righteous person is powerful and effective. And for those"],["916.399","who are new, Faith Bible Church, maybe you're here for the first time, uh you might have uh thought that was kind of"],["923.12","uh unconventional and a little weird that point in the service where we uh just said, \"Hey, tell us about your"],["929.68","week.\" Uh what are the praises and prayer requests and the mics were passed out and it became very interactive"],["935.76","there? And then some people started preaching and some people started pro, you know, and it was great, right? But uh it's our way to an intentionally"],["942.24","abide by these instructions to pray for one another. And we think we ought to be very specific and like David was saying,"],["948.8","not vague in our prayers, but very precise. We believe God hears our prayers. He promises to answer if we"],["955.199","ask. So let's specifically ask and agree with one another. And if God has"],["961.04","answered our prayers, then we want to publicly give him thanks and hear the testimonies of what and how God answered"],["968.48","that prayer request. It strengthens our faith to learn these things. We'll see later on in the book of Acts that the"],["974.72","church got together and prayed specifically for things and God answered them. And we've seen him do the same thing for us. Now, it takes a bit of"],["981.839","time and sometimes, you know, people get a little wordy and I'm always have to be prepared in a polite way to kind of"],["988.24","remind people to wrap it up. And I know you all read my body language when I'm kind of, you know, moving to get"],["993.839","somebody off the stage, especially like announcements, right? When you know, somebody's kind of going on and on and I kind of stand up and I go stand beside"],["1000.079","them and you know, Jennifer Foxworthy, she's real good at it. She picks up on her rightway. Oh, here comes pastor. Got"],["1005.36","to go. Yeah. I had to fight it out with with Jen Meeks one day. I mean, we were"],["1010.399","we were going to go on that, but for the most part, everyone kind of reads the body language and uh you know, it we we"],["1018","just we got to be polite about that. But, you know, some it it's necessary"],["1023.199","because I've got, you know, I got to keep the schedule running, keep the service on the rails. Uh our services"],["1028.959","used to be an hour long. Uh but we had three services back then and the attendance in all the different services"],["1034.799","was smaller, so we had plenty of time to talk. Well, 11 years ago, we moved into this facility and the number of people"],["1041.76","attending has grown and then the elders had a choice, right? We said, \"Well, we can stop letting people share in the"],["1048.319","services and just keep them at an hour or we can add an extra half an hour and"],["1055.039","let people share.\" And we opted to make the service longer, but this means, you"],["1061.2","know, the nursery workers are down there longer and our whole service, our whole entire Sunday morning goes longer. So,"],["1066.64","you know, we have to cooperate. And people who asked to do announcements, Suzanne's like, you know, give him a"],["1072.32","time. You got three minutes. That's it. And, you know, and Carl is in hot water because he went over the three minutes."],["1078.88","And Suzanne is going to hammer him for that. And Pastor Mark, the worship team, you get 20 minutes. Pastor Mark, don't"],["1085.679","be preaching little mini sermons between every song. Just move it along. Move it along. Mr. Neville gets 10 minutes for"],["1090.88","communion. Church, you get 20 minutes for your prayer request. Pastor Robbie gets 35 minutes. And uh we just can't"],["1097.2","have a fiveminute backstory for every prayer request. Uh if you we do have a"],["1102.88","ministry for that, we peer uh support listeners and they wear these badges and"],["1108.32","they're here in and around. They'll be milling around up at the front or at the back of the service. So if you need to"],["1113.679","talk longer and you want to pray somebody to pray more extensively, we have a ministry for because we want to"],["1120.64","take time to hear one another's prayers and be available to hear the whole story and pray for you. Uh third is the"],["1128.64","breaking of bread. Communion is important because it commemorates Jesus sacrifice. It affirms our faith in that"],["1136.08","sacrifice. It unites us in worship and spiritual renewal. It's a sacred act of"],["1141.36","remembrance, obedience, and fellowship. And on behalf of the entire"],["1147.28","congregation, I would like to personally thank Mr. Neville for his faithful service in"],["1153.52","leading us in communion. He has been such a blessing and a godly example in"],["1159.52","that ministry. and he ensures that we remain faithful to this ordinance, this"],["1165.12","commandment from Jesus to do this in remembrance of me. And I I do get the"],["1170.559","spotlight on pastor appreciation month, but our elders, they do their job to"],["1175.679","ensure that this church is spiritually healthy. And Mr. has been doing it the longest 33 years he has been serving"],["1184.08","this congregation. We want to thank him."],["1190.48","And then lastly is fellowship. And thinking about that, we know that that"],["1195.919","is a spiritual battle. And talking with a gal here today, it was a spiritual battle just to get to church. Satan"],["1202.559","wants us isolated because when we are alone, it is so much easier to attack"],["1207.6","us. There's no accountability and there's no protection of the group. One of the growing issues in our modern"],["1213.84","world has been the temptation for people to isolate. And our modern times, you"],["1219.44","know, started with the invention of television and people became content to sit at home and just be entertained."],["1225.28","Now, at first TV wasn't, you know, that much temptation cuz there's only three channels and one of them was PBS and"],["1231.919","nobody watched that. It was boring. And then, you know, after a certain point in the day, it just shut off, right? It was just test pattern."],["1241.28","Anybody remember getting up like a half an hour on uh before the thing started on Saturday to watch cartoons? Anybody"],["1246.799","remember watching test patterns? Okay, some of you remember and some of you are like you are dinosaurs. What are you"],["1253.12","talking about? There's a time where we just watched an Indian head. I don't know. It's a test"],["1259.679","pattern. But more content was created, more channels, cable TV, satellite TV."],["1265.12","It brought 24 hours of content for us to consume. But there's still a limited amount of people developing the content"],["1271.039","and it could be regulated. Now, in the last 30 years, the internet has supercharged the situation. Everyone's"],["1277.52","creating content. You can see anything and everything, and there's no accountability, and you can isolate for"],["1284.96","hours, scrolling and scrolling and gaming and gaming and binge watching all"],["1290.32","day, all night, no one to check on you, confront you, closed off."],["1296.72","And the introverts are like, \"Well, why is that a problem? That just sounds amazing."],["1302.4","Well, fellowship is vital in the Bible because it reflects the unity of the"],["1307.84","body of Christ, strengthening believers through mutual encouragement and invites the presence of God into our shared"],["1314.48","spiritual life. It's not just social, it's deeply spiritual like we see here."],["1319.679","They devoted themselves to doctrine, to fellowship, breaking bread. The early church was built on sharing life"],["1327.039","together, teaching meals, prayer, mutual care. They people know each other. They"],["1333.039","can care for each other. It strengthens and encourages believers. Hebrews says, \"Let us consider how to spur one another"],["1339.28","on to love and good deeds, not forsaking the assembling of ourselves together.\""],["1344.32","It helps us stay spiritually sharp and emotionally supported. Fellowship reveals God's presence. We see in"],["1351.36","Matthew Jesus says where two or three are gathered I am I am there in their midst. So we get"],["1356.4","together as believers the Holy Spirit shows up and it promotes healing and"],["1362.159","accountability where we know in James when we confess our sins we pray for one another you may be healed. That was"],["1367.919","James's prescription. Confess and pray and you'll be healed. And then it builds"],["1372.96","maturity. As proverb says, as iron sharpens iron, one person sharpens"],["1379.52","another. So through discussions, correction, and encouragement, we grow together. And and we are called to"],["1386.32","organize ourselves around this community of believers. That's what we see here in"],["1391.52","Acts chapter 2. They were organizing their very lives around this these"],["1396.96","relationships. And sometimes that means we got to push our children to participate when they're kind of"],["1402.559","resisting being here and being a part serving others and growing in community, learning from one another. It's not"],["1409.2","always that entertaining or interesting, but it's what we need to grow as"],["1415.039","children of God. And we are family. Like it or not, we're family. So what we have"],["1422.32","here in Acts is a community where everyone who is participating, they're"],["1428.08","all on the right path. And to prove that the apostles were leading people on the"],["1433.28","right path, the it was reinforced by the signs and the wonders that that they could do. Verse 43, the fear came upon"],["1440.48","every soul and many wonders and signs were done through the apostles."],["1445.52","So just as Jesus used signs and wonders to prove his words were true, the apostles were given that same power. But"],["1451.679","remember, the witnessing of signs and wonders is not a guarantee people will believe because the Pharisees saw Jesus"],["1458","do all kinds of stuff and they still rejected him. Furthermore, on several occasions in the gospels, uh people"],["1465.2","believed before they received a miracle. Remember the woman who was suffering with the issue of blood uh she said if I"],["1471.76","could just touch the hem of his garment I will be healed. The Roman uh officer"],["1477.36","who said to Jesus you don't you don't need to come to my house uh you can I know if you just speak the word if you"],["1484.08","just give the command you have the authority to change that and to heal that. And these were not people"],["1489.919","specifically saying if Jesus proves himself to me then I'll believe. No,"],["1497.12","it's like what Jesus said to Thomas. Thomas, because you've seen me, you believe. Blessed are those who've not"],["1503.279","seen but will believe. We do not need to see the signs and wonders to believe."],["1509.2","But we have seen miracles. We've seen divine intervention, healings, provisions,"],["1515.76","prayers answered exceedingly abundantly above all we could ask or think. So, let"],["1521.44","me repeat the context before we interpret verse 45. These people have"],["1527.279","repented from their sins, committed themselves to learning the word of God, are praying for one another, testifying"],["1532.72","about the sacrifice of Jesus Christ through communion, and they're in constant fellowship. They're acting as a"],["1538.24","family. I cannot stress how foundational that is before we move on to the next"],["1543.76","description. Because if you don't have all of that, you're not going to have this right here. Verse 44. Now all who"],["1550.159","believed were together. See that's the context. All who believed were together"],["1555.2","and they had all things in common. They sold their possessions and goods and divided them among all as anyone had"],["1561.36","need. So you know on a a surface glance you'd say well that sounds like what"],["1566.799","communism supports. You know from each according to his ability to each according to their needs. That's what"],["1572.32","Karl Mar said. However there are differences. The classic definition of"],["1578.72","communism is a political economic ideology that seeks to establish a classless stateless society in which the"],["1587.279","means of productions like land and factories, resources are owned"],["1592.559","collectively rather than by individuals or corporations. And the goal is to eliminate the social classes, remove any"],["1599.76","economic ine inequality. Goods and services are produced based on needs, not profit. And in most historical"],["1607.52","implementations of that politics and economics, it's uh the"],["1614.48","economy has to be directed by a central authority who takes over rather than you"],["1620.64","know supply and demand and market forces. So the outcome sounds the same as Acts"],["1625.76","two. You know they just took all the stuff, sold it, put it in one big pot and shared. But here's the difference."],["1632.64","It's the motivation. It's the the values. Why are they doing"],["1638.64","this in Acts? The motivation is everyone feels like"],["1644.4","they're family. There's love one for another. They have a shared belief in Jesus. They have a shared ethic in the"],["1650.799","word of God. There is honesty and transparency so that the community can properly discern the needs and"],["1657.6","cheerfully meet them. It's not the rich giving to the poor. No, it's everyone"],["1663.36","taking care of everyone. This honesty and transparency, this"],["1668.799","fellowship and serving of one another cannot will not happen if people are"],["1674.08","first of all not saved from the crooked path."],["1679.52","If they do not come off the wrong path and travel on the right path, the system will not work. Well, why?"],["1687.12","It's in nature. The natural human tendencies are going to reveal"],["1692.48","themselves. The greed, the selfishness, dishonesty, laziness, envy, gluttony,"],["1697.84","pride, love of money, the crooked path, all people are on it of their own"],["1703.76","valition and will not aspire to the values of Jesus apart from the moving of"],["1709.44","the Holy Spirit. Preferring others as more important than yourselves,"],["1714.48","humility, sacrifice, loving others. You can't legislate these things. When you"],["1720.64","try to implement a communist government, wealthy people will not naturally just want to give their stuff. So, it's going"],["1728.08","to require a strong authoritarian government, lots of violence, jailing,"],["1734.799","and killing of those who reject it. And then you get all the"],["1740.72","other people who want it who probably overthrew the last government, the the revolution to get there. And they're all"],["1747.44","going to line up for the free stuff, but they have to be honest about their needs and everyone else's needs. See, in Acts,"],["1754.559","all are sharing, not just the rich are giving to the poor. We see this with government assistance,"],["1760.64","don't we? People need qualify and that's good. But then many people"],["1767.52","just want to stay on it and they will overstate their needs so they can take advantage of it. And it doesn't create"],["1774","classlessness. Instead, it incentivizes laziness. It rewards idleness. People"],["1780.48","who honestly do need the help and should get the help are competing against the dishonest who could work, but they don't"],["1787.039","want to. They're just squandering the resources. They don't want to help anyone else. They don't want to put the"],["1792.159","work in. That's why communism is not kind or honest. Think about it. If I'm a"],["1799.2","communist and you're a capitalist, right, I disagree with your government system. What happens? What happens in"],["1806.399","that? Nothing really. You know, I'm entitled to my opinion. You should give all your"],["1811.52","possessions to the state and redistribute it to everyone so everything can be fair. And you're like,"],["1817.039","\"Nah, bro. I'm good. Thanks, but no thanks. I don't sway you over to my form of"],["1822.799","government. Life goes on. I don't get my way, but everyone lives."],["1829.76","But if you're a capitalist in a communist system, the system says, \"Give us all your stuff so we could"],["1835.2","redistribute it.\" And you say, \"Nah, bro. I'm good. Thanks, but no thanks.\" What happens?"],["1841.039","You get arrested. You get jailed. You can get shot. Communism sounds good in theory, but it"],["1847.279","requires violence to enforce it. And if people don't agree with giving their stuff willingly, taking it from them is"],["1855.039","theft. And killing them for resisting is murder. And you could say, well, the"],["1862","government, the laws say it's just, but it's just theft and murder, government"],["1867.44","sanctioned crimes at that point. Now, on the other hand, people who"],["1872.64","profit off of capitalism and have an abundance more than they need to the point that they're becoming"],["1878.159","millionaires, billionaires, Elon Musk is now a trillionaire. If people do not use their goods, their"],["1884.64","blessings to help others, that too is immoral and sinful, a violation of the"],["1890","laws of God in the Old Testament and disobedient to the teachings of Jesus in the apostles in the New Testament. I"],["1897.12","point to you Deuteronomy chapter 15 if you want to turn there. Deuteronomy chapter 15. It's a lengthy section. I"],["1902.88","was running out of time. I didn't make you a slide. Just read along. Deuteronomy 15:7."],["1908.48","If there is among you a poor man of the brethren within any of the gates in your land which the Lord your God has given"],["1914.32","you, you shall not harden your heart, nor shut your hand from the poor brother. You shall open your hand wide"],["1919.44","to him willingly lend his sufficient for his need, whatever he needs. Beware lest there be wicked thoughts in your heart,"],["1925.84","saying, \"The seventh year, the year of release is at hand. Your eye be evil against your brother, your poor brother."],["1931.84","You give him nothing. He cries out to the Lord against you. It becomes sin among you. You shall surely give to him,"],["1939.2","and your heart should not be grieved when you give to him. Because of this thing, the Lord your God will bless you"],["1944.88","in all your works, and to which you have put your hand to. The poor will never cease from the land. Therefore I command"],["1951.2","you saying you shall open your hand wide to your brother to your poor and the"],["1956.799","needy in your land. And then James says the apostle James says pure and"],["1962.799","undefiled religion before God the father is what? Visit the orphans and the"],["1967.84","widows in their trouble. Care for those hurting needy people."],["1973.36","So well then why not you know use the power of the state to force people to do something good. force them to make the"],["1980","path straight because you can't legislate morality."],["1985.039","People have free will. God has chosen to give people liberty and we have to"],["1990.96","choose to want to do what is right. Everything that happens in Acts chapter"],["1996","2, everyone is doing it freely. Nobody's coerced. They do it because"],["2003.2","they believe the Bible. They do it out of love for the brethren. They do it because they value their community,"],["2008.559","their church family. They value the gospel. They value the building of the kingdom of God. That's why they do it."],["2015.76","So, it looks like Faith Bible Church is going to finish the year bringing in roughly $1.5 million. And what's"],["2022.72","interesting about that is nobody received a bill, right? Nobody"],["2028.48","got build. Nobody was asked to sign a pledge. Nobody got a letter from Suzanne reminding you to bring your money this"],["2034.48","week. All we do is we just give you an opportunity as the Lord lays it on your"],["2041.36","hearts. We accept free will offerings. And you do it because you value what is"],["2049.599","happening here. You do it because you believe what we're saying. You believe"],["2054.96","in what we're doing. Now, we got an entire budget prepared for next year, and we have made agreements to bring to"],["2062.159","pay people full-time salaries. uh part-time salaries. We have promised"],["2067.2","missionaries that we're going to send them thousands of dollars. We have accounts with the utilities and with businesses that we are going to have to,"],["2073.919","you know, make sure we pay them pay them what we owe we are owed. And we've done that all on faith because we have no"],["2080.639","guarantees that any will give anything because nobody has to give. That's not"],["2085.919","how communism works. That's not how taxes work, is it? It's law. You got to"],["2091.839","pay them just like they did in Acts is the same thing that is happening here."],["2097.68","People give freely because of their faith, their hope and their love."],["2103.28","If you want to break the laws of God and you want to hoard your money, you will"],["2108.96","stand before God in judgment and you'll have to give an account for that. You'll have to give an account for the time and"],["2114.88","the treasures. Jesus said, \"What does it profit a man to gain the whole world and"],["2120.32","lose his soul? But if you steal and kill from people, forcing your your society"],["2126.16","into a communist utopia, you likewise have to stand before God and be judged on those crimes.\" So neither path is the"],["2134.24","straight path. Both are going in the wrong direction, which is why everyone in the country can agree and why"],["2139.599","everyone is right. Things are on the wrong direction. America's on the crooked path. And the only straight path"],["2147.28","is the individual repentance and revival."],["2154.079","This verse, if my people called by my name will"],["2159.599","humble themselves, pray, seek my face, and turn off that wicked path, turn off that"],["2167.119","crooked way. I will hear from heaven, forgive their sins, and I will heal their land. That and only that is"],["2174.48","the right direction for the individual, the community and"],["2179.76","the country. And you can sit here and complain about everything wrong in the country, but will you take the step of"],["2186.32","faith and you get on the right path? Will you join the church to give and"],["2192.16","serve in a manner that is faithful to God? If you're not willing to get on the right path personally, why would you"],["2198.16","expect anyone else in society to do it? Lord, we just pray that we can learn"],["2204.88","from your word, applying this properly and effectively, not to the the country,"],["2211.44","but to ourselves individually, and that we would aspire to do these things and"],["2217.44","how we orient our lives around faith and community, around doctrine, prayer,"],["2224.32","breaking bread, and fellowship. and that we would abide by these things and that"],["2229.52","we would grow uh to be like you in all that we do and say praying in Jesus"],["2234.56","name."]]},{"id":"96YIFUIZdns","name":"2025-11-23  Why Would God do a Miracle? (Pastor Rob McNutt)","date":"2025-11-23","transcript":[["21.199","Pastor Mark has been creating one minute reels of me preaching,"],["27.92","posting them on social media. Just a little bite-sized piece of the sermon clipped out, put on Facebook and"],["34.48","Instagram and social media. first one he did four weeks ago, he told"],["39.52","me it got 4,000 views. And you know, typically we get like 300 views uh for"],["44.879","the whole sermon. But these reels, these shorts, they're getting like a,000 views. And when he told me that, I said,"],["50.64","\"Well, that's because it's more tolerable to listen to me for a minute instead of, you know, 35.\""],["57.68","After the first one hit 4,000 views, he said, \"I'm going to make you famous.\" And I pondered like, \"What if? What if,"],["65.6","you know, one goes viral and millions of people uh watch it? What if Faith Bible Church becomes an internet sensation?"],["72.479","And I thought, what would we do if we had a big response which resulted in more growth and more more support? What"],["78.96","what good would be that of that? How would we use it? And I know what you're thinking. Uh don't get your hopes up,"],["85.68","Pastor Rob. You're not viral material. And sure, I get that. But you know"],["92","suppose miraculously it happened. God decides to bless our preaching of the word in a manner that it goes viral."],["98.079","Could he? Yeah he could. Should he? What would be the reason? God does"],["104.72","miracles. But why? What are the reasons? And I think we see a reason why God"],["112.24","lends his power to a miracle done through Peter and John here today in Acts chapter 3. So, let's turn over and"],["118.88","study that and see if we can learn why God does this miracle."],["125.92","Acts chapter 3, uh, new chapter. Let's, uh, read the first nine verses to start"],["131.2","off. Peter and John went up together to the temple at the hour of prayer, the 9th hour. And a certain man lame from"],["138.239","his mother's womb was carried whom they laid daily at the gate of the temple which is called beautiful to ask alms"],["145.599","from those who enter the temple who seeing Peter and John about to go into"],["150.8","the temple asked for alms and fixing his eyes on him with John. Peter said look at us. So he gave them his attention"],["158","expecting to receive something from them. Then Peter said, \"Silver and gold have I none, but what I have I give to"],["164.959","you. In the name of Jesus Christ of Nazareth, rise up and walk.\" And he took"],["170.16","him by the right hand, lifted him up, and immediately his feet, ankle, bones received strength. So he, leaping up,"],["177.519","stood and walked, and entered the temple with them, walking and leaping and praising God. And all the people saw him"],["185.28","walking and praising God. Then they knew it was he who sat begging alms at the"],["191.519","beautiful gate in the temple and they were filled with wonder and amazement at what had happened to him. So the nar the"],["198.4","the nar the narration says that they went up to the uh temple at the hour of prayer the 9inth hour the hour of prayer"],["206.8","at the temple referred to a fixed times that the Jewish traditions devoted the Jews to gather for prayer. uh the"],["213.76","tradition was uh to pray three times a day and these prayers align with the"],["219.04","morning and evening sacrifices and by the time of the New Testament the hours were very standardized. So the the 3"],["226.4","hour is 9:00 a.m. The 6th hour is 12 in the afternoon, you know, noon time and"],["232.4","then the 9th hour is 3:00 p.m. You see that often in the Gospels, them talking about these hours and which hours. Even"],["239.28","after Jesus' resurrection, the disciples continued Jewish prayer practices,"],["244.64","showing continuity with their heritage while living out their new faith. The"],["250.4","routine prayer time became the setting for this miraculous healing. This"],["255.92","illustrates how ordinary devotional, ordinary devotion opened the door for an"],["262.32","extraordinary encounter. Ordinary devotion opened the door for an"],["268.32","extraordinary encounter. If Peter and John were not following the routine of going to the prayer time, they would not"],["274.32","have encountered this man. If there was no ordinary prayer time and people coming and going at the temple, there"],["279.84","would have been no reason for this man to be there. People tend to beg where there's lots of traffic, where there's"],["285.52","lots of people. What would be the point of begging someplace where nobody is walking by?"],["290.72","The more people, the more chances someone's going to toss him some change. So, it's this guy's routine. He lays"],["296.96","there. How often? It says he's there daily. He's daily. Question. Do you have any ordinary devotional"],["305.04","activities that could open the door for extraordinary encounters?"],["310.8","Think about it. Jesus in the New Testament authors repeatedly instruct us"],["315.84","to pray without ceasing, to practice some commitment, steadfastness, to"],["322.24","exercise some persistence in our ordinary devotional activities. We are"],["328.8","to create these religious activities for ourselves, habits, customs, behavioral patterns."],["335.68","The Jews had prayer three times a day. Probably most people aren't going to show up three times a day here to the"],["341.28","church to pray. You could, it would be open. You could, but uh probably that's not going to happen. But maybe you could"],["346.639","start a weekly lunch break Bible study at your work or you could join a small"],["352.88","group in someone's home or you could start one in your home or maybe go to uh French fellowship of Christian athletes."],["358.56","Maybe go to the men's retreat, the C4 retreat. Thursday nights there is a prayer group that uh prays uh on just"],["364.88","it's a call-in. It's a It's a uh conference call. You don't have to leave your house. You can sit right there in your PJs and just call in and pray with"],["372.08","people. Uh there's uh seniors Bible study. There's Rightway God's Way still."],["377.12","Even after Emily leaves, they'll still have that uh celebrate recovery. Come to the table, support groups. We have all"],["383.199","these small groups, classes, programs, fellowships that are there to help us connect with the people of God, but also"],["390.96","more importantly to help us connect with God. They are a way to exercise some ordinary"],["398.479","devotion. Yeah, you might have attended one of these groups and concluded that was nothing special"],["404.56","that wasn't particularly life-changing. But let me encourage you to keep at it, keep attending, keep connecting, you"],["410.319","know, dutifully, you know, opening up, serving others. You may not see any any big deal in it,"],["417.84","you know, on the on the week to week, month to month, even year to year. But you know, one day maybe your child or"],["425.199","your grandchild comes down with leukemia and then all of a sudden everybody wants"],["431.36","to be there to pray with you and to offer some help. What can we do for you? How can we help you in a really dark"],["438.24","time, a time when you're very weak, you could have all these people praying for your miracle?"],["445.919","I've often wondered how, Paul, this is going to hit. I often wonder how people who have no community make it through"],["452.319","hard times. And the answer is often they don't. When"],["459.52","we don't have family to fall back on or church to fall back on, many people don't make it through. And I saw this in"],["466.88","the news this week. Since 2016, the Canadian federal government has"],["472.4","allocated more than $16.5 million towards implementing and"],["478","expanding its euthanasia system. Officially called medical assistance in"],["484.4","dying. Medical assistance in dying. So all you you know base workers, you already created an acronym, didn't you?"],["491.44","MAD. That's what it's called. It's called MA. One of the concerns with the legalized assisted suicide program is"],["498.8","the lack of oversight on motivations for assisted death. The health minister"],["505.599","declined to answer any questions regarding government monitoring of the youth in Asia requests tied to poverty,"],["512.159","mental illness, or a lack of disability support stating that none of those"],["518.159","conditions fall under the maid eligibility criteria. However, internal"],["523.279","documents from Ontario doctors in 2024 revealed that patients increasingly cite"],["529.04","economic hardship and loneliness as reasons seeking euthanasia."],["534.959","In in one documented case, a middle-aged worker with debilitating injur injuries"],["540.16","chose euthanasia after losing financial support. Another patient, a woman"],["545.76","struggling with obesity and depression, was reportedly"],["551.2","approved for assisted suicide after the doctor deemed her condition grievously"],["557.04","irreversible. Critics say that the funding surge has coincided with the deteriorating access"],["564.399","to basic medical services. The Canadian Liberal government has expanded youth in Asia eligibility 13fold since 2016,"],["572.32","making Canada's program one of the fastest growing in the world. Meanwhile, wait times for standard medical"],["578.24","treatment has reached the average of 28 weeks. My mom hasn't seen a doctor in"],["585.44","years. She gets a nurse practition through a video. That's what she has available. And this has left Canadians"],["593.68","to opt for euthanasia rather than wait for care. Some terminally ill and elderly"],["601.2","patients who refused medical assisted assistance in dying have been labeled selfish by their"],["608.8","health care providers. So according to Health Canada 2022 report 13,241 Canadians died through"],["616.399","youth in Asia. 4% of all deaths nationwide were by that and that's an"],["622.48","31% increase from 2021. As public concern grows over Canada's"],["628.64","expanding medical assistance by death system, critics argue that federal spend"],["634.399","spending priorities reveal a disturbing imbalance, pouring millions into assisted dying while tens of thousands"],["641.12","of Canadians struggle to access the medical care they might have had to help them live."],["648.56","So piggybacking on last week's discussion about socialization, the government taking over and running"],["654.959","things, everyone thinks universal healthcare would be the answer until you have to have to wait 28 weeks to get a"],["662.16","doctor's appointments. An immoral government would sooner cut corners and have you die than live."],["671.279","A lesson that we need to learn from a 40-day government shutdown is a"],["678.56","government who feeds you can also starve you."],["685.68","Your government is not your community. It will not love you. You need real"],["691.76","relationships with real people. But more importantly, you need a real relationship with a real God. And I"],["698.399","highly recommend you develop some ordinary devotional activities that can open the door for extraordinary"],["705.76","encounters. A certain man lame from his mother's womb was carried laid at the gate of the"],["713.04","temple called beautiful asking for alms for those who entered the temple. Seeing"],["718.399","Peter and John about to go in the temple, he asked for alms. So we learn this man was born"],["726.079","uh and uh we see him sitting there begging. When when you see someone begging, uh it's normal to look at them"],["731.839","and try to evaluate, you know, were they born this way uh into this bad situation or maybe did they bring this calamity"],["737.76","upon themselves walking around uh Malaga and Spain? We saw folks um sitting on"],["743.68","the street begging. You remember that one lady with the deformed legs, right? And it's like, okay, she was born that"],["749.04","way. There was another fellow. He had no arms and he was just sitting on the sidewalk with a cup in his mouth and it"],["756.24","had change in it. And this is what he did. He just sat there shaking the cup and that's how"],["762.32","he was communicating, you know, hey, can you spare some change? Um, so you look"],["768.079","at them and you say, \"Well, I I understand why you're sitting here because you know you can't walk and you don't have any arms, so probably your"],["774.32","options are limited.\" But then other people didn't appear to be have anything wrong with them and they too were just"],["779.44","kind of there begging. And there there was this one guy and uh he would be in the middle of the of the walkway and he"],["785.6","this was his position. He would be on his knees and his elbows like that. I"],["791.36","can't even do this. This is hard. With the cup up in his hand like this. And uh he just was perched like this."],["799.44","And uh I looked at him and I said uh I said, \"My guy, that that is really hard.\" Um, that's harder than pushing a"],["806.72","broom. So, I think if you got strength enough to hold that position for 15 minutes, you manual labor is way easier."],["814.24","Maybe you should try something else. But, you know, maybe uh he couldn't stay sober enough to work a job or maybe he"],["821.04","couldn't get along with people. Or maybe, you know, one of the things we were encountering was, you know, he was uh maybe he was illegal and he wasn't"],["827.2","allowed to work in the country. So, he'd somehow developed and created this particular bad situation for himself."],["833.44","Either way, no matter how they got there, I don't think any of them were"],["839.199","particularly comfortable with the situation, and we weren't really comfortable either. All these interesting thoughts run"],["846","through your head when you see people like, well, what what what could be done differently? Where's their family? You know, where where's where's the"],["852.56","government agencies? What nonprofits are available? What can be done? And and at this moment, what could what can I do?"],["859.199","You know, to make any real lasting impact, I I can do very little. I'm just visiting Spain for a month for for m"],["866.48","momentary relief I you know I can give you a euro and uh you know you could you know get enough to get some food or you"],["872.16","know something to drink later but if I do that to every person who's I'm walking by begging then you know I don't"],["878.079","have any money so many times I just have to walk on by without making eye contact"],["884.079","and just pretend they're not there and I'm not particularly comfortable that strategy and the person I'm passing by"],["889.12","wishes that I would do more than simply ignore But uh I'm sure they have numbed"],["894.8","themselves to that reaction. They sit there begging, ignoring people's non-responses while you know we ignore"],["901.6","their presence. The same thing is happening at the temple gate. This guy is part of the"],["907.04","routine. People see him every day begging and that's just, you know,"],["912.32","blends into the scenery. They walk by him without looking at him and he sits there without looking at people ignoring"],["918.16","him. But then Peter stops and says, \"Look at us.\" And"],["923.839","the guy goes from arms arms to, \"Oh, they're going to give me something.\" And they look at him. And that reminded me"],["930.56","of of when Jesus walked up to the the guy, remember at the pool who was like lame and waiting for the miracle. And"],["937.04","Jesus, it seemed a little callous, right? He walked up and said, \"Do you want to be healed?\" It's like, \"What? You want to be"],["943.44","healed?\" We we can assume that the person sitting there in that situation doesn't like that situation. But but"],["948.72","maybe they don't want to be healed. Maybe they don't want to change. They just would like some some change"],["956.48","because changing is harder than getting loose change. Maybe you do not have any ordinary"],["963.92","devotional activities because you don't really want any extraordinary opportunities. Often I encounter people"],["972.16","who don't really want to change. They just want us to give them some change. Uh sometimes they call say do do you do"],["979.12","you help with power bills? Get these Jennifer, don't you? Right. Do do you help do you help with the rent? And I'll"],["985.519","say uh we help people get to know Jesus and will help you with your bills and"],["990.639","you can come join us. Click. They don't want to change. They just"],["996.88","want some change. Which do you want?"],["1003.6","Peter's only got one. This is this great quote. He says"],["1009.92","he gave them his attention expecting to receive something. And Peter said, \"Silver and gold I have none, but what I"],["1017.279","have I give to you in the name of Jesus Christ of La Nazareth.\" What?"],["1023.92","Rise up and walk. Rise up and walk."],["1033.52","He says, \"I can give you Jesus.\" Is that enough? Well, it sure seems like it is"],["1038.559","enough cuz look what happened. He grabbed him by the hand, lifted him up, bone, ankle bones received strength,"],["1045.12","leaping up, stood, walked, entered the temple, walking and leaping and praising God. And all the people saw him walking,"],["1051.28","praising God. Then they knew it was he who sat begging."],["1063.76","walking and leaping, praising God. And it's really nice for this dude because he was born lame. And it's awesome that"],["1068.88","he's giving the praise to God, not praising Peter and John. But our"],["1073.919","question at the start of the sermon was, do you remember why would God do this miracle for him?"],["1081.52","And more to the why would he do one for you? What is the reason for your healing?"],["1088.24","What is the reason for your blessings? Because it will make me happy"],["1093.36","because it'll make my life easier. I I doubt that that is high on God's list of importance."],["1100.08","You know, Robert, there's people dying in Nigeria, but you know, you know, I I make me happy. That would be nice."],["1108.96","Everyone's going to get sick and die. It's not about if, it's a matter of"],["1114.32","when. This lame guy, he ain't around anymore. Eventually, he got sick and died. So, why bother heal him? You know,"],["1121.76","why why bother helping us? Well, let's dig into Peter's message. And maybe"],["1128.64","that'll give us some clues to answer that question. Verse 11 it says,"],["1134.559","\"Now as the lame man who was healed held on to Peter and John, all the people ran together to them in the porch which is"],["1140.96","called Solomon's greatly amazed. So when Peter saw it, he responded to the people,\"Men of Israel, why do you marvel"],["1148.799","at this? Or why do you look so intently as at us as though by our power or"],["1154.4","godliness we have made this man walk?\" Why do you marvel? What's Peter doing?"],["1160.4","In modern speak, Peter's he's flexing on everybody in the name of Jesus, right?"],["1167.12","You know who we are. You you know who we represent. Jesus, he's you saw him do"],["1172.72","this. You saw him do this all the time. Why are you acting like we aren't about this? This is what we do in Jesus' name."],["1180.559","You must not know about me. You must not know about me. I could have another miracle in a"],["1186.559","minute. Peter's flexing, but in Jesus name. Why"],["1192.16","you look so intently as though by our own power or godliness we have made this man walk? And now this is where we're"],["1199.52","getting to the whole point of the miracle. It's not to heal the lame dude so his life is easier. No, it's so"],["1207.52","Jesus' name will be lifted up. Glorify. And that is something I'd like you to"],["1213.36","contemplate. You are all going to suffer in this life. Whether you create your own mess"],["1220.559","or through no fault of your own like this dude who was born with this affliction. Regardless, we all suffer."],["1228.48","And what I offer you is what Peter offered. Let it be used to bring glory to God."],["1238.4","Let's use our brokenness to showcase his power and make his name famous. The"],["1244.96","Apostle Paul talked about afflictions that he was suffering. Turn to 2 Corinthians 12. 2 Corinthians 12 verse"],["1252.559","number 7."],["1258.559","Peter's talking to the Corinthians and he says, \"Unless I should be exalted above"],["1264.559","measure by the abundance of the revelations, a thorn in the flesh was given to me, a"],["1270.48","messenger of Satan to buffet me, lest I be exalted above measure.\""],["1275.84","Well, concerning this thing, I pleaded to God three times that it might depart from me. You know, this is an apostle,"],["1281.44","eh? Like Paul healed people in uh his ministries. He prayed and miracles"],["1287.84","happened. The disciples prayed and miracles happened. So here's Paul. It's not a problem. I can handle this thorn"],["1292.96","in the flesh. I just got to pray. I can pray consistently. I can pray with devotion. I asked three times and the"],["1300.159","answer is no. My grace is sufficient to you. for"],["1307.52","my strength is made perfect in your weakness."],["1315.84","Now Paul says, \"Therefore I most gladly I will rather"],["1322.4","boast in my infirmities that the power of Christ might rest upon me. Therefore I take pleasure in"],["1329.28","infirmities, in reproach, in needs, in persecution, in distresses.\" Anybody got"],["1335.28","any distresses? I take pleasure in distresses for Christ's sake because when I'm weak that"],["1342.88","I am strong. I get it. You don't want to be seen as"],["1348.96","weak. You know, you don't want to suffer. You don't want people to know about your brokenness or your shame. See"],["1354.88","your messy family, the flaws, the failures. It's it's embarrassing."],["1360.48","I'm sorry. It's no fun, but it's true. It's who we are."],["1366.48","It's who we all are. And yet our weaknesses is what God can"],["1373.44","use if we'll be honest and open with them. Lonely moms,"],["1379.44","postpartum depression can find other lonely moms and help and support each"],["1384.799","other. Grieving people can find other grieving people. People with habits,"],["1390.72","hang-ups, and hurts can encourage one another, even provide accountability if they'll open up."],["1398.48","I didn't get into the ministry because I have my life altogether. I got into the ministry because I was failing at"],["1403.52","everything else. I failed into this."],["1411.039","And by serving others, it gave me a purpose. And we just went and got a, you know, a real lowpaying ministry position"],["1418.559","working with teenagers. No real plan in this. I just I I was a messy teenager, young adult. And I thought, well, you"],["1425.36","know, I turned to Jesus and he helped me. Gave me direction and purpose. So maybe I can just help these kids, you"],["1430.4","know, turn to Jesus and get some direction for their life. The lame dude, his problems, his"],["1436.799","brokenness, it's known by everybody in the city. There there's nothing that can be done to heal him. He's begging at the"],["1442.88","gate. He's doing it his whole life. We learn in chapter 4, he's been there for 40 years. It's the best he can do. But"],["1448.64","now he's healed. And so the greatness of the miracle is magnified by the helplessness of the man. The power of"],["1456.48","God is showcased because the man's brokenness was so extensive. And now the knowledge of God's power in the"],["1462.48","disciples becomes so well known because the man's at the gates weakness was so"],["1468.32","well known. See how that works? If you hide your brokenness and your"],["1473.679","weakness, how will God be glorified when he heals you?"],["1479.36","Everything done here is done to proclaim the name of Jesus."],["1484.559","Verse 13. Peter continues on. He says, you know, why do you look at us"],["1491.12","like we had the power to make him walk? The God of Abraham, Isaac, and Jacob. The God of our fathers glorified his"],["1497.52","servant Jesus whom you delivered up and denied in the presence of Pilate when he was determined to let him go. But you"],["1503.2","denied the holy one and the just and asked for a murderer to be granted to you. Verse 15. And killed the prince of"],["1509.12","life whom God has raised from the dead of which we are witnesses."],["1514.24","Wow. Not sparing anybody's feelings here, are we? Just brutally honest facts. Even the Roman Pilate, the"],["1521.039","heathen who everybody resents, even he was willing to spare the Messiah. But you denied the holy one. You traded him"],["1527.84","for a murderer. The thief named Barabbus."],["1533.84","You denied him. Ask for the murderer."],["1539.039","This is the reason for the miracle. The reason is to get everyone's"],["1544.08","attention so the disciples can give them the truth. But this is a very dangerous message. Wouldn't you agree? It's the"],["1550.799","truth, but it's damning. This speech could get Peter killed. It's not very secret sensitive. You"],["1558.24","killed the Messiah. So much tension. But then he relieves it."],["1563.279","Of whom God raised from the dead. And we are witnesses. His name through faith in"],["1569.679","his name has made this man strong whom you see and know. Yes. The faith which"],["1575.2","comes through him has given this perfect soundness in the presence of you all."],["1582","And there is the point of the miracle. Through faith in his name, silver and"],["1587.679","gold have I none, but what I have I give to you in the name of Jesus Christ."],["1594.24","God doesn't care if Rob McNut name gets famous. These sermons go viral"],["1600.4","to millions of people. Why should God care about that? Why should What good is it to heal"],["1607.84","sick people who are just going to die again? What good is it to help poor people who"],["1613.36","are just going to be hungry again next week? Oh, life is fleeting. Why not euthanize the old and the sick and the"],["1620.88","the useless people in Canada? Maybe Canada's got the right idea."],["1628","Life is fleeting, but Jesus is eternal. All people die, but Jesus is the"],["1635.52","resurrection. And the point of serving weak, sick people is to show them the"],["1641.52","love of Jesus so they can have that message. The point of helping scared pregnant moms is to show them the love"],["1648","of Jesus. The point of any ministries that we provide, the point of preaching these messages and putting them out on"],["1653.12","YouTube is to proclaim to anyone who'll hear, \"Yes, you are a broken mess. Yes, you are hurting. Yes, you are sick. And"],["1659.6","yes, you are going to die. But you can be resurrected. You can be restored. And"],["1664.64","you can have eternal life through faith in the name of Jesus. That's why we do it."],["1675.76","Ver verse 16. And his name through faith in his name has made this man strong"],["1681.44","whom you see and know. Yes, the faith which comes through him has given him"],["1686.72","this perfect soundness in the presence of you all. And then Peter lightens up and he gives them throws them a bone. uh"],["1694.08","in a backhanded sort of way. Verse 17. Yeah. Now, brethren, I know that you did it in ignorance as did the rulers. You"],["1702.159","murdered the Messiah, but I know you did in ignorance. You know, you and the you know, thanks Peter. You you ignorant"],["1708.24","people. Now, not to cons to criticize the apostle Peter or the, you know, the leader of the disciples, the one of the"],["1713.919","founding stones of the church. However, he too denied Jesus, right? He and the"],["1719.52","disciples, even though Jesus told them what was going to happen, they couldn't get their heads around it. They too were"],["1724.96","ignorant to what Jesus was doing. It wasn't just the people in Jerusalem. You"],["1730","can be informed and ignorant. Like Eve in the garden, she was informed that eating the fruit would lead to death,"],["1736.24","but she was ignorant to what that fully meant. And we all have to deal with a level of"],["1742.32","ignorance when it comes to fully understanding God and his ways. We never"],["1747.36","will be able to fully comprehend an infinite God. We'll never completely know an immeasurable God. His thoughts"],["1754.399","are not our thoughts and his ways are not our ways."],["1759.919","Why are you doing this God? Why am I suffering? Why did you make my life, brother? My grace is sufficient for you."],["1767.919","We will not understand all that God is doing. But what I can get my head around is what he revealed through the person"],["1774.72","and the work of Jesus Christ. Amen. That I can understand. Verse 18. But those things which God foretold by the"],["1781.919","mouth of all his prophets that the Christ would suffer."],["1787.36","He has fulfilled this. Repent therefore and be converted that your sins may be blotted out and a time"],["1795.12","of refreshing may come from the presence of the Lord. Christ came to suffer and die for our"],["1803.76","sins so that he could rise again and become the resurrection for us and we"],["1809.6","can be changed through the power of Jesus' name."],["1814.64","So not just can we be changed,"],["1820.32","we need to be changed. You get that right? Our brokenness, our pain"],["1826.72","illustrates to us the depths of our need for Jesus."],["1833.6","Christ would suffer. Peter said, \"Christ suffered.\" Now, be"],["1839.76","honest. You don't think you deserve to suffer, do you? You don't think you're that bad."],["1847.52","So, why are you making me suffer, God?"],["1852.96","Jesus suffered for our sins. So if you don't deserve to"],["1858.96","suffer, whose sins was he suffering for then? If you say you don't deserve to suffer,"],["1864.88","then I guess he wasn't suffering for your sins. Must have been someone else's sins, eh?"],["1871.279","I remember doing poorly on tests. That was a very common thing. Um, kids would, you know, you know, you get it back and"],["1878.799","then you look around what everybody else got. You know, what'd you get? What'd you get? What'd you get? Oh, you got 50."],["1885.76","You know, made me feel better uh to know that uh I would didn't have the worst"],["1891.12","grades. You know, I'm not as dumb as Rick. Sorry, Rick."],["1898.96","We want to justify ourselves by bearing by comparing ourselves to someone else's badness."],["1905.279","We want to justify ourselves based else's bad behavior. But God's standard is holy and perfect righteousness."],["1913.76","And I think we suffer so that we can understand how much we need to be"],["1918.96","changed, how much we need Jesus. Repent, therefore, that's the right"],["1926.24","answer. Verse 19. Repent, therefore, be converted, that your sins will be blotted out, so that the time of"],["1931.76","refreshing may come from the presence of the Lord, and that he may send Jesus Christ, who has preached to you before,"],["1937.679","whom heaven must receive until the times of the restoration of all things, which God has spoken by the mouth of all of"],["1944","his holy prophets since the world began. The restoration of all things, the"],["1949.919","miracle of the healing of the lame man on the micro level was to illustrate to the people the power of Jesus. what"],["1956.32","Jesus one day would do on the macro level, the restoration of all things."],["1961.679","And that is a message that truly resonated with Peter's audience. They were desperate for the restoration of"],["1967.36","their land, of their empire, of their people to fulfill all the prophecies."],["1973.679","Peter refers to the covenants, the laws, and the prophets. Here verse 21, he"],["1980.32","talks about the restoring all things that God has spoken by the mouth of the holy prophets. Verse 22. Moses truly"],["1986.08","said to the fathers, \"The Lord your God will raise up for you a prophet like me from your brethren."],["1993.919","Him you shall hear in all things. Whatever he says to you, and it shall be that every soul who will not hear that"],["2001.2","prophet shall be utterly destroyed from among the people.\" Yes. And all the prophets from Samuel and those who"],["2008.159","follow as many as have spoken have also foretold in these days. You are sons of"],["2013.919","the prophets and of the covenant which God made with our fathers. Saying to Abraham and to your seed all the"],["2019.919","families of the earth shall be blessed. To you first God has raised up this servant Jesus sent him to bless you in"],["2027.2","turning away everyone from your iniquities. Peter says, as Moses said, as Samuel, as"],["2035.519","all the prophets said, as the covenants made with God, God's promises, Jesus is"],["2040.96","the fulfillment of the Old Testament, the Old Covenants. Peter's not going to rely solely on this miracle to convince"],["2048.24","these people his message is from God. He validates his actions with the word of God, with scripture. Like we said last"],["2055.28","week, miracles, signs, and wonders are not ironclad proof that something is of God. Actually, in the last days, signs"],["2062.48","and wonders are used to deceive the people. Jesus warned in Matthew 24:24,"],["2067.919","\"False Christ, false prophets will arise, showing great signs and wonders to deceive.\""],["2074.079","And Paul said in 2 Thessalonians, describing the coming of the lawless one, according to the works of Satan,"],["2080.56","with powers and signs and lying wonders, and with all unrighteous deception among"],["2086.079","those who perish. And real soon, we are going to see great"],["2091.2","signs and wonders being performed. We'll see them, but you can't trust in"],["2096.8","those alone. It is the word of God that is truth. If those performing the miracles contradict"],["2103.76","the word of the Lord, do not do them in the name of Jesus, or worse, deny the name of Jesus, then they are lying"],["2109.92","wonders. They are deceptive signs. Peter claimed healing in the name of"],["2115.2","Jesus. Peter preached repent and convert to faith in Jesus. Jesus is the fulfillment of the law and"],["2122.4","the prophets. Moses truly verse 22 said to the fathers, \"The Lord your God will"],["2127.44","raise up to you a prophet like me from your brethren.\" So he's saying this is what Moses said and that's who Jesus"],["2134","was. Him you shall hear in all things whatever he says to you. And it shall be"],["2139.04","that every soul who does not hear that prophet shall utterly be destroyed from among the people. Those who don't hear"],["2145.359","the prophet will be destroyed. Salvation's found in Jesus' name. But those who do not hear will not listen to"],["2150.88","the one God raised up. They shall be utterly destroyed. Maybe not right now. You know, God didn't send lightning"],["2156.96","bolts down on the people in Jerusalem to punish them for crucifying Jesus. But"],["2162.079","their destruction was waiting for them. The fall of Jerusalem was one generation away. It was 40 years away. And the same"],["2169.119","is true for all of us. Our destruction is just down the road. For some, a"],["2174.4","generation away. Some of us 40 years from now. Some it could be longer and some it could be a whole lot shorter."],["2182.48","We do not know exactly when it'll come. But we do know it's coming. But salvation,"],["2188.88","resurrection, and restoration is found in the one who God raised up. Verse 26."],["2196.16","To you first God has raised up his servant Jesus. Sent him to bless you."],["2201.44","How? and turning away everyone from your iniquities."],["2207.44","So we see today God used Peter to do a miracle in Jesus' name so that the people would pay attention to the gospel"],["2214.24","message. Jesus is the Messiah. Repent, convert, believe in his name. If God"],["2220.72","were to do a miracle for me, for you, it would be for the purpose of using it to"],["2226.32","glorify the name of Jesus. Well, great. Once God does a miracle for me, I'll glorify his name. Well, first everyone"],["2235.2","knew how broken this man was. And that way they could see the power of Jesus"],["2241.599","changing him. So we ought to start with glorifying God in our weaknesses, in our"],["2247.359","brokenness. May he be glorified in our weaknesses. So when he does use us, we"],["2253.359","can say, \"I I was too weak, too broken to do anything, but Jesus is changing"],["2260.24","me. Jesus is helping me. I'm trusting him no matter what, and one day he will"],["2266.64","restore all things.\" Well, how will the people respond to Peter's harsh sermon? Do they want an"],["2273.92","extraordinary encounter? Do they want to be changed?"],["2279.28","Well, you have to come back next week to find out how they respond. But what about you?"],["2286.56","Do you want to be changed or are you settling for some loose change?"],["2293.359","Lord, we just pray that we would turn all of these anxieties and all of these"],["2299.04","cares and all of this brokenness and affliction over to you"],["2304.4","to trust you in it and through it for whatever you're planning to do. And that we would be honest and transparent about"],["2311.359","the brokenness, about the mess, so that we could see you do something to"],["2318.32","glorify your name. And Lord, we that's a hard message, but may we realize it's"],["2324.96","not about this life. It is the restoration of all things. In one day, you make all things new. And we have to"],["2331.359","trust with that promise every day. Strengthen this people, we pray in Jesus"],["2337.04","name."]]}]