[{"id":"vMKeG-cBgDU","name":"2025-08-24  Willingness To Obey (Pastor Rob McNutt)","date":"2025-08-24","transcript":[["21.359","Okay, take your copy of the word of God and turn to Jonah chapter 4."],["28","Chapter 3. Let's skip chapter 3. Uh verse number one, Jonah chapter 3. The"],["33.28","word of the Lord came to Jonah the second time, saying, \"Arise, go to"],["38.32","Nineveh, that great city. Preached to it the message that I tell you.\""],["45.04","In chapter 1, the word of the Lord came to Jonah, and Jonah rejected it. So, the"],["50.48","Lord sent a storm. Jonah was thrown overboard."],["55.76","The Lord stopped the storm. Jonah's drowning. The Lord sends a fish. Verse"],["62.079","number 10, we learned in chapter 2 that the Lord spoke to the fish. And after"],["67.52","three days in Jonah repenting, the fish what? Vomited Jonah up. Later on, we're"],["73.92","going to see in chapter 4 that the Lord causes a plant to grow to give Jonah shade. But then the Lord sends a worm to"],["81.68","kill the plant. The sea, the fish, the plant, the worm,"],["88.479","all do immediately what God tells them to do. This theme showcases God's"],["94.64","sovereignty over all of creation. And Jonah even testified to that in chapter 1:9. He said to them, \"I'm a Hebrew. I"],["102.4","fear the Lord, the God of heaven, who made the sea and the dry land.\" Everything does exactly what God tells"],["109.759","it to do in this book except Jonah, the son of Abraham, the chosen"],["116.32","people, the prophet of the Lord. He is the only person in the book who does not obey God. What does that tell us?"],["126.24","So often we rage against the heathen and the culture and the wicked people who"],["132.72","are doing wicked things and the godless and their ungodliness. And yet how often"],["138.72","do we the children of God disobey the word of the Lord."],["145.04","Two weeks ago we talked about how powerful the word of God is the most powerful force. And yet Jonah rejected"],["152.4","it. How is that possible? I would submit to you that the in this book the sea,"],["158.959","the fish, the plant and the worm do not have mind, will and emotion."],["167.12","They are not made in the image and likeness of God. Thus, they do not have the capacity to do anything other than"],["173.68","what God tells them to do. But because man, mankind has been made in the image"],["180.08","of God, we have mind, will, and emotions. We think about the word of God and we think"],["186.72","about how it makes us feel and then we decide. We choose to accept or reject"],["193.12","it. And while this makes us the most like God in all of the physical universe, we have this special"],["199.92","privilege. It also presents the greatest challenge of peril. Our free will is the"],["206.159","greatest threat that we face because we can stand against the greatest force and"],["211.519","say no. The storm, the fish, the worm, the plant, if they would could reason, they"],["218.64","would ask us this question. Why would you do that? Why would you question the word of God? How could you dare to tell"],["225.519","God no? And the simple answer is"],["231.28","pride. Somehow someway we reason that we know better, that we have better ideas, or"],["238.799","maybe we just need to think about it and we're not sure if we have more details and more facts and more information."],["244.64","Once we have all that, we can understand and then we can agree with God."],["250.879","It's very interesting when Jesus how he responded to his disciples in Matthew chapter 18. They were asking who's the"],["257.519","greatest in the kingdom of heaven and Jesus said bring a little ch child here. And they brought a little child and he"],["263.199","put them in the midst. And he says, I say to you, unless you convert and become like a"],["269.52","little child, you will not enter the kingdom of heaven. Whoever humbles himself as a little child is the"],["277.36","greatest in the kingdom of heaven. And again, in Mark's gospel, assuredly I say to you, whoever does not receive the"],["284.4","kingdom as a little child will not enter it. I came to Jesus as a little child. I was"],["291.84","told I was a sinner and that meant I was doomed to hell. But Jesus had died for my sins and if I prayed and asked him to"],["298.8","forgive me, he would give me eternal life. And I reasoned, well, hell doesn't sound that good. Heaven sounds really"],["306.56","good. I better pray to Jesus. I did not stop to ask, okay, but how do we know"],["313.68","there's a God or if heaven and hell are real? What evidence do we have to prove"],["319.199","these things? I didn't even think any of that was necessary because when you are a six-year-old child,"],["324.88","you believe what people tell you very easily. You know, you're small and weak and not that smart."],["331.12","When I was a child, my dad was the strongest, smartest person I knew."],["336.479","Whatever he said, that was facts. And whatever he told me to do, that's what I was supposed to do. One day I was like 5"],["343.68","years old and uh I was outside and I was looking at the screen door and it was"],["350.8","like a frost on it and this is winter time and so I'm like that looks like ice"],["357.28","cream and I said I'm going to lick the screen door. So I ran my tongue along"],["363.039","that screen door and what happened? My tongue got stuck through the screen"],["369.12","door. So, I'm now heading there with my tongue on the screen door and I'm freaking out and uh I start I start"],["375.6","yelling, but when you're t stuck on a screen door, it's not much of a yell. It's more of a"],["381.52","and that's what I was doing. I was standing there 5 years old stuck to a screen door. Has anybody done this? Anyone? Northern climate people. If"],["388.639","you're from the south, you don't know what I'm talking about. I'm stuck to the screen door. And my"],["393.759","dad's walking by and he sees and he's like, \"Oh, the kid stuck on the screen door.\" So, he uh immediately jumps into action. And he yells to my mother, \"Get"],["400.16","some hot water.\" And then he comes and he's trying to open the door to get to me, but I'm stuck through it. He's like,"],["405.6","you know, push me back. And he gets out and then he gets right up by my tongue and he spits on my tongue two times like"],["412.479","that. And immediately my tongue comes off the door. And uh"],["418.08","he says to me, \"Uh, yeah, don't lick screen doors."],["423.84","Your tongue will stick to it.\" And I thought, \"This man's brilliant."],["429.36","He knows stuff like how to unstuck your tongue off a screen door. I should"],["435.28","listen to this guy. Jesus says that's what it takes to enter"],["440.72","the kingdom of God. The humility, the willingness to trust and obey what God"],["446.08","is saying, our heavenly father. Just like the storm does, the fish, the plant, the worm. God says do this and"],["453.36","then they do it. But, you know, I got a little older, no longer five, and uh I"],["459.44","learned not to lick screen doors. So, I kind of got that down. And uh you know, your father says, \"Well, do this and"],["465.28","don't do that.\" But, you know, you want to do it anyways. And you think in this scenario, you know, his words aren't"],["470.639","really relevant. They're not necessary. I can figure this stuff out for myself. After all, dads aren't perfect and"],["476.8","they're not always right. And sometimes they're wrong. And you start to realize a lot of people are wrong about all kinds of things. And you probably"],["483.12","shouldn't just follow people blindly, whatever they tell you. And that becomes"],["488.24","an important quality in your life. It's called discernment. Gaining facts and"],["493.36","wisdom before jumping to conclusions. And uh we learn to trust ourselves more"],["498.479","than we trust what people tell us, more than what our parents tell us. But that doesn't work when it comes to"],["505.36","God. Actually, the childlike humility and faith is the best course of action"],["510.8","when it comes to responding to the word of God. And Jonah is learning this the"],["516.479","hard way. Are you? The word of the Lord comes to Jonah a second time. It says here,"],["525.68","and you know what else that tells us? What does that illustrate?"],["531.2","God's patience, his grace. We disobey and we sin and we doom"],["538.399","ourselves to destruction and yet he keeps saving us and forgiving us over"],["544","and over and over. He puts us back on our feet. He puts us on solid ground and he speaks to us again. Jonah gets spit"],["550.8","out by the fish, put on solid ground, and God gives him a second chance."],["556.64","There was this old fella come to church. This was years ago. Uh his wife was a believer and uh he he liked being in"],["562.72","church. She liked being around church people. And he would listen very carefully to my sermons. But he did not"],["568","believe in God. He didn't believe in in anything that uh about God. He was an atheist, he said. And he would enjoy"],["574.72","writing me letters arguing with me. He'd write me a long dissertation about my sermons and send it to me. And uh he"],["582.64","would come into the office, make an appointment with me, and then we'd sit there and uh he would tell me his life"],["587.92","story and about all of his reasons why he didn't believe. And we would have debates and discussions about the"],["593.839","information. And uh you know, no matter what answers I gave him, no matter what theology I tried to explain to him, no"],["599.68","matter how I answered his questions, I never swayed him from his stubborn belief. And to be honest, I kind of just"],["606.8","gave up on him believing. It's like he had all the information and he just straight up rejected it. He got real"],["612.56","sick and he passed away. And I thought, \"Oh, that's sad cuz now he's going to suffer for all of eternity.\" I gave him"],["618.88","my best shot to try to convince him, but he was just too stubborn to listen. Then"],["624.24","I got word that in the last three weeks of his life when he was in hospice, his"],["629.68","sister took him into her home and cared for him and she was a Christian and she had led him to faith in the final three"],["636.56","weeks of his life. And the Lord says to me, he said, \"See, Rob, don't ever give up on anyone. You never know when"],["644.24","somebody will turn to me.\" God is so much more patient with people than I am."],["649.68","God's patient with Nineveh. And we learned what kind of people they were, what kind of a cruel culture. Remember"],["655.519","that they would, you know, they would just cut their enemies heads off and cut their ears off, nose off, and burn people at the stake and they would just"],["661.92","pile heads up on pikes. They were brutal and violent. Jonah had no desire for those people to get saved. But God did."],["670.24","And he was patient with Nineveh. and he was patient with Jonah. So let's see"],["676.88","what Jonah did. Jonah gets the message, arise, go to Nineveh. Verse three, Jonah arose and went to"],["684.64","Nineveh according to the word of the Lord. Now Nineveh was an exceedingly great city, a three-day journey in"],["691.04","extent. Jonah began to enter the city on the first day walk. Then he cried out"],["696.24","and said, \"Yet 40 days and Nineveh will be overthrown.\""],["702.079","The people of Nineveh believed God, proclaimed a fast, put on sackcloth from the greatest to least. The word came to"],["709.279","the king of Nineveh, and he arose from his throne, laid aside his robe, covered"],["714.72","himself in sackcloth, and sat in ashes, and he caused it to be proclaimed and published throughout Nineveh by the"],["720.64","decree of the king and the noble, saying, \"Let neither man nor beast, herd"],["726.32","nor flock, taste anything. Do not let them eat or drink water, but let man and"],["731.519","beast be covered with sackcloth and cry mightily to God. Yes, let everyone turn"],["736.959","from his wicked way, from his violence that is in his hands. Who can tell if God will turn and relent and turn away"],["744.48","from his fierce anger so that we may not perish? And God saw their works that they turn"],["751.6","from their evil ways. And God relented from the disaster that he said said he would bring upon them. and he didn't do"],["758.8","it. So we see here in verse number four and"],["764.399","five that Jonah enters the city and delivers the message. 40 days Nineveh"],["772.639","will be overthrown. And so it's a interesting detail."],["777.92","Nineveh is very big and it takes three days to journey through it. And Jonah reasons,"],["784.399","well that's the scope of my assignment. I go to Nineveh and I deliver this message. I walk through it. I preach the"],["791.6","gospel and I'm done. That's my job. Three days, that's it. And he gets right"],["797.92","to it. So he goes in there and once first day, 40 days Nineveh will be"],["803.839","overthrown. That's the sermon. Not that long. Very to the point."],["810.399","Ever listened to someone preach a sermon for like 45 minutes and thought, \"Well, you could have said that in 10, kind of"],["816.399","dragged that out.\" I know what you're thinking. You're thinking, \"Well, yeah, kind of every Sunday, Pastor Rob, you know, could speed it up.\""],["824.079","Since I I I grew up in church, I I've heard many boring sermons. So I'm I'm"],["829.519","kind of mindful of the fact that there are people here like me, short attention spans. Uh there's children in the"],["836.72","service and they are as much the audience as you know the 40 to 60 year old people. Uh the kiddos are here. I"],["844.959","got to keep their attention and it has to be relevant to the children what I'm saying as much as it is to moms and"],["850.88","dads. And that's challenging to be relevant to a wide range of ages. But you know what? People of all ages seem"],["857.04","to endure, seem to enjoy stories,"],["862.32","illustrations, talking about your tongue being stuck on screen door."],["868.639","Illustrations and to the point relevant facts. Give them the ra the facts in a"],["874.72","relatable story. Remember who was really good at that? Jesus. That's how he taught, wasn't he?"],["880.399","But regardless of the ability of the preacher, more important than the talent of the orator, what really makes"],["887.12","preaching effective is in fact the work of the Holy Spirit. We can deduce from"],["893.6","narrative passages in scripture that God at different times had divine"],["898.959","appointments set up with people that they were ready to hear the message that God sent them. We think about in Acts"],["906","chapter 16 where uh Paul was trying to go into Asia with the gospel. But then"],["912.48","the spirit withheld him from going uh into Asia and then he got a dream in the"],["917.6","middle of the night from a man in Macedonia saying come to Macedonia and help us. And he deduced from that vision"],["923.6","that God wanted him to go to Europe to Greece to take the gospel. And likewise,"],["929.68","you remember the story of the apostle Philip where he was uh sent by God to"],["935.199","the wilderness to visit one man that Ethiopian uh to share the gospel with"],["940.56","him. The Lord was very specific about where he wanted his servants to go. And when the disciples listened, the people"],["947.199","would receive the word. And God likewise had Nineveh ready to receive his word."],["953.36","And it says on the first day that Jonah cried out day one people believed. There"],["959.759","was no bridges, no built no cult cultural sensitivity training, no"],["966.16","language studies or years of breaking up rocky soil. Just day one, 40 days and"],["973.04","it'll be destroyed. Everyone revival. Everyone just just cried out to God for"],["979.04","repentance. Wouldn't that be nice? Wouldn't that be nice? CF you you start the Bible club there day one and all the"],["985.839","children just hey believe in Jesus' be great uh whatever ministry you're doing."],["992.16","Yeah. Why doesn't that happen? What God wants us to be light and take the"],["997.6","gospel, you know, you preach up here every week and people sit there and reject me the message. Why? Why do we"],["1003.44","have to toil for years in ministry and maybe not see anyone believe in Jesus? Well, it's because what happens here"],["1010.32","with Nineveh, that's a miracle. That's not the norm. Uh you remember the prophet Jeremiah, he didn't have that"],["1017.44","experience. Actually, everybody tried to kill him. He preached and everybody's like, \"Let's kill that guy.\" Uh Isaiah,"],["1023.36","he preached for 30 years, but he was the prophet. And what happened to him? They"],["1028.799","cut him in half, right? They saw him in two and that's how they took care of him. So, we have to remember that these"],["1034.319","narrative passages of scripture with the miracles, they're not telling us what will happen. You know, go down to the"],["1040.72","river and pray like Joshua and the and the PTOIC will spread will split in two. You know, go down there and pray and"],["1047.039","nothing happens. And God's like, well, I didn't tell you to do that. That's why nothing happens. I told Joshua to do"],["1053.28","that, Rob. I didn't tell you to do that. At the river baptism last Sunday, we uh we we get down there and we had uh 10"],["1060.72","people got baptized in the river. It's really cool. But we had a um we had a a a plague of jellyfish."],["1068.16","I I got down there and I looked and this is like jellyfish everywhere. And I I"],["1073.28","turned to Pastor Mark, super spiritual guy, and I says, \"Mark, pray uh that the"],["1080.64","Lord will get these jellyfish out of here so we can have a baptism and open us in prayer.\" So Mark prays, very"],["1085.919","eloquent, very, you know, very spiritledd. And we say, \"Amen.\" And I looked out and the jellyfish are still"],["1091.039","there. So I got to have a conversation with Mark and his relationship with Jesus."],["1100.72","So I just, you know, I did uh plan two. I just pushed them out of the way. I I"],["1106.32","got in the water, kicked jellyfish, and then hustled somebody in and dunked them in the water and got them out. And uh"],["1112.24","most people didn't get stung. A couple people got stung, but we survived it. It was a great time. highly recommend river"],["1119.12","baptisms when there's no jellyfish."],["1125.52","God didn't even tell Jonah Nineveh was going to repent."],["1132.24","He just said, \"Go preach this message.\""],["1137.36","Wasn't Jonah's job to save Nineveh. It was his job to preach the message that"],["1143.12","God gave them. And the same's true for us. What's our job? is to go into all the world and preach the gospel. It's"],["1150.08","not our job to save anyone. Parents, it's not your job to save your children. You you train them up, you"],["1157.52","lead them, they have to decide. That's God's responsibility to speak to them."],["1162.64","And I've always been somewhat baffled by the notion of church growth strategies because, you know, there's always like"],["1168.16","conferences and books you can read, podcasts you listen to, and there's methods and there's ministry programs"],["1173.919","that will help you grow your church. One time uh they said, \"Hey, we're going to do the the this company called they"],["1179.36","said, \"We do these mailouts advertising your church to your community and uh you you we'll we'll send all these mailouts"],["1185.36","to the area and then all these people will hear about your church and they'll come to the church.\" And this is when we were over in the little church uh"],["1191.6","building and I I says to her, um that's great, but we got so many people showing up right now, I can't assimilate them"],["1197.52","fast enough. So, if we do a big mail out uh and more people show up, we we won't"],["1203.12","have any place for them. So, and then she says to me, \"Well, it won't be that effective anyways.\" And then I was like, \"So, so why would we do it? You want me"],["1211.44","to buy this program, but then you tell me it's like you can't have it both ways.\" So, anyways, we have all these"],["1217.28","programs uh that they say, \"Oh, this will grow your church.\" But I always thought that Paul had explained to us"],["1224","how church growth happens. 1 Corinthians chapter 3:5, who then is Paul or who is Apollos? just"],["1232","ministers through whom you believed as the Lord has gave to each one. Paul"],["1238.08","said, \"I planted a pulse water, but who gave the increase?\" God. So neither is"],["1244","he who plants anything or he who waters, but is God who gives the increase. And"],["1249.52","that has been basically our strategy for church growth here at Faith Bible"],["1254.64","Church. And I shared back with the elders when I first came on 2007, I"],["1259.919","interviewed for the position. And I said, \"Here's my here's my big master plan for what we're going to do as a"],["1265.2","church.\" Acts 2:42, we're going to continue in the apostles. Doctrine, prayer, breaking"],["1274.159","of bread, and fellowship. That's what was prescribed in Acts for the church. That's what they did. And"],["1281.6","that's what you have to do to have church. You got to have the doctrine, teaching the word of God. We need to be prayer. We need to have communion,"],["1289.28","remembering or proclaiming the Lord's death till he comes. And we need to have"],["1294.559","fellowship. And I've always used that analogy of a plant's growth. Plants are"],["1303.2","living organisms created by God, created to grow. And when they have the proper"],["1308.72","balance of what? water, soil,"],["1316.159","sunlight, and what's the fourth? You breathe on them. You go talk to your plants. Carbon,"],["1322.559","right? You get that carbon in them. That's this is biology, right? I'm teaching you biology. Those four things"],["1327.919","in their proper amount based on the type of plant and the habitat that it's in, it will grow because it is created to."],["1333.36","And the same is true for churches. Jesus is the cornerstone, the foundation of the church. And he said the gates of"],["1339.6","hell will not prevail prevail against my church. He died and he shed his blood"],["1345.039","for the church. It's God's will for it to grow. And what a church needs to grow"],["1350.159","is the improper amount of doctrine and prayers and breaking of bread and"],["1356.48","fellowship. That's why you have to come to the church picnic and eat some fried chicken with us because that's what God"],["1361.76","wants you to do. And those are the basic elements that you have in order to grow. And so when someone comes along and they"],["1369.039","says, well, you know, we need this program, you know, we need, you know, we need better coffee and donuts and we"],["1375.28","need this style of music and we need to change our branding. Uh those are good ideas, but that's not the main thing. If"],["1383.2","you make that the main thing, but you neglect the four basics, you're not"],["1388.32","going to grow. And even if you do the four basics, you might only grow a little."],["1396.799","Might only grow a little. Most of the land mass in Canada up north is covered"],["1402.48","by tundra. You know what tundra is? It's it's just a you travel far enough north"],["1408.559","and you get to what's called the tree line. And the tree line is where trees stop growing. There's no trees after"],["1413.919","that. And there's just this mossy plant, very small and very thin. But it covers"],["1420.4","all everything. It's just all over northern Canada. And that's the only thing that can live up there. But it can"],["1429.28","live up there and it thrives and uh it doesn't get big like redwood trees in"],["1435.76","California, but it can survive in that environment. Little small plant. Not"],["1442","everything God created is supposed to grow to be a massive redwood tree. And I"],["1448.559","I remind people when they start new ministries, they'll plan an event and they're like, \"I'm going to announce my"],["1454.08","event at um the congregation on Sunday morning, you know, there's like 600 people here uh between the two services"],["1460.559","and they'll be all excited about their event.\" And then five people will show up and they'll be like, \"Well, a church"],["1466.32","of this size, I thought it would be a bigger crowd, pastor.\" And I'm always having this conversation. I said, \"A big"],["1471.679","crowd is not the goal, especially when you're first starting something.\" Actually, a big crowd can be a problem."],["1478.72","You want to build slowly so that you're caring for people, you're meeting needs,"],["1484.48","establishing the proper philosophies of ministry, and installing the right"],["1490","leaders into the positions, trusting that the Lord gives the increase when he"],["1496.96","feels you're ready for it and you can handle it. So, day one, the people hear Jonah's message and everyone repents."],["1505.12","Verse number six, the word came to the king of Nineveh. He rose up, laid aside his robe, covered himself with"],["1510.4","sackcloth, sat in the ashes, because that was the uh in in antiquities, that's the way they showed mourning."],["1516.24","They would take off their fancy clothes and put on some old sackcloth, and then they just dump ashes on their head. And"],["1522.799","that was the way to say, uh, I'm mourning. I'm grieving. Uh, I'm very sad about something. I'm repenting. So"],["1529.76","that's what the king did. And he said to everyone else in Nineveh, he said, \"Let"],["1535.279","man nor beast, nor herd, nor flock taste anything. Don't let them eat or drink water. Let man and beast be covered in"],["1541.12","sackcloth. Cry mightily to God. Yet everyone turn from their evil way and"],["1547.039","the violence of their hands. Who could tell that God will turn and relent and turn away from his fierce anger so that"],["1553.52","we will not perish?\" Now, that is amazing. Getting people to"],["1560","repent of their sin is one thing. Getting a king to repent. That that was"],["1566.4","always the problem with Israel. Uh you remember Jesus, he got the people, he got the crowds, he got the average the"],["1573.2","average citizen was ready to receive him as Messiah. But who wouldn't buy in?"],["1579.279","It was the high priest. The religious leaders, Herod, King Herod. But Herod"],["1585.039","wasn't technically the ruler, right? He was just a puppet king installed by the empire of Rome. It was the high priest"],["1591.76","who was the real power in the nation and they wouldn't repent. The message that they needed to repent, that was"],["1597.84","offensive to them. And that was true for Israel in the Old Testament as well, the"],["1603.279","the kings and the royal courts, the the the prophets would bring the word of the Lord and they would reject the word of"],["1609.279","the Lord. And when Israel had a good king like Josiah or Hezekiah, uh the"],["1615.76","king would be humble and submit to the word of the Lord and then the whole land would experience a spiritual renewal and"],["1621.84","then uh the whole land would be spared and they'd be prosperous. But the northern kingdom of of Israel, the 10"],["1627.52","northern tribes, they never had one good king in all their history. And uh that's why they were just destroyed and uh they"],["1634.32","never listened to the prophet. They were just arrogance. But here we"],["1639.52","have this king of this most powerful evil empire, the Assyrian Empire, and"],["1646.559","he's leading his people to repentance. And he even understands what the issue"],["1652.08","is. What did he say? He said, \"Let everyone turn, verse 8,"],["1657.919","from their evil way and from the violence that is in his hand.\" So he's admitting the fact we're evil and we're"],["1664.48","violent people. Like we already talked about, they we saw the history of the Assyrians. They"],["1671.039","were very very uh wicked. And the king knows what the issue is. And that astounds me because when I hear our"],["1677.279","nation's leaders talk, there there seems to be no real understanding of what the"],["1682.72","core root problems of America are. Right? We talk about the symptoms and then we talk about some ideas how to"],["1688.799","treat the symptoms, but we never get to the root of the problem. Right? the the the the the issue for America, it's not"],["1696.559","our economy. It's not crime or budgets or borders. The main issue is spiritual"],["1704.64","blindness. Americans are on this broad road leading to destruction. And Jesus"],["1710.72","is offering this narrow way that leads to everlasting life. And I just wish, you know, the leaders could figure that"],["1717.84","out and humble and repent and they would turn to Jesus and set that example for"],["1724.399","our nation. But what about us? All well and good to DC. We can't do anything about DC, but what about us? What about"],["1730.72","our homes? What about our families? Do we know what the root problems are? Oh,"],["1736.96","the kids are rebellious. That's the problem. It's these children. Okay. So,"],["1742.399","what's the home life like? I had this friend growing up. He was like super edgy kid. Always had an attitude. He was"],["1748.399","moody, very critical about everything. Hated church, hated school, you know,"],["1754","always arguing. He just make fun of everyone. Just not a nice, kind, peaceful guy. And uh one day I was over"],["1761.12","visiting their house. He was a neighbor. So, I would go over his house and uh him and his sister, they started fighting."],["1767.52","They were yelling at each other. And then their mom started yelling at them."],["1772.799","And uh he started yelling back at his mom. And I was like,"],["1779.36","\"He's going to die."],["1785.2","Pray for him.\" But nothing happened. He yelled at his mom and his mom yelled back and the"],["1791.36","sister yelled more and the dad came in and he yelled at everyone. And I realized that these people just yell at"],["1796.96","each other all the time about everything. Not a bit of wonder he's such a cranky, edgy guy. He's raised in"],["1802.159","this just negative, fighting, edgy environment. That wasn't my home. We did"],["1810.24","not yell at mom and dad. I wasn't yelled at all day long. If I was disobedient,"],["1815.44","there would be seriousness and there would be words and I would be reprimanded. But there was no arguing about anything. There's no yelling about"],["1822.08","it. If I ever yelled at my father, I had just been, you know, knocked into next week and be dead and that would have"],["1829.2","been the end of it. We had very clear, consistent boundaries in our home and I knew where the line was and what was"],["1836.24","tolerated and not tolerated and I wouldn't cross it and that consistency created harmony and peace in our home."],["1843.84","My friend did not have that environment and uh we have to figure out what is the root problems in our homes. Hey, Dad."],["1852.48","Are you modeling the fruit of the spirit? Are you leading in love or are"],["1860","we leading in anger and fear? We can't gloss over that. Everything rises and"],["1866.64","falls on leadership. If the leader won't lead in humility, if all we're doing is"],["1872.399","personifying pride and arrogance, nothing's ever going to change."],["1878.399","Now, you would have expected the king of the nation of Israel to may able to get on board with those ideas. Likewise,"],["1884.799","we'd expect Christian parents who are maybe spiritual leaders, maybe ministry"],["1890.48","leaders, maybe church leaders that they too could quickly assume the position of humility and deal honestly with sin and"],["1898.32","be a leader in admitting wrongs, be a leader at asking forgiveness for"],["1904","offenses that they have perpetrated. I mean, if the pagan, wicked, idol"],["1909.279","worshshiping king of Assyria can see the root problem, surely the spiritfilled children of God could respond"],["1915.679","appropriately, shouldn't we? Uh, another story for you. Uh, years"],["1923.76","back, and some of you remember this fellow, we had an elder who was a former master chief in the Navy, and most of"],["1931.44","his leadership style was rooted in that military mindset. I have a rank and I'm"],["1936.48","in charge and I bark orders and people do what I tell them to do. And while he"],["1941.6","was a phenomenal worker and a a eager servant to our church, he also was like"],["1947.12","quick to speak and was kind of loud and very opinionated. And from time to time"],["1953.44","he would offend people with that tone and people would come to me and say, \"Well, Elder so and so, he said this and"],["1960.24","he acted that way and that kind of offended me.\" And I would say, well, Matthew chapter 18 tells us how to deal"],["1966.799","with offenses. So, uh, it says, if your brother offends you, first you go to him, you tell him what he's done, and if"],["1974.64","he hears you, and he is humble, then great, problem solved. But if he"],["1980.24","doesn't, then come get me. And that's the next step. And the second step is, I'll go with you and we will revisit the"],["1986.32","offense. And they just looked at me like, \"So, you want me to go to Elder"],["1991.919","soandso and confront him on his edgy tone?\" And I'm like, \"Yeah, that's the"],["1997.6","biblical model.\" And they go and the elder would yell at them and kick them"],["2003.84","out of the church. No, he would he would hear them and he would say, \"Oh, yeah,"],["2009.6","okay. I see your point. I wasn't trying to be offensive. I'm sorry. I came across abrasive.\" And then they would be"],["2015.519","fine. and they come back and tell me, \"Yeah, he was great and it was fine.\" And uh they would tell him that, \"Well,"],["2021.679","you know, I was a little nervous, but Pastor Rob told me to go and talk to you oneon- one.\" And and and he's like,"],["2026.72","\"Okay.\" And then that happened again. And by the second time that happened, he came into my office. He says to me, \"You"],["2032.64","know, I would really appreciate it if you'd give me a heads up when you're someone to address me with that they're"],["2038.08","offended with me.\" And I said, \"No, I can't do that.\" And here's why. As an elder, a spiritual leader, you have to"],["2044.32","be able to showcase a spiritfilled servant response to someone. You have to"],["2049.599","be able to reply with humility and grace without being prompted by me. You have"],["2054.639","to have the character qualifications to be an elder, to respond in a Christlike manner to people in real time. But if"],["2062.079","you can't, then you're not qualified to be a spiritual leader. And I need you to"],["2067.119","respond with humility because that's who you truly are. He said, \"Oh, okay. That"],["2072.399","makes sense.\" And he was a wonderful servant who did a great job caring for the people of our"],["2078.24","church, but he was always in Master Chief mode. Does that make sense?"],["2083.839","Jonah, the prophet of the Lord, was outclassed in obedience"],["2088.879","by the sea, a fish, plant, and a worm."],["2095.52","He wouldn't listen to the word of the Lord and it cost him. The people he thought were so evil and deserving of"],["2101.44","God's wrath, even they responded appropriately to the word of the Lord."],["2107.119","So, who are you more like? And if you really want an honest answer on that question, give your family"],["2114.56","permission to answer it. Let your spouse and your kids tell you"],["2121.359","what they're seeing and hearing from you. Do they think you are humble, kind,"],["2128.72","patient? Now, the good news is if you're bombing at that, you can fix it. Humility and"],["2135.68","repentance results in a lot of grace and love real fast with people. Verse number"],["2141.28","10, God saw their works. They turned from their evil ways. And God relented from"],["2148.16","the disaster that he had said he would bring upon them, and he did not do it. God always wants to forgive and restore."],["2154.64","It's who he is. And Jonah knows that and even complains about that. He said in chap chapter 4:2, he said, 'Lord, wasn't"],["2161.839","this what I said when we were still in our country? I fled to Tarsus cuz I know you are so gracious and merciful and"],["2167.359","slow to anger, abundant and loving kindness, one who relents from doing"],["2172.48","harm. That's who God is. And that's what he wants us to model. He wants us to be"],["2179.52","shaped, molded and shaped to be like him. He wants us to be agents of mercy"],["2184.96","and grace with each other, with our families, with our brothers and sisters in Christ, and with our"],["2192.8","lost, needy neighbors in our community, our country,"],["2199.119","the people who are doomed to suffer the wraths of God. God wants to be at peace with them. And Jesus came to die for"],["2205.92","them. And it's our job to share that message and to shine that hope to them."],["2214.079","Will you practice the humility obedience to show everyone what it's supposed to"],["2219.44","look like? Well, Jonah said he would. We'll find out next week if he if he was"],["2226.32","able to keep that spirit. So, come back and we will wrap up the book of Jonah next week. Lord, we just pray thanking"],["2233.359","you for this prophet and the lessons that he learned and the lessons that it"],["2239.119","teaches us about how to uh be obedient to you and how to yield. What's the"],["2246.24","appropriate response to a powerful God to yield and listen and humble and Lord"],["2252.64","that you will use us? You can use our our attitudes and our obedience to reach"],["2258.4","needy, hurting people who you love, who you died for, who you want to see saved."],["2263.599","Lord, we pray for salvation of each and every heart here. We pray for us to be a light into our community, into our"],["2270.56","schools as we go back to school, into our workplaces, in our homes, Lord, that"],["2276.24","we could just be a light to the nation. We pray this in Jesus name. Amen."]]},{"id":"tbwHlrCi6ec","name":"2025-08-17  God's Salvation Through the Storm (Pastor Rob McNutt)","date":"2025-08-17","transcript":[["21.52","uh we are in Jonah. Uh we're going to do two chapters. Shocking, eh? Well, we did"],["29.439","three verses last week, so we got to get on the gas. But uh Jonah chapter one, uh"],["34.96","the word of the Lord came from came to Jonah, the son of Amatile, saying, \"Arise, go to Nineveh,"],["43.2","that great city, and cry out against it, for their wickedness has come up before me.\" Jonah arose to flee to Tarsus from"],["50.879","the presence of the Lord. He went down to Japa, found a ship going to Tarsus. He paid the fair, and he went down into"],["57.039","it to go with them to Tarsus from the presence of the Lord. Jonah's not"],["62.8","interested in preaching repentance to Nineveh because Assyrians, according to him, it should be destroyed. And the"],["69.119","funny thing is they were the Assyrian Empire crumbled and was lost to the"],["74.24","winds of time around 600 BC 140 years after Jonah. God would be true to his"],["81.52","word to judge them. He would deal with their wickedness in his time. So the"],["87.92","book of Jonah, the message of Jonah, in my personal opinion, is it for Nineveh? Because the Ninevites know nothing of"],["94.4","Jonah's interaction with God and the dialogue that we are going to be studying. And even Jonah himself, is it"],["101.2","really for him? I think the book's for us. the message,"],["106.32","the actions, reactions, the things that Jonah does, how God responds. These"],["111.36","things are happening 2,800 years ago, but the lessons are clearly relevant for us today. It's to teach us about the"],["118.96","character of God and to see how he is at work, always working, never stops"],["124.88","working. Jonah heads to Tarsus, which is the opposite direction of Assyria."],["131.76","It's in Spain. Actually, that's where I and I will be heading in a couple of"],["136.8","weeks. We are going back to Spain for the last two summers. We've been teaching at the Chrisar Thrive Missions"],["144.08","Conference. Our missionaries Dan and Carrie and our Chrisar directors"],["149.12","overseeing missionaries from all over Europe and Asia. And their headquarters is in Malaga, Spain. and they've had"],["156.16","this conference for the missionaries to come to to be ministered to some training, some counseling and time in"],["162.64","the word to get refreshed. But the missions directors in Malaga, Dan and Carrie, plus their team, Peter and"],["169.2","Melody, and also Brian and Jennifer Lucas, who we support, the Lucas' as well, they planted a church in that"],["176.4","city, and they all take turns preaching uh every Saturday night at the church."],["182.159","They services are at Saturday night. So they're leading the global ministry, but they're also building this church. So"],["187.599","what they asked is if we could come over and I would just pastor the church and preach for a month so that they could"],["194.48","just kind of sit under that and get refreshed and they don't have to do any"],["199.68","work in the church. So we prayed about that and we talked to the elders and Faith Bible Church agreed to send"],["205.44","Elelliana and I back to Spain to minister to our missionaries. Also, the"],["210.64","missionaries serve at a refugee center and they have asked Elelliana to provide some trauma counseling for the refugees"],["217.84","coming from Africa who have suffered tremendously. So, we'll be gone for the month of September and I'm planning to"],["225.44","finish this book of Jonah before we go. So, Jonah was traveling to Spain just"],["231.519","like us. Tarsus is on the other side of the pillars of Hercules outside of the"],["237.28","Mediterranean Sea right there on the edge of the Atlantic Ocean. And uh for"],["242.64","all intents and purposes, Tarsus would be considered the end of the world for Jonah. Sometimes we pray, Lord, I'll go"],["249.28","to the ends of the earth if you ask me. Jonah goes to the ends of the earth to escape God's calling to get away from"],["256.959","the presence of the Lord. But he should have read what Daniel or what David said in Psalms 139 where David said, \"Where"],["264.8","can I go from your spirit? Where can I flee from your presence?\" If I send to"],["270.24","heaven, well, you're there. If I make my bed in hell, you are there. If I take the winds of the morning and dwell in"],["276.16","the uttermost parts of the sea, even there your hand shall lead me. Your"],["281.6","right hand shall hold me fast. If I say surely the darkness will fall on me,"],["286.639","even the night will be light about me. Even the darkness shall not hide me from"],["291.68","you. The night shines as the day, the darkness is light. Both are alike to"],["297.52","you, oh God. So God's in Tarses, and God's on the Mediterranean Sea, and God"],["303.04","is in St. Mary's County. And God is always with us. Even in our darkest hour, our rebellious stages, God is"],["310.56","there, and he's working. Elelliana and I went to see uh Debbie on"],["316.24","Friday. Praying for Debbie. She's trying to recover from v variety of ailments. She'd be watching online. She text last"],["323.44","week and said, \"Pastor Rob's looking exceptionally fidgety today.\""],["328.479","I get heckled from the online audience. It's great. I don't know how I did today, but I'm sure we'll get a progress"],["333.68","report from Debbie later on. So, Debbiey's in the hospital and u you know what she does all with all this time?"],["339.759","She's in there a lot. You know what she's always doing? She talks to the staff about Jesus. She"],["345.28","shares the love of God. Is it hard being in the hospital? Would people sooner be"],["350.639","home and not in the hospital? Right? But her mindset is, well, God has me here"],["356.4","for a reason, so let me just try to help these people. That's a good perspective, isn't it? No matter where we are, God is always"],["363.44","with us in all of these situations. But some people think because they of the way they've been living, maybe they've"],["370.08","been out of church or or they've gotten pulled into some bad habits be because of their sin and rebellion that God's no"],["376.479","longer with them and God can't use them. God can always use you because you're"],["383.199","never away from him. So watch this. Watch what happens here. Verse number four. So Jonah goes in the boat. He's"],["390.72","going to Tarsus across the Mediterranean. But the Lord set out a great wind on the sea, and there was a"],["396.08","mighty tempest on the sea, so that the ship was about to be broken up. Then the mariners were afraid, and every man"],["402","cried out to his God, and threw the cargo that was in the ship into the sea to lighten the load. But Jonah, he he"],["408.4","had gone down into the lowest part of the ship and was fast asleep. And the captain came to him and said, \"What do"],["414.8","you mean sleeping? Arise, call on your God. Perhaps your God will consider us so that we may not perish.\" And they"],["421.759","said to one another, \"Come, let's cast lots and see that we may know for whose"],["427.039","cause this trouble has come upon us.\" So they cast their lots and it fell on Jonah. Then they said to him, \"Please"],["432.56","tell us, for whose cause is this trouble upon us? What is your occupation? Where do you come from? What's your country?"],["439.12","And what people are you?\" So he said to them, \"I'm a Hebrew. I"],["444.56","fear the Lord, the God of heaven, who made the sea and the dry land.\" And then"],["449.919","the men were exceedingly afraid and said to him, \"Why have you done this?\" For the men knew that he fled from the"],["455.919","presence of the Lord because he told them. Then they said to him, \"What shall we do to you that the sea may be calm"],["462.16","for us? For the sea was growing more temptuous.\" And he said to them, \"Pick me up and"],["467.84","throw me into the sea. Then the sea will be calm for you, for I know that this great tempest is because of me.\" Nevertheless, the men rode hard to"],["474.8","return to the land, but they could not, for the sea continually to grow more temptuous against them. Therefore, they"],["481.039","cried out to the Lord, and they said, \"We pray, oh Lord, please do not let us perish for this man's life. Do not"],["488","charge us with innocent blood, for you, oh Lord, have done as it pleased you.\" So they picked up Jonah, and they threw"],["494.8","him into the sea, and the sea ceased from its raging. Then the men feared the"],["500.08","Lord exceedingly, and they offered a sacrifice to the Lord, and took vows."],["505.52","Now the Lord had prepared a great fish to swallow Jonah, and Jonah was in the belly of the fish three days and three"],["512.719","nights. So we see here that God sends the storm."],["518.24","How many times are we disrupted by the storms of life? And we think, \"This"],["523.919","storm, it's destroying all my plans. It's tearing up everything I'm trying to accomplish. It's preventing me from"],["530","getting to where I want to go. God, would you please, please, please stop this storm? And yet, it's God who's"],["538.959","sending it. God's actually has a plan for the storm. And while everyone is"],["546.08","scared and fighting for their lives, Jonah is doing nothing. He's just down"],["551.279","there sleeping. And they come to him. What is the meaning? Sleeper, arise. Perhaps your God will consider us that"],["557.6","we may not perish. I think that was an interesting detail that Jonah is sleeping through the"],["563.36","opportunity to testify to the power of the God of Israel."],["568.56","Often in scripture, the comparison of being asleep is connected with not believing, not paying attention to the"],["575.2","facts that are staring someone in the face, being oblivious or irresponsible. As Paul writes in Ephesians, for this"],["582.32","reason it says, \"Awake sleeper, arise from the dead, and Christ will shine on you.\" And again, Paul says in 1"],["589.12","Thessalonians, \"So let us not sleep as others do, but let us be alert and"],["595.279","sober.\" So often people who know God's word act oblivious to the ramifications"],["603.519","of what it holds for lost people. If our lives are all a metaphorical boat"],["611.2","on the sea, we know the storms are coming because the storms are always coming. Chaos and calamity is a fact of"],["618.72","life and they are going to befall us all. And most people are scared of them. And yet for us followers of Jesus,"],["626.32","storms are teachable moments. Storms are opportunities to speak truth and hope in"],["633.2","the midst of fear and confusion. And by being anchored and grounded on a firm foundation, we can show people how to"],["640.32","survive the storms of life. The book of Hebrews uses this metaphor that Jesus is"],["645.92","the anchor of the soul. We have this sure and steadfast anchor of the soul, a"],["652","hope that enters into the inner place behind the curtain. Jesus is the rock to"],["658.079","build upon because the storms of life are coming. But if we're built on him,"],["663.12","we will be safe. But we do need people to wake up and speak up when the storms are raging"],["670.32","because crazy things are happening in our world and people are straining to hear a voice of truth looking for light"],["676.399","to cut through the darkness. But so many churches are asleep and so many Christians are asleep which is"],["681.76","characteristic of the end times because Jesus says when the son of man returns will he even find faith?"],["689.6","So, it's funny how amidst the storm, it is the pagan heathens, the lost, who are"],["696.16","screaming out for supernatural help. They're calling out to their gods, while the prophet of the Lord, he's sleeping."],["702.64","Now once Jonah awakens then we see uh you know this whole"],["708.48","casting lots thing and I don't that's some superstitious voodoo whatever it"],["713.839","was but yeah God used that to make Jonah open his mouth put him on the put him in the put him in the pressure cooker there"],["720.24","open his mouth and explain what's going on so we see that in verse number um"],["725.519","verse number eight verse number seven they said to one another let's cast lot so we may know whose trouble this is"],["731.36","coming upon them as Jonah hasn't spoke up yet and they cast a lot and it falls on Jonah and then he's like h and they"],["738","look at him and they're like all right what what did you do what is your occupation where are you from what's your country and what people are you"],["744.24","from so he has to admit he has to tell the story I fear the Lord the God of heaven and earth and I'm running from"],["751.279","his presence he knows what's going on and he knows what's ought to be done"],["758.32","but will he tell the truth and will he sacrifice himself to save these people."],["765.04","A couple weeks ago, Ted McTurn was here visiting us and uh lots of you don't know Ted. It's been a while. It's always"],["773.44","interesting when people come back and I try to think when did they leave and it's been well since Tom and Michelle"],["778.56","said it's been 10 years for them. That means it's been what 8, nine years since"],["783.6","Ted left. Right. So, um I want to tell a little bit about Ted. He was uh chairman"],["789.519","of our deacon board, treasurer of our church. That was his ministry. He did a great job and everyone appreciated Ted."],["796.48","But then he comes up to me one day and he says, \"Pastor, I want to start a"],["802.32","Celebrate Recovery program to help people struggling with addictions.\" We didn't have that. We never had anything"],["807.839","like that. And this was right around the time that the opioid prescription"],["813.2","medication epidemic was blowing up. Do you remember those days? And uh I not that I knew that anyone needed celebrate"],["819.839","recovery or anyone in the church was struggling with those things, but uh there was and uh I said, \"Well, Ted,"],["826.72","since the Lord laid that on your heart, uh then let's let's go for it.\" That's"],["831.839","how Ted talks. He says, \"Go for it.\" He's from uh New York, so that's how he would say it. So, this respected leader"],["838.16","of our church, and I tell these stories because it helps you learn the culture of how we got to where we are and and"],["845.04","how God has used different people. Th this respected chairman of our deacon board, treasure of the church, he walks"],["851.12","up front and he says, \"My name's Ted McTurnin and I'm an alcoholic and by the"],["856.639","grace of God, I've been sober for the last 12 years. I want to start a Celebrate Recovery Ministry to help"],["862.56","anyone dealing with habits, hang-ups, and hurts. We're here to help you.\" And so Ted threw himself out of the boat"],["870.56","into the midst of the storm to let people know what exactly was going on"],["875.92","and what needed to be done, what was going on with him and what God did and what was going on in their lives, the"],["881.68","storm and what God could do for them. And this began this ministry of"],["886.8","Celebrate Recovery that has helped so many people at Faith Bible Church. And the leadership has changed hands and we"],["892.56","have a great team that continues to lead that. And boy, there's like 40 people"],["898.16","attending Celebrate Recovery on Monday nights now. It has been nothing but in instrumental to help people. Marriages"],["906.079","were saved because Ted was brave enough to stand up and declare the truth about his own brokenness and sin and how God"],["913.04","can save. And then that ministry was instrumental in birthing a second ministry. Ted thought it was just going"],["920.32","to be a bunch of people like him struggling with drugs and alcohol. what he hadn't anticipated was another huge"],["926.72","addiction that was a massive issue that was destroying lives and marriages. And of course with the internet online"],["933.199","pornography is everywhere. So Tom told a bit of the story got a call 12 years"],["940.639","ago. Michelle's like, \"We've been coming to this church for like two weeks and all this mess has hit the fan and I"],["947.44","don't know, but can you help us?\" And I was like, \"I don't know, but come on in.\" And so they came in and uh they had"],["954.24","all of this stuff broke, what was going on. And Tom and Michelle were in the midst of this storm. It was threatening"],["960.399","to destroy their marriage. And so we started with Celebrate Recovery. Just went in there and met with Tom with Ted"],["966.399","and Norma to get help. But then um Tom and Michelle realized that God had a bigger calling for them. and extensive"],["973.44","work after extensive work to save their own marriage. The weavers felt God calling them to step out of the boat to"],["980","help others struggling with addiction, help couples who are being destroyed by it. But it would mean sharing their"],["987.839","story, admitting how they had run from God, the the rebellion that Tom had gone"],["993.759","through, and uh would they be willing to take that step of faith?"],["998.959","Well, they did. Praise the Lord. And uh 200 people were at a conference this spring and we're going to put it on"],["1005.279","again next spring. And people are being helped all over the world through this ministry. So often we are like Jonah. We"],["1014.24","know exactly what the problems are in our hearts, in our minds, in our homes, in our relationships. But it's so very"],["1021.12","hard to admit the truth and talk about it because it seems like it's going to be the end of us. Jonah knows what the"],["1027.76","issue is. the cause of the storm is him. He tells the truth. He's brave enough to"],["1033.039","be tossed out into the midst of the storm. Well, nobody originally likes this idea, do they? Verse number 12, it"],["1039.039","says that um pick me up, throw me into the water,"],["1044.559","and the sea will be calm. I know the tempest is because of me. But the men rode hard to return to land, but they"],["1049.919","could not for the sea continued to grow more and more temptuous against them."],["1055.2","So they tried they they tried to do it on their own strength but they realized that's futile. They conceded let's let's"],["1060.48","throw this guy overboard and see what happens. And as soon as they did the storm stopped and then there was a mini"],["1066.96","revival right there. They picked up Jonah verse 15 threw him into the sea. The sea ceased from raging and the men"],["1073.679","feared the Lord and that's your capital Lord. So that's Yahweh. They feared Yahweh exceedingly. That's the God of"],["1080.24","Israel. and they sacrificed to Yahweh and took vows. So, do you see how God"],["1086.16","used the rebellion of Jonah and the storm, the calamity, and turned it into"],["1091.76","an evangelistic opportunity to save those guys on that boat? What the enemy intends for evil, God can"],["1098.88","always turn it for good and for his glory. And Jonah was able to evangelize"],["1104.88","through the calamity. God. Jonah was used by the Lord to reach those sailors with the knowledge of the God of heaven"],["1110.16","and earth. Even though he was running away from God. See, the ministry opportunities are all around us. Even in"],["1117.36","the storms. Especially Especially in the storms. So Jonah gets thrown out of the"],["1123.12","boat. He goes into the deep and he knows this is it for him. He's going to drown."],["1129.919","But then what did God do? sends a great fish to swallow him up and"],["1135.52","save him from drowning. And Jonah started out for Tarsus, running from the presence of the Lord, and now he's in"],["1142.24","the depths of the ocean in a fish. Is he away from the presence of the"],["1147.679","Lord? Apparently not. He's just on a timeout."],["1154.48","Chapter two, Jonas in the belly of the fish. Chapter 1, verse number 17. Three days, three"],["1161.12","nights, Jonah prayed to the Lord his God from the fish's belly. Interesting."],["1168.08","Verse two, he said, \"I cried out to the Lord because of my affliction and he answered me. Out of the belly of shol I"],["1175.52","cried and you heard my voice, for you cast me into the depths, into the heart"],["1181.039","of the seas. The flood surrounded me. All your billows and your waves passed over me. Then I said, I am being cast"],["1187.039","out of your sight. Yet I will look again towards your holy temple. The waters surrounded me even to my soul. The deep"],["1194.08","closed around me, weeds wrapped around my head. I went to the moorings of the mountains. The earth with its bars"],["1199.6","closed behind me forever. Yet you have brought me. You brought up"],["1207.12","my life from the pits. Oh Lord my God. When my soul fainted within me, I"],["1212.24","remember the Lord and my prayer went up to you into your holy temple. For those"],["1217.76","who regard worthless worthless idols forsake your mercy, but I will sacrifice to you with the voice of thanksgiving. I"],["1224.08","will pay what I vowed. Salvation is of the Lord. So the Lord spoke to the fish and it vomited Jonah onto dry land."],["1234.48","What do you think about when you're a fish for three days? How dark is it in there?"],["1241.76","What are you hearing? Do you do fish heartbeats? Do you what do you smelly?"],["1249.6","Fishy. Do you open your mouth and scream? Probably not."],["1256.32","Ellie and I, we try to go to Eastern Shore at least once a year and we got to cross the Bay Bridge and uh I have a bit"],["1264.799","of anxiety going over high bridges because I've had this reoccurring dream"],["1270.64","that I go flying off the side of a bridge into the water in the car and it's been I don't know I've heard that"],["1275.919","several times in my life. So I don't know what that's about. But while driving on the a long bridge like the"],["1281.52","Bay Bridge, I have intrusive thoughts about what if we just go flying off over the side."],["1286.88","So, it's a little bit intimidating to drive over it, but I always do it because the desire to go to the shore and go to um get some lobster rolls and"],["1294.96","some oysters is always more compelling than my mild anxiety. Think of all the"],["1300.48","fears that people deal with. There's like the big ones. Fear of dark,"],["1307.52","claustrophobia, the fear, fear, who has that one? Fear of cramped spaces. Some people are afraid of water. Some people"],["1312.96","are afraid of drowning. Uh some people are fear afraid of being smothered. Some people are afraid of being eaten alive."],["1319.6","Remember when Jaws came out and everybody we can go to the water? Some people have a fear of being buried"],["1324.96","alive. Jonah is experiencing all of those all of those fears for three days"],["1330.64","straight. like this is as close to death as one could come. Buried alive for three days."],["1337.2","For all intents and purposes, he's dead in that fish. He's just slowly being digested."],["1342.72","When you think about dying, some ways that people go, that doesn't seem that bad. Remember I was talking about Ted"],["1348.799","earlier. I remember Norma, his wife, was like, uh, she passed away in her sleep."],["1354.4","She wasn't even sick. They just went to bed one night. Ted woke up and Norma didn't. And like, well, that was a peaceful way to go. That'd be nice,"],["1360.64","wouldn't it? What Jonah's experience is completely opposite to that. He's dying for three days. He's in the grave. He's"],["1367.36","buried, but he's not dead. And now we already know the conclusion,"],["1374","right? Because we already read it. So, he's not going to die. He's going to get vomited up after 3 days. He'll be"],["1379.84","brought back to the land of the living. This is such an incredible event that"],["1385.52","Jesus uses it as a sign for the nation of Israel. The Pharisees had seen and"],["1391.52","heard Jesus do a bunch of miracles and yet they asked for another sign because they just wouldn't believe him. So it's"],["1397.12","like, \"Oh, well, you fed a bunch of people and you healed lepers and you healed lame people and blind can see and"],["1403.039","you raised the dead. Well, show us another sign. Show us another sign because we really we really don't believe you.\" And Jesus said, \"The only"],["1408.64","sign I'm going to give you is the side of Jonah.\" And they were like, \"What?"],["1414.32","You're going to get eat by a fish?\" Like, I don't get it. probably they didn't even know what he was talking"],["1419.84","about until he came out of that grave three days later. Now, what's telling about that is"],["1426.48","of course Jesus knew he was going to rise again because he's preaching that way. Matthew chapter 16, uh he says from"],["1434","that time on Jesus began to show his disciples he must go to Jerusalem, suffer many things at the hands of the"],["1439.36","elders, the chief priests and scribes. He must be killed but on the third day be risen back to life. So this is why he"],["1447.039","could link what he's doing with what happened to Jonah."],["1452.4","This three days is a sign is a symbol. A symbol. What? What are you talking"],["1458.4","about, Pastor Rob? Jonah and the fish. Are you saying it's not literal? It's symbolic. No, that's not what I'm"],["1465.84","saying. Jonah being swallowed by the fish literally did happen. A plain reading of this text communicates that"],["1472.48","this was to be taken as a real life event. Nothing in this passage grammatically communicates that is not a"],["1478.4","literal event. However, because God is the author of scripture, all scriptur is given by inspiration of God. God drops"],["1487.36","events and details into people's experiences that have great symbolic meaning. Often when this happens, we"],["1494.64","don't immediately see that detail as symbolic. So if you're reading Jonah independent from the rest of scripture,"],["1501.279","it's just a it's just a part of the story. Well, he was in there for three days and you just jump just roll right"],["1506.88","over that and it wouldn't jump out at you. But once you see that 3day thing"],["1512","repeated again and again, you see what is called a motif,"],["1517.36","a reoccurring elevated idea repeated."],["1522.48","Why do authors of scripture repeat? for"],["1528.24","I can't believe you you all should have that one down. The authors of scripture repeat things for emphasis. You"],["1536.64","repetition is for emphasis. So this is coming again as a reoccurring motif in"],["1542.96","scripture. And when the motifs of scripture are collected together, we then can see the central themes."],["1550.24","We do this, right? for example, the killing of the animals to make clothes for Adam and Eve in the garden. Okay,"],["1555.84","that was just all right, literally some animals got skinned, but it's"],["1561.52","specifically talked about a way to cover their shame. It's a literal event, but then we see it has symbolic meaning. And"],["1568.72","the sacrifice and the coverings get repeated over and over. Abraham and"],["1573.919","Isaac, Egypt, the Passover, the blood put on the doorpost, all the laws of Moses, Isaiah, the prophecies about the"],["1581.36","Messiah, like a lamb led before the slaughter, like a sheep before his shear is dumb. He opened not his mouth. Is"],["1588.4","this continu continuing motif? Jesus the Messiah born in a barn, heralded by"],["1596.24","angels and visited by who came to visit him? Shepherds. the shepherds come. So the"],["1603.6","motif is established so many times that when Jesus is called by John the"],["1608.96","Baptist, behold the lamb of God who takes away the sins of the world. We can"],["1614.48","clearly understand the central theme of the Bible that Jesus is the lamb of God,"],["1619.919","the sacrifice that is shed to pay for all of our sins."],["1624.96","All the events are literal but the there are types and shadows within the details"],["1630.08","of this account that are foreshadowing of what is going to happen. And Jesus helps us connect the dots by pointing"],["1635.919","out the three days in the fish represents is symbolic of his three days in the grave. It is a sign. But why"],["1644","three days? Is there significance to that number? Well, you see in scripture"],["1649.679","uh the way the number is used communicates completeness. For example, the trinity, right? Father, son, and"],["1656.96","holy spirit is a complete resurrection after three days of death"],["1662.48","proved to Jesus opponents that he really did rise from the dead. Why? Well, according to Jewish tradition, a"],["1669.2","person's soul and spirit remained with his dead body for 3 days. And after 3"],["1674.799","days, the soul and the spirit would depart. So for Jesus detractors, if his resurrection had"],["1681.919","occurred on the same day or even the day after, they would have said, \"Well, he wasn't truly dead.\" But because it"],["1688.48","happened 3 days after, they knew for a fact he was dead. And that's why Jesus waited a significant amount of time"],["1694.88","before he raised Lazarus from the dead. So much so that they said, \"He's kind of he's kind of rank. You really want to"],["1701.679","open that tomb? That guy's been so dead. It's it's going to stink in there."],["1706.72","But that proved that he really did raise him from the dead. Another reason why it was important for Jesus to wait three"],["1713.76","days is to fulfill biblical prophecy. And he claimed like we saw in Matthew"],["1718.799","that he prophesied that he would rise from the dead. Um also some point to"],["1724.32","Hosea chapter 6 as a prophecy of the Messiah's resurrection after 3 days."],["1729.84","Hosea chapter 6 verse 1-3 says, \"Come let us return to the Lord. He has torn us to pieces, but he will heal us. He"],["1736.64","has injured us, but he will bind up our wounds. After two days, he will revive us. And on the third day, he will"],["1742.64","restore us. So, once again, another motif, another reoccurring theme. The Pharisees remembered Jesus claiming he"],["1749.919","would rise again. And they even argued with the Romans to say, uh, you know, send some soldiers to stand at the at"],["1757.039","the at the tomb and guard the tomb. Because they said, \"We remember while he was alive, that deceiver said after"],["1763.84","three days, he'll rise again.\" Jesus knew he was coming out of that grave."],["1769.679","And because he did, we too know that we come out of the grave. We have the power"],["1775.679","of the resurrection. We rise again when we trust in Jesus. Jonah, on the other hand, he had three days of not knowing"],["1783.2","what was going to happen. All he can do for three days besides being digested is"],["1788.24","think and pray. And what do you think about when you're in a fish for three days?"],["1794.96","Good question. I think probably you first try to figure out, you know, what happened. Okay, I was in a boat and"],["1801.039","there was a storm and I confess that I was running from God and I says, \"Throw me over and the storm will stop.\" And"],["1807.52","then those boys picked me up. They threw me into the ocean and I was drowning. And then he talks about the drowning. He"],["1813.679","said, \"Out of the belly of Shaw I cried and you heard my voice, for you cast me"],["1818.88","into the deep, into the heart of the sea. The flood surrounded me. Your billows and your waves passed over me.\""],["1826.72","Then I said, \"I have been cast out of your sight. Yet I will look again to"],["1831.84","your holy temple.\" So he's sitting there talking about the grave, this shield,"],["1837.76","death store. He's in the waters. The billows of waves are flowing over him. He's like, \"I I was cast out of your"],["1844.24","sight.\" And that reminded me of many times in scripture when Lucifer was cast out of heaven. Remember when David"],["1850","prayed, \"Cast me not from your presence, O Lord. Take not your holy spirit from me.\" And even Jesus on the cross, he"],["1856.799","said, \"My God, my God, why have you forsaken me?\" If you are cast from God's"],["1862.799","sight, you are in a very dark place. And that is a fearful place to be. God's"],["1869.039","light. He is light, right? God is light and in him there's no darkness. And if you are"],["1875.2","out of his sight, you are literally in outer darkness. Jesus calls outer"],["1881.2","darkness a place of weeping and nashing of teeth. Now, Satan, we see in scripture,"],["1887.12","portrays himself as an angel of light. But here's the thing, that's an illusion because there is no light apart from"],["1893.12","God. Lucifer in his exalted position as head cherub, he radiated God's light. He"],["1899.44","was bathed in it and he seemed so brilliant. But once he was cast out, he soon discovered he had no light apart"],["1906.399","from God. And when he goes to the bottomless pit at the end of days, he too will be in outer darkness. And"],["1913.679","theologically, we need to remember this fact because we compete against a lot of false contradicting narratives that"],["1921.2","promote themselves as light and truth and people get confused and we have to not be confused. We have to be clear on"],["1928.64","what is the source of light and what is counterfeit. Jesus said, \"If the light of your eye is"],["1934.88","bad, your whole body is full of darkness. If therefore the light that is in you is darkness, how great your"],["1941.679","darkness.\" And I've always thought about that statement. And you have this"],["1947.919","scenario that Jesus is describing where someone is staring at darkness and they're"],["1954.08","claiming that's light. swearing up and down. That's true and that's the right path. And yet it is darkness. It's lies."],["1961.6","It's the path of destruction. If your light is darkness, then you're just being led further and further into"],["1967.76","darkness, insisting the whole time that you are in the lights. And we see that all around. We met a"],["1975.12","couple this summer who uh they we were talking and they I was telling them I was a pastor and they declared to me"],["1981.039","that they would not attend any church that was not LGBTQ affirming and that"],["1986.88","was their standard of righteousness. That was their guiding light. And and we see that many Americans guiding light,"],["1993.279","standard of truth is darkness. But there's something interesting about"],["1999.919","things getting darker. We had this um internet modem there."],["2005.44","There was three small blue lights indicating that the modem was on and the internet signals coming through. And this modem was in a our closet door and"],["2013.36","the door was always closed. And uh you couldn't see those lights until it was"],["2019.6","nighttime and all the lights were off in the room. But then streaming through the crack of the closet came this little"],["2026.64","blue light. Never is it noticeable in the day, but when it's completely dark in the room, the light shines through"],["2034.559","the closet door. Jesus says that we are the light of the world. Let your light"],["2040","shine before men. So as things get darker, the true light, no matter how small and insignificant, it becomes"],["2047.2","brighter. That's what Jesus asks us to be, the light of the world. Verse 5, the"],["2053.359","water surrounded me, even my soul. The deep closed around me, weeds wrapped around my head."],["2059.359","It's basically describing the process of being drowned and killed. I went down to"],["2065.839","the moorings of the of the mountains, he says. So that's the foundations. Moorings, the foundations of the earth."],["2073.28","The lowest part of the planet is where? It's not the seashore. It's where?"],["2079.04","All the way down into the ocean. So this is a very scientifically accurate statement that Jonah understands the the"],["2086","the water is where the foundations of the mountains are at. The earth gates"],["2091.44","shut behind me forever. So the way back to dry land, he says, is closed. He's trapped. Verse six, he says he's in a"],["2098.88","pit. I went down even into the pits, but you brought my life out of the pit."],["2105.839","So what I observe here is it seems to me that Jonah's trauma revolves around he's"],["2113.44","describing sinking into the water. Most of his description he talked about the sea, the flood, the billows, the water"],["2119.599","surrounding him, the weeds around his head sinking into the deep. But then in verse six he says, \"But yet you brought"],["2126.56","my life from the pit, oh Lord my God.\" Now when did he make that conclusion?"],["2133.04","Where is he when he prays this prayer? Where?"],["2139.119","He's in the belly of the fish. He's inside the fish's belly. Verse number"],["2144.88","seven. When my soul fainted within me, I remember the Lord, my prayer went up to you into your holy temple."],["2153.92","All of that is confessed while he's in a fish's belly for three days."],["2158.96","The fish, Jonah acknowledges, was sent by God to save him. For I regarded"],["2164.88","worthless idols, those who regard worthless idols forsake your own mercy. I will sacrifice to you with the voice"],["2170.96","of thanksgiving. I will pay my what I have vowed. Salvation is of the Lord. All that is said in the fish's belly."],["2178.72","The fish was his salvation from dying."],["2185.04","Three days in that fish was not a time of terror for Jonah. It was a time of revival, a time to get his heart and his"],["2192","mind straight. Remember, I think it was like maybe nine"],["2197.28","years ago. Uh we were at a church picnic playing softball. Pastor Greg was"],["2203.92","pitching. Anybody remember this? Greg decided to have a heart attack at a church picnic. You know, always got to"],["2209.92","be a center of attention. So he's having a heart attack. I think"],["2215.119","Linda was there when Yeah. You guys took care of him. Saved his life. And so um they got the uh helicopter to come in"],["2222.64","and helicopter took him and flew him up to uh DC to one of the hospitals there"],["2228.16","and helicopter pretty loud. E can't really do a lot of talking with people in the helicopter and there was limited"],["2234","cap capacity in there. So Wendy couldn't ride with him. So he was just alone with his thoughts flying up to DC and I"],["2242","said, \"What was that like, Greg?\" And he says, \"I had this great peace. I"],["2247.28","thought, well, if this is it, if this is God's plan, I never been on a helicopter before, so"],["2252.88","this was nice.\" Often when people have everything stripped away, when there's nobody else"],["2258.56","to be with them, and all they have left on is to hang on to the Lord, they discover that the Lord is there. The"],["2264.48","psalmist says, \"Our God is a refuge and strength, a very present help in a time"],["2270.079","of trouble. Therefore, I will not fear even though the earth be removed, the mountains be carried in the midst of the"],["2275.119","sea. Though the waters roar and be troubled, though the mountains shake with their swelling.\" I think Jonah"],["2280.24","could have wrote that was David, but Jonah could have wrote that one. Despite all this, God was with him. And"],["2287.92","again, these are his thoughts. while he's in the fish. When my soul fainted, I remember the Lord and I my prayers"],["2294.8","went to him. Verse 7, they went up to you, holy temple."],["2300","They went into his holy temple. Now, nobody here this week is trapped in"],["2305.839","a literal fish at the bottom of the Mediterranean. Although, we are going to have a baptism later, so hopefully"],["2312.32","nobody gets eaten. Probably not. Maybe a jellyfish might sting someone. That'll be the worst. But"],["2319.92","nobody's in a fish. But I'm sure there are folks here who have been in really dark places. Or maybe currently you're"],["2325.44","in a really dark place. Something that feels like it's going to be the death of you. Could it be that there is some"],["2331.44","saving grace in this place? Could it be that there is a redemptive element to"],["2336.48","this situation you're going through? The fish wasn't killing Jonah. God was using it to save him from drowning. God used"],["2343.68","it to give Jonah a couple of days to get a proper perspective on life and on ministry. He got a timeout and Jonah"],["2351.68","used that time to evaluate his current situation and to pray. So, can God hear"],["2356.72","your prayers when you're a fish in the middle of the ocean? And the answer is yes. My prayers came up to your holy"],["2362.48","temple, he said. And that's quite a revelation. You got to consider who Jonah is. He's a Jew. And how do those"],["2368.16","people reconcile with their God according to the law of Moses? Well, they got to go to the temple and they"],["2373.359","got to make a sacrifice and they got to kill a lamb and the blood's got to be presented to the Holy of Holies and they got to light some incense and they have"],["2379.04","all these elaborate rituals prescribed in the law. Well, how's Jonah going to do any of that? He's not. He's in a fish"],["2384.64","and yet he prays and goes up to his holy temple. And that's wonderful news for us, isn't"],["2391.04","it? If God can hear Jonah down there in a fish, then he can hear you any place at any time in whatever you're going"],["2397.599","through. No matter how dark or how desperate it seems, God hears our"],["2402.72","prayers. So God heard Jonah's prayer on day one and he heard it on day two and"],["2408.32","he heard it on day three, but he didn't answer till day three. He just told him to wait. Sometimes you got to wait."],["2413.92","Nobody likes to wait. Wait. So, back to us and the situation you are"],["2420.72","in. What is your fish belly that you're praying to get saved from? You think"],["2426.48","it's killing you. Maybe it's saving you. God hears you."],["2432.24","Are you hearing him? Lord, we just pray that you would help us to learn from this prophet. Learn"],["2440.72","from what he's going through. learn about you and your calling and your plans and purposes and our proper"],["2448.079","response to them. How to deal with our anger and bitterness and resentment to other people. How to be a light in the"],["2454.4","darkness. Lord, we just pray that we would not fight against the storms or"],["2459.44","the calamities, but we will see that you are always working, never stop working,"],["2465.2","can use any and all these situations to bring glory to your name. So help us to just be like Jonah and in this dark"],["2472.8","place pray thanking you and looking to be a testimony to other broken people"],["2479.04","around us. We pray all this in Jesus name. Bye-bye."]]},{"id":"UtuqfQ5dEV0","name":"2025-08-10  The Call of God (Pastor Rob McNutt)","date":"2025-08-10","transcript":[["10","All"],["21.359","right, let's uh get into this. Uh Jonah chapter 1. Let's do a lot this morning."],["28.08","Chapter 1 verses 1 through three. The word of the Lord came to Jonah the son"],["34.079","of Amiti, saying, \"Arise, go to Nineveh, that great city. cry out against it, for"],["40.32","their wickedness has come up before me.\" But Jonah arose to flee to Tarses from"],["45.92","the presence of the Lord. He went down to Japa, found a ship going to Tarsus, paid the fair, went down into it to go"],["52.64","with them to Tarsus from the presence of the Lord. The word of the Lord, the"],["59.12","Hebrew is hay dar Adonai. This phrase is used 252 times in the Bible. 239 times"],["68.88","in the Old Testament and 13 times in the New. This common expression or thus"],["76.08","sayeth the Lord is used at the beginning of most of the prophetic books. Jeremiah, Hosea, Joel, Amos, Obadiah,"],["83.04","Micah, Zephaniah, Hagi, Zachchariah, Malachi, the word of the Lord."],["90.88","Why? Why would they use that? Well, because right out the gate, it makes the audience want to pay attention because"],["97.68","of the sheer power of God's word. More powerful than any army, more powerful"],["103.92","than a nuclear bomb, more powerful than a natural disaster. After all, it is"],["109.6","asserted in Genesis that it is by the word of the Lord all things were"],["114.88","created. And God said, \"Let there be.\" Let there be. The psalmist says, \"By the"],["121.439","word of the Lord, the heavens were made.\" That's quite a thing. To create out of nothing, to simply decree,"],["128.56","articulate a thought, and matters formed. That ought to amaze us. I mean, I say"],["135.44","all kinds of things that result in absolutely nothing. I'm watching basketball and I'm uh cheering, \"Come"],["142.8","on, guys, make the shot.\" They miss, right? And then I'm upset at the"],["148.56","referees for a call they make and I'm yelling at the at the TV. What are you doing? Watch me make the call. They"],["154.48","don't listen to me. All All that happens is says, \"Stop yelling at the TV. Nobody cares, Rob."],["161.44","Nobody cares.\" Sometimes in my sermons, I make my opinions known about what's happening in"],["167.2","the world of politics and what's going on up there in the swamp in DC and my displeasure. And he's like, \"Oo, you better be careful.\" You know, you're"],["173.519","saying that stuff on the live stream. It's going out there. Maybe President Trump or the powers that be will hear"],["179.68","and get in. You'll get in trouble or very least YouTube might censor and pull down one of your sermons."],["186.879","Nobody cares. You get like 300 views online. Nobody's"],["192.72","hardly listening to me. My words are pretty weak. But God's word"],["199.84","created the universe. Yeah, God's written word number one bestseller of all time."],["206.8","And what about when the word became flesh? As John said in John chapter 1, how"],["214.879","powerful the word of God when it became flesh. The father sent the son to be the"],["220.64","savior of the the world. God's word is salvation"],["226.319","or it can be destruction. Now out of his mouth goes a sharp sword"],["232.64","and with it he would strike the nations and he himself will rule with the rod of iron and he himself will tread the wine"],["239.439","press of the fiercest of the wrath of God Almighty. It can be salvation or it can be destruction. Either way hayah dar"],["249.12","Adonai is the most powerful force that we can imagine. So we ought to sit up"],["254.72","and listen carefully to the word of the lord. Okay. So what is the word of the Lord to Jonah? He says, \"Arise, go to"],["261.84","Nineveh, that great city. Cry out against it, for its wickedness has come up before me."],["269.199","Cry out.\" The Hebrew is kar. It means to proclaim or call them out. That's a"],["275.28","modern expression, isn't it? Jonah, go to Nineveh and call them out on their wickedness. Their wickedness is come up"],["281.6","before me. The Hebrew is the raw, the evil, the calamity, the injury they're causing. That is a good word to describe"],["290.4","the Assyrian Empire whose capital was Nineveh. Nineveh was the capital of this"],["296.72","empire. Ashure was the name of the people's gods and it was the name of the"],["302.88","city Ashure which was located on the banks of the Tiger's River. Now Genesis"],["308.24","tells us that Nimrod the great grandson of Noah who was the founder of Nineveh."],["313.6","So this is one of the oldest cities in the world, Nineveh. After Noah and his f"],["320.24","his his sons came down out of Mount Arat in Turkey, they followed the Tigress River down to the plains of Shinar. And"],["327.759","in the land between the two rivers, the river Tigris and the river Euphrates,"],["332.88","that's the Greek word Mesopotamia. That's what it means. Mesopotamia means the land between the two rivers. That's"],["340.479","where civilization was reborn after the flood. But these people quickly rebelled"],["348.32","against the Lord. They built the tower of Babel and God judged them, confused their languages and scattered them. The"],["353.919","people who settled the city of Asher were named after their god Asher. They"],["359.52","were called the Assurans or as we say the Assyrians."],["365.28","They were not immediately immediately a formidable empire where"],["372.4","Abraham was from Babylon they were more advanced and then of course over here to the uh west Egypt Egypt exploded as a as"],["381.12","a civilization and they were more powerful uh at the beginning. Then the"],["386.8","entire area, all of that area had a a big problem when the sea people arrived"],["393.199","in around 1,200 BC. And we know the sea people as the the Philistines. The Philistines, they"],["400.16","were a problem to Egypt. They were a problem with Assyria. This is all found in antiquities in the ancient writings"],["406.24","of the Egyptians and everything that was found. They talked about these Philistines, these sea people. And we"],["412.08","know from the Bible that they were a big problem for Israel. But God used King David to put them in check. And during"],["419.28","the rule of David and Solomon, uh the the Philistines were driven out and the Assyrians were not strong enough to"],["426.639","challenge Israel. Israel was the dominant force. But coinciding with the"],["431.759","splitting of the nation of Israel came the rise of the Assyrian Empire as the"],["436.8","most powerful force in the region. and their kings, especially Asher Nassipal,"],["442.479","were they were notoriously brutal. When they would conquer a city or a region,"],["447.759","the Assyrians would do horrendous things to the people they were attacking. They"],["453.12","would cut off your limbs. They would cut off people's noses. They would tear out their tongues. They would decapitate"],["459.44","people and hang their heads on pikes. Burn children alive in front of their parents. All this was a means of"],["466.4","terrorizing the region. They wanted their empire to strike fear into the hearts of all who they marched against."],["473.599","Their religion taught that the god of their city was the most powerful god and"],["478.879","he would provide them conquest in battle. So every time they won, it meant that their god won. Thus proving that"],["485.36","their opponent's gods were weak and this made them feel superior to all the other people believing they had the divine"],["491.68","right to destroy all these people and all their weak gods. And all this the"],["496.72","Assyrian kings bragged about in their records. And they kept extensive records. This is not found in scripture."],["503.199","This is all what we found in archaeology. All what antiquities has dug up and translated. So we know all of"],["509.68","this history. Also, the Assyrians were big on deportation. Like the"],["514.959","Babylonians, carrying off the wealth of a land, carrying off its population to"],["520.159","strengthen their own empire. Deporting people out of their lands would break their connection with their families and"],["526.08","their ancestry. Basically, you wipe a people group out. You wipe out their history, their culture, their family"],["531.839","ties by assimilating them into your empire. So Jonah and the Israelites,"],["538.16","they know all about the Assyrians's reputation at this time. Assyria is"],["544.08","Israel's biggest threat. And it will be the Assyrians who God uses to punish the"],["549.92","northern tribes of Israel and will conquer them and scatter them. And that's what we call the 10 lost tribes"],["557.76","after the fall because of the Assyrians. So the book of Jonah takes place 60"],["563.76","years prior to the northern kingdom being wiped out by the Assyrian Empire."],["569.36","Now, because the Assyrians were so brutal, they were feared, but they were also hated. When you oppress and"],["577.68","traumatize people, they don't forget. You can get away with it while you're strong, but if you have any problems or"],["583.839","you start to show any weaknesses, your enemies will be more than happy to get back at you. And right around the time"],["590.08","of the book of Jonah, the Assyrians were having some struggles. They were having some problems. They were suffering"],["596.08","losses. one of their powerful and vicious kings Adib Nari had died and"],["602.399","there was some rebellion taking place. You see on the eastern side the mountains there the the the people from"],["608.72","the mountains were coming down and attacking their eastern border and uh raiding and the empire was kind of"],["615.6","teetering and struggling. And this is when the word of the Lord comes to Jonah to go call Nineveh out. Now Jonah's name"],["625.44","means dove. And we affiliate a dove with the concept of what? Peace, right?"],["632.079","That's very biblical. The authors of the gospel say the Holy Spirit descended upon Jesus after his baptism like a like"],["640.399","a dove. And uh then Paul tells us that the fruits of the spirit are love and joy and peace. And at the the Messiah's"],["646.959","birth, the angels proclaim peace on earth, goodwill to men. So perhaps Jonah, whose name means dove, is, you"],["654.16","know, maybe he's a non-confrontational person and the idea of having to go confront these evil empire and call them"],["660.56","out, maybe that's making him intimidated and making him feel uncomfortable. Maybe he doesn't that that's why he takes off"],["665.68","in the opposite direction because he doesn't want this assignment. He doesn't like the idea of the conflict. And"],["670.8","instead of going and taking the word of the Lord to Nineveh, he goes the opposite direction and he flees to"],["677.44","Tarsus from the presence of the Lord. And notice it says that a couple of times that he flees from the presence of"],["682.72","the Lord like he's trying to somehow go someplace where God won't be. Is there"],["687.839","any place where God isn't? No. Psalmist tells us that, isn't he?"],["693.36","Where can I go? Where can I flee from your presence? Where can I go? The answer is me. There's no place you can"],["699.2","go. But he's going to try anyways. Um and and why does he not want to take the"],["705.2","word of the Lord to Nineveh? We actually don't even have to speculate. If you turn over, I'll I'll do a a let the cat"],["712.079","out of the bag here. Uh chapter 4 verse 1 and two, we see and uh this is later"],["719.279","on after the story when um God has spared Nineveh. Oh, I let you know"],["724.88","what's going to happen. Sorry. But anyways, it dep it displeased Jonah exceedingly. Chapter 4:1, he was angry."],["731.6","So he prayed to the Lord. He said, \"Lord, was this not why I said when I was still in my country? Therefore, I"],["737.12","fled to Tarsus. I know that you're gracious and merciful, slow to anger,"],["742.56","abundant and loving kindness. One who relents from doing harm."],["748.72","Why Jonah doesn't want to go to Nineveh and warn these people is because he doesn't want them to repent. He doesn't"],["755.6","want them to receive God's grace and mercy. He doesn't want them to have peace with God. He hates them. He wants"],["762.399","them to burn because the word of the Lord that God gives Jonah is not I will destroy them,"],["771.68","but it's if they need to repent, repent so they won't be destroyed. And"],["778.72","God and Jonah doesn't want them to have peace with God. He hates them and he's"],["785.519","not interested in them getting peace. See, Jonah is very um focused on Israel"],["791.6","being saved. He's nationalistic. We hear that a lot, right? Nationalistic. But God is global in his visions. God wants"],["801.76","who to be saved world. The world. For God so loved the world. And Jonah, like so many other"],["809.92","Israelites, he he loses the plot. He keeps forgetting that God's vision is"],["815.12","not just for Israel. God's master plan was to make his name famous in Israel so"],["822.72","the nations of the world would learn of him. He wanted to bless the nations of the world through the nation of Israel."],["829.44","And from the outset, that was God's vision. Take the message of salvation to the world. We see the seeds of this in"],["836.72","Genesis 12 when he gives the Abrahamic blessing. God says to Abraham, \"I will"],["843.199","make you a great nation, and I will bless you, and I will make your name great, so you shall be a blessing, and I"],["850.32","will bless those that bless you, and I will curse those that curse you, and in you all the families of the tribes of"],["859.04","Israel will be blessed.\" Is that what it says? All the families of the whole"],["864.959","earth will be blessed. So in a time of false religions when"],["872.16","everywhere the people were confused about gods and which one was the greatest the vision was to make the God"],["879.68","of Israel who was the one true God of heaven and earth make his name famous to"],["885.68","the whole world and God's plan according to the Abrahamic and the Mosaic covenants was to bless Israel so"],["892.88","abundantly that every nation would have to conclude Israel's God is the greatest, the strongest God of all. Look"],["900.079","at what he's doing for this little teeny tiny nation. Look how strong they are. And it seemed like David understood that"],["907.839","assignment because David would write in the Psalms, \"Give thanks to you, O Lord, among the nations. I will sing praise to"],["914.079","you among the nations.\" In Psalms 96:10, \"Say to the nations, the Lord reigns."],["921.839","Indeed, the world is firmly established will not be moved. He will judge people with equity."],["928.56","And there was a time when the vision was"],["934.079","realized. There was a time in history when Solomon was so blessed. Everyone"],["942.72","recognized how powerful the God of Israel was. It's it's in second Kings chapter 4. It gives this summary of of"],["951.12","King Solomon verse number 29. 2 Kings chapter 4."],["957.519","First Kings, First Kings chapter 4 verse 29. It says, \"God gave Solomon wisdom,"],["964.88","great discernment. His insights were numerous as the sand of the sea. Solomon"],["970.079","was wiser than all the eastern leaders and wiser than anyone in Egypt. He was"],["975.44","wiser than anyone in his day.\" So by saying the eastern leaders and then Egypt, that's basically covering all the"],["982.24","world there because that was the east and the west. And what else does it say? Verse 31, his reputation was known"],["988.079","throughout the surrounding nations. Solomon wrote 3,000 proverbs and a"],["993.839","thousand songs. He described trees and every cedar that grows in Lebanon, hissups and growth on the wall. He"],["999.6","described animals and birds and reptiles and fish. He just knew everything about the world. Verse 34, people came from"],["1005.839","everywhere to hear Solomon's advice. Every king on the earth heard of his"],["1011.92","wisdom. That's was God's plan. Everybody in the world coming to Israel to learn"],["1018.88","about this great God and how he blessed his people. Unfortunately, it was"],["1024.24","short-lived. Just as God had promised to bless Israel if they abided by his laws,"],["1029.839","he'd also promised what? What happens if they don't abide?"],["1035.199","It's going to curse them. And that's what happens. And we all need to remember that the blessings of the Lord"],["1042.16","are connected to the laws of God. The word of the Lord. Yabar"],["1050","Adonai. Hayar Adonai. The word of the Lord. You have to obey the word of the"],["1056.4","Lord in order to have the blessings of the Lord. This means knowing and doing"],["1063.2","the word of the Lord. That means it should be our highest priority. This should be the most important thing in"],["1069.52","our lives. And this is what all the accounts of the Bible teach us. Israel"],["1076.08","was the nation who the word of the Lord was entrusted to. Their disobedience and"],["1083.12","subsequent chastisement is an illustration to us of what to do. Obey"],["1089.76","the word of the Lord and be blessed. And it also is an example of what not to do."],["1095.12","Disobey God's word and you will be punished. And that is part of how all"],["1100.799","the nations of the world are blessed through Israel because they were the ones that the word of the Lord came to"],["1107.28","and came through that we could be here today with the scripture."],["1112.799","But sure enough, King Solomon broke the laws and that golden age of blessing and"],["1118.799","prosperity came to an end. Nevertheless, the vision to make God of Israel famous"],["1124.08","to the nations was always there. We see the prophets all spoke about it. For"],["1129.28","example, we see in Ezekiel 37 talking about a a future time where he says, \"My"],["1134.72","dwelling pa place also will be with them and I will be their God and they will be"],["1139.76","my people and the nations will know that I am the Lord who sanctifies Israel when"],["1145.76","my sanctuary is in their midst forever.\" Uh again in Ezekiel, my holy name I will"],["1152.64","make known in the midst of my people Israel and I will not let my holy name be profane anymore. and who and the"],["1160","nations will know that I am the Lord. So yes, it's making Israel great, but making his name famous to the nations."],["1166.799","And then one more is Zachchariah. Likewise, thus says the Lord of hosts,"],["1171.84","it will yet be that peoples will come, even the inhabitants of many cities, the"],["1177.6","inhabitants of one who will go to another, saying, Let us go at once to entreat the favor of the Lord and to"],["1184.08","seek the Lord of hosts. I will also go. So many people and their mighty nations"],["1189.6","will come up to seek the Lord of hosts in Jerusalem and to entreat the favor of the Lord. Thus says the Lord of hosts."],["1196.08","In those days 10 men, this is interesting, isn't it? From all the nations will grab a hold of the garment"],["1201.919","of a Jew, saying, \"Let us go with you, for we have heard that God is with you.\""],["1208.24","And everybody is being drawn to this God of Israel. God's desire is to"],["1216.96","have his glory and fame, have his gospel go to all the world"],["1223.679","and to reach the nations. And that was what he gave his disciples as the great commission. Remember, he said, \"Go into"],["1231.2","all the world and preach the gospel, baptizing them in the name of the"],["1236.24","father, the son, and the holy spirit.\" And this is a big part of our culture here at Faith Bible Church. We take the"],["1243.52","great commission very literally and very personally. And we uh invest a lot of"],["1250","time in our services to talk about missions, right? and Matt got up here"],["1256.08","and Corey got up here and they talked about all the things they did and 50 people went on this missions trip and"],["1262.799","and then Patrick and Marissa going went to Panama and then they're going back to uh Dominican Republic later on and we're"],["1270.159","always sending every year we're sending people out and then the short-term missions trips and then there's the"],["1275.76","missions uh that are locally that we're supporting and you know and Brenda is sharing us about what's going on with"],["1281.6","the mission down there on Great Mills and we have all these programs in and around that we're trying to help and"],["1286.88","pastor Mark's initiative to get us out uh uh uh faith gives to get out into the"],["1292.96","community and and touch people like this is a big part of our culture of our"],["1298.4","church. We take the great commission literally and personally and we invest large sums of money into getting the"],["1305.28","gospel into our community and the rest of the world. And I just want to once again thank Pastor Mark for that great"],["1310.96","idea and to try to get us to stretch ourselves, break out of our comfort zone"],["1316","and go be a light. But this is an ancient calling. God has been about this"],["1321.6","as I've already shown you since Genesis. And we are fulfilling in our days what"],["1327.2","God has always been about declaring his glory, his plan of salvation to the"],["1332.4","people of the world. So this is important for us to understand because we like Jonah have heard the word of the"],["1340.24","Lord. We have been given this great commission but it's not easy."],["1347.919","It's not a job that everybody wants to accept. Well, how could it be easy?"],["1353.44","Because it's it's a battling of ancient demonic forces. It's spiritual warfare"],["1359.76","in high places. This is we're part of something that's thousands of years old. Our missionaries, our ministries at home"],["1367.28","and abroad are standing on the front line uh trying to accomplish the decreed will of God, dealing with the spiritual"],["1374.48","wickedness and the forces that are trying to prevent it. And while people are uh working on their careers,"],["1381.919","building their businesses, checking off their bucket lists, focusing on their retirement portfolies portfolios, we're"],["1388.64","supposed to be investing in the eternal plans, this ancient purposes of God."],["1396.799","How are you fulfilling this great commission?"],["1402.24","Are you or are you like Jonah this morning running from it? Running away from it."],["1410.799","Wait a minute, Pastor Rob. I I never I never got an audible call like Jonah. Because if you read the passage there,"],["1417.039","it it's very clear that the word of the Lord spoke directly to Jonah and said to Jonah, \"Rise, go to Nineveh, this great"],["1423.12","city, and do this.\" And uh you know, we didn't hear it quite so directly."],["1429.2","I I never got an audible call to go into ministry. For me, it was um more like a"],["1435.039","combination of some predictive programming, rhetorical questions,"],["1440.4","some adversity, and then obvious wide openen doors. So,"],["1446.48","I want to summarize all that and share. Many have heard my testimony. Some of you, this is new material. I don't think"],["1452.24","it's very relevant as we launch into the book of Jonah. The word of the Lord came to me at a very early age and then it"],["1460.48","was constantly molding me and shaping my worldview as I was growing up. But uh my"],["1466.64","parents trusted in Jesus in their early 20s. I was like 3 years old and within a"],["1471.84","month of my dad getting saved, he sold the house he built and he went off to"],["1478.32","New Brunswick Bible Institute to go to the ministry. He was a six-month old"],["1484.08","baby Christian and he went to Bible school similar to Illiana where he got saved and went to Bible school and"],["1489.2","didn't even know the books of the Bible. Didn't know anything. But there he was studying it. And it was a three-year"],["1494.96","program. And then after he graduated, he immediately went into full-time ministry. He went back and became the"],["1500.64","assistant pastor at the church where he was saved in. And then uh he was there. When I say he was the assistant pastor,"],["1507.52","that means he was doing everything. He was cleaning the building. He was doing the bus ministry. He was the youth"],["1513.039","pastor. I mean, it was this is a phrase and um Pastor Mark and the staff, they"],["1518.72","can look in their contracts. It's this phrase, other duties as assigned."],["1524.159","So that means anything we need done, other duties as assigned. And so that's what my dad was doing. And he did that"],["1530","for one year. And then after that, he returned to that Bible school and he went on staff as the business manager."],["1535.919","And then he started teaching classes, became a Bible teacher after"],["1541.6","three years of study and one year of ministry. And at this Bible college, that's where I grew up as a little kid,"],["1547.84","running around on campus. And uh they would host uh Bible conferences, three of them every year. One of them was a"],["1553.84","missions conference. Uh so we would always be at these conferences and learning all this and exciting things"],["1559.679","happening in the world. Saw, you know, slides of what's going on in Africa and"],["1564.72","Haiti. you know, the the old school slide projector to bed sheet kind of uh multimedia presentations. That's what we"],["1571.2","would enjoy. And uh on the side, my dad was planting churches in northern Maine. He was up there planting churches. We"],["1577.76","drive like 3 hours one way in the car. The old Dodge Charger had no heat and I"],["1584.559","just threw a bunch of blankets on my my sister and I like a nest in the back seat to try to stay warm as we would"],["1589.679","travel up there. And and he would plant churches. And then in the summertimes he was at um doing Bible camps and I I was"],["1597.12","always going to Bible camps. So as a child I was involved in all of this all"],["1602.32","this stuff we talk about child evangelism fellowship backyard Bible clubs good news clubs. That's where I"],["1607.84","got saved. I got saved at a CF little ministry going on after school."],["1614.32","And uh the the the vacation Bible schools that we just did. I would my my folks would my I would attend those. and"],["1621.44","Awana. The elders are talking about Aana. I grew up in Awana in Sunday school and youth group and then Sunday"],["1627.2","morning and Sunday evening and Wednesday night Bible study. And uh we never stopped going to church. Just I did it"],["1633.44","all. That was my life. And that's one of the reasons why I'm so supportive of all"],["1638.64","these ministries and all these local outreaches cuz that's where I came to Jesus and I was raised in that. And so I"],["1645.039","know how impactful it can be. So, uh, after my dad resigned from that Bible"],["1650.08","college, he went into full-time pastoral ministry. So, I was perpetually immersed"],["1656.159","in the word of the Lord. And yet, I, like Jonah, I wasn't really keen on"],["1663.6","following it. I did not visualize myself going into"],["1668.799","full-time Christian ministry because we were always poor."],["1675.12","We were just always broke. I'd be like, \"Hey, can we get this?\" \"No, why? We got no money.\" And so I was like, \"Well,"],["1682.08","dad's in ministry and that's why we're broke.\" So I didn't want to be broke my whole life. So I decided, \"Nah, I'm not"],["1689.2","interested in that.\" Plus, you know, I I I couldn't really feel like the"],["1694.799","preaching and the the public speaking part of the job, I I didn't think I could do that. I mean, writing a sermon"],["1700.24","seems like a lot of study, and I didn't do well in school. I really didn't like studying. I hated writing research"],["1706.799","papers. Sermons is like every week you write a research paper and then you get"],["1712","up and talk about it. So, no thanks. Didn't want to do any of that. And then the other aspect of uh full-time"],["1718.559","ministry that I was resistant to was church. Maybe not here, but church was"],["1726.88","boring. Anybody notice church can be boring?"],["1732.559","Not this one, though. Come on. those churches I was in, not not faith,"],["1738.159","Bible. That's not boring here, is it? I sat through these boring services and"],["1743.919","now I was just interested in fun. Now, I'll say this, Bible camp, youth group, that stuff was fun and I like that. Uh,"],["1751.12","you know, the VBS's were cool, but those were like the outliers. Those wasn't every Sunday church services. So, I I"],["1758.88","grew up uh just kind of like, nah, I don't want to do that. But the problem was is I'm from a very very rural area"],["1765.36","where uh the only things that people do to to make a living is farming. Uh and"],["1771.52","by the way, Mark, that was appropriate to say pick potatoes. That is that's that's what we would say. It wasn't"],["1778.159","harvest. We would say pick potatoes. So you you were fine with that. Uh so far, you know, potato picking was what we did"],["1784.159","and woods working and uh driving truck. You could drive truck. That's what"],["1789.76","everybody did. And I didn't want to do any of that. That was all hard work and horrible. And uh what I was interested"],["1795.76","in, what did I really want to do with my life? Sports. Yeah. I wanted to play some"],["1802.559","basketball. And uh that was like, well, how do we do that? So I always respected"],["1807.84","my father though. I want to make that very clear. Uh there there was always like a high respect for what he did. I"],["1813.52","didn't resent his what he did. But uh I remember one moment. It was very interesting. It was like my freshman"],["1819.039","year of college and I was home on Christmas break and my dad and this other pastor were close family friend."],["1824.88","They were talking about uh you know all the stories of the churches in the area and the ministries and how they were"],["1831.12","struggling to find pastors and leaders. And uh I was like well you know this Bible college is right here. They're"],["1836.24","graduating people every year. There must be all kinds of guys that are going to be pastors. And they were like well actually you know there's not a lot of"],["1842.72","good candidates. not people that are gifted or or qualified to or can handle the job. And there was a spark of a"],["1849.6","question that just came into my head at 19 years old. I thought, well, maybe maybe I could do that. And and uh my"],["1856.96","answer immediately was no, I'm not going to do that. So despite"],["1863.2","saying I didn't want to be a pastor, when I graduated high school, nevertheless, I went to Bible college."],["1868.88","And there was a very spiritual reason. I'll tell you my very spiritual reason why I came down to Atlanta, Maryland. And everybody's how did the Canadian get"],["1875.279","down here? You know, how'd you get down here? Well, I came to Atlanta, Maryland. Because the coach at Washington Bible"],["1881.12","College told me I could play basketball for the team. And that was my very spiritual reason to go to Bible college"],["1887.44","because there wasn't any other place that would let me play basketball. And I didn't want to do know what I do want to do with my life. I had no clue. But"],["1893.039","basketball was fun and I just wanted to have some fun. So that's why I went to Bible school was to play sports. And I"],["1900.32","had a great time uh playing sports. Um but uh you know what wasn't fun about"],["1906.08","college? Attending class, following the rules, doing homework. So"],["1914","three years I I focused on the social part of college. Uh playing sports,"],["1920","dating girls, and uh working at Red Lobster to make money to pay for it all."],["1926","Uh, but I was always looking for the exciting experiences. I made friends with people who were not into serving"],["1931.44","the Lord. They were more into breaking the rules and being self-indulgent. So,"],["1936.48","I wouldn't say I was running away like Jonah. You know, I wasn't sprinting away from God. I think I was um slow walking"],["1944.72","my sin past God. And this a couple years ago, I found this in um the daily bread."],["1950.24","You know, Mr. Neil is always talking about getting our daily bread. Well, this was an interesting one that really"],["1955.279","resonated with me. Uh the our daily bread, it it says, and of course, it starts with the verse, \"Whoever conceals"],["1962.72","their sin does not prosper, but the one who confesses and renounces his sins"],["1968.96","will find mercy.\" Proverbs 28:13. Of course, King Solomon wrote that because he was wise. And then here's the little"],["1975.76","story to go with that verse. Winston, the family pet, knows he's not supposed"],["1982.64","to chew them, so he's adopted a sly strategy. We call it slow walking. If"],["1989.84","Winston spies a discarded, unguarded shoe, he casually meanders over to where"],["1995.36","it is, grabs it, and just keeps walking slowly with it, hoping nobody notices"],["2003.84","he's taking the shoe. and he almost gets to the door and then somebody says, \"Uh, mom, I think Winston's slow walking your"],["2010.399","shoe out the door.\" It's apparent that sometimes we think we"],["2015.519","can slow walk our sin past God. We're tempted to think, \"Oh, he's not going to"],["2021.6","notice. It's no big deal. We We rationalize whatever it is. We can get"],["2026.96","away with it.\" But like Winston, we know better. We know our choices don't please"],["2033.2","God. Like Adam and Eve in the garden, we might try to hide our shame of our sin,"],["2038.48","pretend like it's not happening. But scripture invites us to do something very different, which is to run to God"],["2044","for mercy and forgiveness. Whoever conceals their sin doesn't prosper. But"],["2049.28","whoever renounces and confesses, what does he find? Mercy. So, we don't want"],["2054.96","to try to slow walk our sin and hope nobody notices. When we tell the truth about our choices to ourselves, to God,"],["2063.119","or to trusted friends, we can find freedom from the guilt and the shame of carrying the secret sin. So I thought"],["2072.639","that was me. That was me. All through those college years, I did enough schoolwork to pass the classes. I"],["2078.72","followed the rules just enough so I wouldn't get kicked out. I believed in Jesus just enough to keep my fire"],["2086.56","insurance up to date, if you know what I mean. Paul would have labeled me a carnal"],["2093.119","Christian. But in my junior year, things weren't very fun. Many of my friends had left"],["2100.24","school. They gotten kicked out. Our sports programs were trash. Losing"],["2106.72","everything. I was messing up my classes. Nothing was going well. I I wasn't having any fun. So by the end of that"],["2113.599","year, I was just feeling all this pressure because I'd done three years of Bible school. I had three years of"],["2118.64","student loans and I had one year left and I had no clue what I was doing with my life. Why I'm in my B and why am I in"],["2126","Bible school? It was obvious the MBA was not going to draft me."],["2131.2","So that summer I worked at a Bible camp and I really enjoyed the camp. It was fun. But I was also standing at this"],["2138.16","crossroads. Would I stop trying to do life my way, focusing on what I wanted?"],["2144.079","Yeah. Which I had to admit wasn't getting me anywheres. So far, I just had nothing"],["2149.28","but a mess and uncertainty. I had seen several friends get kicked out. And I had one guy even got arrested from our"],["2156.24","school. And I knew that could have just as easily have been me. By the way, Pastor Mark was not part of any of that."],["2161.52","He was he was one of the good ones. He'd have been a much better friend for me."],["2166.72","But I I liked I like the shady kids."],["2173.52","I knew what I was supposed to be doing. I'd heard it my whole life. Trust in the Lord with all your heart. Lean on your"],["2179.04","own understandings and all your ways acknowledge him and he will make your path straight. I knew I wasn't doing"],["2185.119","that. I knew God's wasn't directing my paths. And I was just slow walking away"],["2190.8","from him. I didn't get swallowed by a fish, but I could tell I was just going"],["2196.32","to waste my life. So, it was before my senior year, right in that summer, going"],["2201.359","back, whether I was going to go back or not. And I said, \"All right, God. I got no clue what I'm doing with my"],["2207.68","life. All I've done up to this point is just make a mess. So, here's my mess."],["2214.32","You take it. I can't figure out what to do with this. You have control. you lead"],["2220.8","me. And then I just I didn't like sign up to be a missionary or anything like"],["2226","that. All I did was I started doing the things I knew I was supposed to do. Uh went to church regularly, stopped"],["2232.4","sleeping in. I um I started uh concentrating on my studies, doing my"],["2238.079","homework. I uh committed my little"],["2243.2","red lobster amount that I would bring in. I would I would portion off a part and say this is for tithe. So this is"],["2248.48","for God. This is for the bill and this was for tithe and I would uh give and I tried to serve just the people in my"],["2255.28","community and they were small steps back to God doing the things that he blesses"],["2260.64","and much to my surprise that was my best year of college my senior year. Uh we"],["2267.76","had our we I did the best I ever did in the sports programs and I won an award which was a miracle. I actually got to"],["2273.44","play and I won an award and I did the best in my grades I'd ever done and I had positive friendships. I had a lot of"],["2280.88","fun. Someday Mark and I will tell you about the whole wrestling uh WWF"],["2286.4","wrestling thing that we put on and he whipped my legs out and slammed me on my tailbone and almost broke me in half. It"],["2292.96","was great. Made a lot of made a lot of good"],["2298","memories. Made good money that year. And in my final semester, I I started dating"],["2303.44","this girl and she's sitting right there. And we've been together for 31 years."],["2309.44","And so God blessed every aspect of my life, right?"],["2316","So wasn't too smart, but I got the message. The message was Rob, do it your own way and you're just going to crap"],["2322","your life up. Trust me, and I will bless you. So since 1992, I've been sticking"],["2329.359","with that. In '93, I graduated college. Wasn't sure I was going to do. So I"],["2335.2","said, \"God, okay, you know, whatever you want, I'm fine.\" But I had been coaching basketball in Lam. And uh I thought, I"],["2342.32","really like that. So I thought, well, maybe maybe I could do that. Maybe I could become a youth pastor and I could"],["2348.24","find a church with a Christian school and they would hire me and I could, you know, be the youth guy and I could coach"],["2354.16","basketball. And so, uh, when I graduated, I applied to two churches."],["2359.92","You know, you only need one, right? So, I applied to two. And, uh, the church hired me, had a Christian school, and I"],["2367.44","was a youth pastor, and I built a basketball program there. And, uh, man, I was having a good time. I was, I was"],["2374","living my the life, just having fun, youth ministry, planning activities, you"],["2379.359","know, we were skiing, I was shooting kids with paintballs. uh we was playing basketball, winning all these games. Uh"],["2386.48","then I got married and then nine months later after that uh we had a baby and you know so we were having fun with that"],["2393.28","and uh we we had a lot of young couples in our church and we were friends with them and God was just blessing us so"],["2399.92","much and the people at the church seem to appreciate me and the senior pastor."],["2405.04","He changed my title from youth to assistant pastor. And I was like, \"Wow, this is great.\" Just loving living my"],["2411.119","life here. And then all of a sudden, it all changed because he just got in a big fight and resigned and left the church."],["2417.839","And um and I'm standing there and I'm the only person with the name pastor"],["2424.48","in front of their name. And uh so I came home and I I said to um maybe I should"],["2432.56","pastor. And she's like, \"No, do it.\" I like, \"Yeah, I feel called.\" And uh"],["2438.4","which was weird cuz this was like, like I said, it had a Christian school. It was a very established church. It was a good size for our area. And it had, you"],["2445.52","know, Sunday school, Sunday morning, Sunday evening, Wednesday night, radio ministry. And I had to preach in all of that. And I'd never done any pulpit"],["2452.32","ministry. I was 26 years old. Can you believe that? I was 26 years old when"],["2458.4","God opened that door wide open in my face and I stepped through. I said, \"All"],["2463.599","right, I'll try this.\" And I finally found what God had gifted me to do."],["2468.72","Because up until then, I'd really didn't think I was good at anything. And I kind of felt like, you know, God had short"],["2474.079","changed me on the talent. But he had blessed me to teach people haya dar"],["2482.24","adoni, the word of the Lord. So, I've been doing that for 30 years and uh seen"],["2489.2","God do many blessed things and I'm not walking away. I'm going to stay with that."],["2495.119","So, I look around the room and I suspect there are some people here like Jonah"],["2501.839","who are running away from God. If they if their parents didn't make him be here, they would never be here. And uh"],["2509.52","they're opposed to what he says. And then I suspect there's people in here who just kind of like, you know, want a"],["2516.4","slow walk away, you know, just do enough church to keep the old fire insurance in check, but also be incognito about their"],["2525.04","disobedience. And this morning, if you're walking outside of God's will, some activity,"],["2531.839","some attitude, some besetting sin that's tripping you up, God is asking you to"],["2537.119","lay it aside. We know this verse. Hebrews 12 verse number one. Lay aside"],["2542.8","every weight or sin that ens snares us and let us run with endurance the race set before us looking unto Jesus the"],["2550.079","author and finisher of our faith. Who for the joy that was set before him endured the cross despised the shame and"],["2556.64","sat down at the right hand of the throne of God. The joy that was set before Jesus. What joy? The cross wasn't the"],["2564.16","cross. The shame, not the shame, the throne of God. And brothers and sisters,"],["2570.4","that's where we need to fix our eyes. Just like Jesus, we have to see beyond"],["2575.92","the frustrations and the sacrifices, the pain and the hardship. We got to see the"],["2581.04","big picture. God's will is to have his name made known to the nations of the"],["2586.64","world. And that is our great commission. He has given us the word of the Lord"],["2592.88","Jesus Christ. The word became flesh. The gospel. Now, Jonah ran away, but we are"],["2600.079","called to run the race with endurance. So, let's take time to pray and renew"],["2605.44","our sense of endurance. And if there's any weight that is tripping us up, any sin, let's pray that the Holy Spirit"],["2612.079","will call our attention to it and we would lay that down and we would obey"],["2617.2","the word of the Lord. Lord Jesus, we just come to you now and we ask in"],["2623.2","prayer that you would help us. Help us to learn from Jonah, to not run from you, but to trust you. No matter what"],["2631.28","you're asking, no matter how hard it is, no matter how much we don't even want to do it, that we would know that you've"],["2636.88","got a plan, that you've got a purpose, and it is great, and you will do great things. You will do good things. You"],["2643.44","will bless us if we will do the things that you bless. Help us, Lord. Give us the strength. Help us to lay down the"],["2650.64","sins. Help us to not get distracted with all of those cares of this world and"],["2655.839","follow you obediently. We pray now that your word would become so powerful to every soul here and they would try it"],["2663.839","and do it and see you do these wonderful things. We pray in Jesus name."]]}]