[{"id":"vMKeG-cBgDU","name":"2025-08-24  Willingness To Obey (Pastor Rob McNutt)","date":"2025-08-24","transcript":[["21.359","Okay, take your copy of the word of God and turn to Jonah chapter 4."],["28","Chapter 3. Let's skip chapter 3. Uh verse number one, Jonah chapter 3. The"],["33.28","word of the Lord came to Jonah the second time, saying, \"Arise, go to"],["38.32","Nineveh, that great city. Preached to it the message that I tell you.\""],["45.04","In chapter 1, the word of the Lord came to Jonah, and Jonah rejected it. So, the"],["50.48","Lord sent a storm. Jonah was thrown overboard."],["55.76","The Lord stopped the storm. Jonah's drowning. The Lord sends a fish. Verse"],["62.079","number 10, we learned in chapter 2 that the Lord spoke to the fish. And after"],["67.52","three days in Jonah repenting, the fish what? Vomited Jonah up. Later on, we're"],["73.92","going to see in chapter 4 that the Lord causes a plant to grow to give Jonah shade. But then the Lord sends a worm to"],["81.68","kill the plant. The sea, the fish, the plant, the worm,"],["88.479","all do immediately what God tells them to do. This theme showcases God's"],["94.64","sovereignty over all of creation. And Jonah even testified to that in chapter 1:9. He said to them, \"I'm a Hebrew. I"],["102.4","fear the Lord, the God of heaven, who made the sea and the dry land.\" Everything does exactly what God tells"],["109.759","it to do in this book except Jonah, the son of Abraham, the chosen"],["116.32","people, the prophet of the Lord. He is the only person in the book who does not obey God. What does that tell us?"],["126.24","So often we rage against the heathen and the culture and the wicked people who"],["132.72","are doing wicked things and the godless and their ungodliness. And yet how often"],["138.72","do we the children of God disobey the word of the Lord."],["145.04","Two weeks ago we talked about how powerful the word of God is the most powerful force. And yet Jonah rejected"],["152.4","it. How is that possible? I would submit to you that the in this book the sea,"],["158.959","the fish, the plant and the worm do not have mind, will and emotion."],["167.12","They are not made in the image and likeness of God. Thus, they do not have the capacity to do anything other than"],["173.68","what God tells them to do. But because man, mankind has been made in the image"],["180.08","of God, we have mind, will, and emotions. We think about the word of God and we think"],["186.72","about how it makes us feel and then we decide. We choose to accept or reject"],["193.12","it. And while this makes us the most like God in all of the physical universe, we have this special"],["199.92","privilege. It also presents the greatest challenge of peril. Our free will is the"],["206.159","greatest threat that we face because we can stand against the greatest force and"],["211.519","say no. The storm, the fish, the worm, the plant, if they would could reason, they"],["218.64","would ask us this question. Why would you do that? Why would you question the word of God? How could you dare to tell"],["225.519","God no? And the simple answer is"],["231.28","pride. Somehow someway we reason that we know better, that we have better ideas, or"],["238.799","maybe we just need to think about it and we're not sure if we have more details and more facts and more information."],["244.64","Once we have all that, we can understand and then we can agree with God."],["250.879","It's very interesting when Jesus how he responded to his disciples in Matthew chapter 18. They were asking who's the"],["257.519","greatest in the kingdom of heaven and Jesus said bring a little ch child here. And they brought a little child and he"],["263.199","put them in the midst. And he says, I say to you, unless you convert and become like a"],["269.52","little child, you will not enter the kingdom of heaven. Whoever humbles himself as a little child is the"],["277.36","greatest in the kingdom of heaven. And again, in Mark's gospel, assuredly I say to you, whoever does not receive the"],["284.4","kingdom as a little child will not enter it. I came to Jesus as a little child. I was"],["291.84","told I was a sinner and that meant I was doomed to hell. But Jesus had died for my sins and if I prayed and asked him to"],["298.8","forgive me, he would give me eternal life. And I reasoned, well, hell doesn't sound that good. Heaven sounds really"],["306.56","good. I better pray to Jesus. I did not stop to ask, okay, but how do we know"],["313.68","there's a God or if heaven and hell are real? What evidence do we have to prove"],["319.199","these things? I didn't even think any of that was necessary because when you are a six-year-old child,"],["324.88","you believe what people tell you very easily. You know, you're small and weak and not that smart."],["331.12","When I was a child, my dad was the strongest, smartest person I knew."],["336.479","Whatever he said, that was facts. And whatever he told me to do, that's what I was supposed to do. One day I was like 5"],["343.68","years old and uh I was outside and I was looking at the screen door and it was"],["350.8","like a frost on it and this is winter time and so I'm like that looks like ice"],["357.28","cream and I said I'm going to lick the screen door. So I ran my tongue along"],["363.039","that screen door and what happened? My tongue got stuck through the screen"],["369.12","door. So, I'm now heading there with my tongue on the screen door and I'm freaking out and uh I start I start"],["375.6","yelling, but when you're t stuck on a screen door, it's not much of a yell. It's more of a"],["381.52","and that's what I was doing. I was standing there 5 years old stuck to a screen door. Has anybody done this? Anyone? Northern climate people. If"],["388.639","you're from the south, you don't know what I'm talking about. I'm stuck to the screen door. And my"],["393.759","dad's walking by and he sees and he's like, \"Oh, the kid stuck on the screen door.\" So, he uh immediately jumps into action. And he yells to my mother, \"Get"],["400.16","some hot water.\" And then he comes and he's trying to open the door to get to me, but I'm stuck through it. He's like,"],["405.6","you know, push me back. And he gets out and then he gets right up by my tongue and he spits on my tongue two times like"],["412.479","that. And immediately my tongue comes off the door. And uh"],["418.08","he says to me, \"Uh, yeah, don't lick screen doors."],["423.84","Your tongue will stick to it.\" And I thought, \"This man's brilliant."],["429.36","He knows stuff like how to unstuck your tongue off a screen door. I should"],["435.28","listen to this guy. Jesus says that's what it takes to enter"],["440.72","the kingdom of God. The humility, the willingness to trust and obey what God"],["446.08","is saying, our heavenly father. Just like the storm does, the fish, the plant, the worm. God says do this and"],["453.36","then they do it. But, you know, I got a little older, no longer five, and uh I"],["459.44","learned not to lick screen doors. So, I kind of got that down. And uh you know, your father says, \"Well, do this and"],["465.28","don't do that.\" But, you know, you want to do it anyways. And you think in this scenario, you know, his words aren't"],["470.639","really relevant. They're not necessary. I can figure this stuff out for myself. After all, dads aren't perfect and"],["476.8","they're not always right. And sometimes they're wrong. And you start to realize a lot of people are wrong about all kinds of things. And you probably"],["483.12","shouldn't just follow people blindly, whatever they tell you. And that becomes"],["488.24","an important quality in your life. It's called discernment. Gaining facts and"],["493.36","wisdom before jumping to conclusions. And uh we learn to trust ourselves more"],["498.479","than we trust what people tell us, more than what our parents tell us. But that doesn't work when it comes to"],["505.36","God. Actually, the childlike humility and faith is the best course of action"],["510.8","when it comes to responding to the word of God. And Jonah is learning this the"],["516.479","hard way. Are you? The word of the Lord comes to Jonah a second time. It says here,"],["525.68","and you know what else that tells us? What does that illustrate?"],["531.2","God's patience, his grace. We disobey and we sin and we doom"],["538.399","ourselves to destruction and yet he keeps saving us and forgiving us over"],["544","and over and over. He puts us back on our feet. He puts us on solid ground and he speaks to us again. Jonah gets spit"],["550.8","out by the fish, put on solid ground, and God gives him a second chance."],["556.64","There was this old fella come to church. This was years ago. Uh his wife was a believer and uh he he liked being in"],["562.72","church. She liked being around church people. And he would listen very carefully to my sermons. But he did not"],["568","believe in God. He didn't believe in in anything that uh about God. He was an atheist, he said. And he would enjoy"],["574.72","writing me letters arguing with me. He'd write me a long dissertation about my sermons and send it to me. And uh he"],["582.64","would come into the office, make an appointment with me, and then we'd sit there and uh he would tell me his life"],["587.92","story and about all of his reasons why he didn't believe. And we would have debates and discussions about the"],["593.839","information. And uh you know, no matter what answers I gave him, no matter what theology I tried to explain to him, no"],["599.68","matter how I answered his questions, I never swayed him from his stubborn belief. And to be honest, I kind of just"],["606.8","gave up on him believing. It's like he had all the information and he just straight up rejected it. He got real"],["612.56","sick and he passed away. And I thought, \"Oh, that's sad cuz now he's going to suffer for all of eternity.\" I gave him"],["618.88","my best shot to try to convince him, but he was just too stubborn to listen. Then"],["624.24","I got word that in the last three weeks of his life when he was in hospice, his"],["629.68","sister took him into her home and cared for him and she was a Christian and she had led him to faith in the final three"],["636.56","weeks of his life. And the Lord says to me, he said, \"See, Rob, don't ever give up on anyone. You never know when"],["644.24","somebody will turn to me.\" God is so much more patient with people than I am."],["649.68","God's patient with Nineveh. And we learned what kind of people they were, what kind of a cruel culture. Remember"],["655.519","that they would, you know, they would just cut their enemies heads off and cut their ears off, nose off, and burn people at the stake and they would just"],["661.92","pile heads up on pikes. They were brutal and violent. Jonah had no desire for those people to get saved. But God did."],["670.24","And he was patient with Nineveh. and he was patient with Jonah. So let's see"],["676.88","what Jonah did. Jonah gets the message, arise, go to Nineveh. Verse three, Jonah arose and went to"],["684.64","Nineveh according to the word of the Lord. Now Nineveh was an exceedingly great city, a three-day journey in"],["691.04","extent. Jonah began to enter the city on the first day walk. Then he cried out"],["696.24","and said, \"Yet 40 days and Nineveh will be overthrown.\""],["702.079","The people of Nineveh believed God, proclaimed a fast, put on sackcloth from the greatest to least. The word came to"],["709.279","the king of Nineveh, and he arose from his throne, laid aside his robe, covered"],["714.72","himself in sackcloth, and sat in ashes, and he caused it to be proclaimed and published throughout Nineveh by the"],["720.64","decree of the king and the noble, saying, \"Let neither man nor beast, herd"],["726.32","nor flock, taste anything. Do not let them eat or drink water, but let man and"],["731.519","beast be covered with sackcloth and cry mightily to God. Yes, let everyone turn"],["736.959","from his wicked way, from his violence that is in his hands. Who can tell if God will turn and relent and turn away"],["744.48","from his fierce anger so that we may not perish? And God saw their works that they turn"],["751.6","from their evil ways. And God relented from the disaster that he said said he would bring upon them. and he didn't do"],["758.8","it. So we see here in verse number four and"],["764.399","five that Jonah enters the city and delivers the message. 40 days Nineveh"],["772.639","will be overthrown. And so it's a interesting detail."],["777.92","Nineveh is very big and it takes three days to journey through it. And Jonah reasons,"],["784.399","well that's the scope of my assignment. I go to Nineveh and I deliver this message. I walk through it. I preach the"],["791.6","gospel and I'm done. That's my job. Three days, that's it. And he gets right"],["797.92","to it. So he goes in there and once first day, 40 days Nineveh will be"],["803.839","overthrown. That's the sermon. Not that long. Very to the point."],["810.399","Ever listened to someone preach a sermon for like 45 minutes and thought, \"Well, you could have said that in 10, kind of"],["816.399","dragged that out.\" I know what you're thinking. You're thinking, \"Well, yeah, kind of every Sunday, Pastor Rob, you know, could speed it up.\""],["824.079","Since I I I grew up in church, I I've heard many boring sermons. So I'm I'm"],["829.519","kind of mindful of the fact that there are people here like me, short attention spans. Uh there's children in the"],["836.72","service and they are as much the audience as you know the 40 to 60 year old people. Uh the kiddos are here. I"],["844.959","got to keep their attention and it has to be relevant to the children what I'm saying as much as it is to moms and"],["850.88","dads. And that's challenging to be relevant to a wide range of ages. But you know what? People of all ages seem"],["857.04","to endure, seem to enjoy stories,"],["862.32","illustrations, talking about your tongue being stuck on screen door."],["868.639","Illustrations and to the point relevant facts. Give them the ra the facts in a"],["874.72","relatable story. Remember who was really good at that? Jesus. That's how he taught, wasn't he?"],["880.399","But regardless of the ability of the preacher, more important than the talent of the orator, what really makes"],["887.12","preaching effective is in fact the work of the Holy Spirit. We can deduce from"],["893.6","narrative passages in scripture that God at different times had divine"],["898.959","appointments set up with people that they were ready to hear the message that God sent them. We think about in Acts"],["906","chapter 16 where uh Paul was trying to go into Asia with the gospel. But then"],["912.48","the spirit withheld him from going uh into Asia and then he got a dream in the"],["917.6","middle of the night from a man in Macedonia saying come to Macedonia and help us. And he deduced from that vision"],["923.6","that God wanted him to go to Europe to Greece to take the gospel. And likewise,"],["929.68","you remember the story of the apostle Philip where he was uh sent by God to"],["935.199","the wilderness to visit one man that Ethiopian uh to share the gospel with"],["940.56","him. The Lord was very specific about where he wanted his servants to go. And when the disciples listened, the people"],["947.199","would receive the word. And God likewise had Nineveh ready to receive his word."],["953.36","And it says on the first day that Jonah cried out day one people believed. There"],["959.759","was no bridges, no built no cult cultural sensitivity training, no"],["966.16","language studies or years of breaking up rocky soil. Just day one, 40 days and"],["973.04","it'll be destroyed. Everyone revival. Everyone just just cried out to God for"],["979.04","repentance. Wouldn't that be nice? Wouldn't that be nice? CF you you start the Bible club there day one and all the"],["985.839","children just hey believe in Jesus' be great uh whatever ministry you're doing."],["992.16","Yeah. Why doesn't that happen? What God wants us to be light and take the"],["997.6","gospel, you know, you preach up here every week and people sit there and reject me the message. Why? Why do we"],["1003.44","have to toil for years in ministry and maybe not see anyone believe in Jesus? Well, it's because what happens here"],["1010.32","with Nineveh, that's a miracle. That's not the norm. Uh you remember the prophet Jeremiah, he didn't have that"],["1017.44","experience. Actually, everybody tried to kill him. He preached and everybody's like, \"Let's kill that guy.\" Uh Isaiah,"],["1023.36","he preached for 30 years, but he was the prophet. And what happened to him? They"],["1028.799","cut him in half, right? They saw him in two and that's how they took care of him. So, we have to remember that these"],["1034.319","narrative passages of scripture with the miracles, they're not telling us what will happen. You know, go down to the"],["1040.72","river and pray like Joshua and the and the PTOIC will spread will split in two. You know, go down there and pray and"],["1047.039","nothing happens. And God's like, well, I didn't tell you to do that. That's why nothing happens. I told Joshua to do"],["1053.28","that, Rob. I didn't tell you to do that. At the river baptism last Sunday, we uh we we get down there and we had uh 10"],["1060.72","people got baptized in the river. It's really cool. But we had a um we had a a a plague of jellyfish."],["1068.16","I I got down there and I looked and this is like jellyfish everywhere. And I I"],["1073.28","turned to Pastor Mark, super spiritual guy, and I says, \"Mark, pray uh that the"],["1080.64","Lord will get these jellyfish out of here so we can have a baptism and open us in prayer.\" So Mark prays, very"],["1085.919","eloquent, very, you know, very spiritledd. And we say, \"Amen.\" And I looked out and the jellyfish are still"],["1091.039","there. So I got to have a conversation with Mark and his relationship with Jesus."],["1100.72","So I just, you know, I did uh plan two. I just pushed them out of the way. I I"],["1106.32","got in the water, kicked jellyfish, and then hustled somebody in and dunked them in the water and got them out. And uh"],["1112.24","most people didn't get stung. A couple people got stung, but we survived it. It was a great time. highly recommend river"],["1119.12","baptisms when there's no jellyfish."],["1125.52","God didn't even tell Jonah Nineveh was going to repent."],["1132.24","He just said, \"Go preach this message.\""],["1137.36","Wasn't Jonah's job to save Nineveh. It was his job to preach the message that"],["1143.12","God gave them. And the same's true for us. What's our job? is to go into all the world and preach the gospel. It's"],["1150.08","not our job to save anyone. Parents, it's not your job to save your children. You you train them up, you"],["1157.52","lead them, they have to decide. That's God's responsibility to speak to them."],["1162.64","And I've always been somewhat baffled by the notion of church growth strategies because, you know, there's always like"],["1168.16","conferences and books you can read, podcasts you listen to, and there's methods and there's ministry programs"],["1173.919","that will help you grow your church. One time uh they said, \"Hey, we're going to do the the this company called they"],["1179.36","said, \"We do these mailouts advertising your church to your community and uh you you we'll we'll send all these mailouts"],["1185.36","to the area and then all these people will hear about your church and they'll come to the church.\" And this is when we were over in the little church uh"],["1191.6","building and I I says to her, um that's great, but we got so many people showing up right now, I can't assimilate them"],["1197.52","fast enough. So, if we do a big mail out uh and more people show up, we we won't"],["1203.12","have any place for them. So, and then she says to me, \"Well, it won't be that effective anyways.\" And then I was like, \"So, so why would we do it? You want me"],["1211.44","to buy this program, but then you tell me it's like you can't have it both ways.\" So, anyways, we have all these"],["1217.28","programs uh that they say, \"Oh, this will grow your church.\" But I always thought that Paul had explained to us"],["1224","how church growth happens. 1 Corinthians chapter 3:5, who then is Paul or who is Apollos? just"],["1232","ministers through whom you believed as the Lord has gave to each one. Paul"],["1238.08","said, \"I planted a pulse water, but who gave the increase?\" God. So neither is"],["1244","he who plants anything or he who waters, but is God who gives the increase. And"],["1249.52","that has been basically our strategy for church growth here at Faith Bible"],["1254.64","Church. And I shared back with the elders when I first came on 2007, I"],["1259.919","interviewed for the position. And I said, \"Here's my here's my big master plan for what we're going to do as a"],["1265.2","church.\" Acts 2:42, we're going to continue in the apostles. Doctrine, prayer, breaking"],["1274.159","of bread, and fellowship. That's what was prescribed in Acts for the church. That's what they did. And"],["1281.6","that's what you have to do to have church. You got to have the doctrine, teaching the word of God. We need to be prayer. We need to have communion,"],["1289.28","remembering or proclaiming the Lord's death till he comes. And we need to have"],["1294.559","fellowship. And I've always used that analogy of a plant's growth. Plants are"],["1303.2","living organisms created by God, created to grow. And when they have the proper"],["1308.72","balance of what? water, soil,"],["1316.159","sunlight, and what's the fourth? You breathe on them. You go talk to your plants. Carbon,"],["1322.559","right? You get that carbon in them. That's this is biology, right? I'm teaching you biology. Those four things"],["1327.919","in their proper amount based on the type of plant and the habitat that it's in, it will grow because it is created to."],["1333.36","And the same is true for churches. Jesus is the cornerstone, the foundation of the church. And he said the gates of"],["1339.6","hell will not prevail prevail against my church. He died and he shed his blood"],["1345.039","for the church. It's God's will for it to grow. And what a church needs to grow"],["1350.159","is the improper amount of doctrine and prayers and breaking of bread and"],["1356.48","fellowship. That's why you have to come to the church picnic and eat some fried chicken with us because that's what God"],["1361.76","wants you to do. And those are the basic elements that you have in order to grow. And so when someone comes along and they"],["1369.039","says, well, you know, we need this program, you know, we need, you know, we need better coffee and donuts and we"],["1375.28","need this style of music and we need to change our branding. Uh those are good ideas, but that's not the main thing. If"],["1383.2","you make that the main thing, but you neglect the four basics, you're not"],["1388.32","going to grow. And even if you do the four basics, you might only grow a little."],["1396.799","Might only grow a little. Most of the land mass in Canada up north is covered"],["1402.48","by tundra. You know what tundra is? It's it's just a you travel far enough north"],["1408.559","and you get to what's called the tree line. And the tree line is where trees stop growing. There's no trees after"],["1413.919","that. And there's just this mossy plant, very small and very thin. But it covers"],["1420.4","all everything. It's just all over northern Canada. And that's the only thing that can live up there. But it can"],["1429.28","live up there and it thrives and uh it doesn't get big like redwood trees in"],["1435.76","California, but it can survive in that environment. Little small plant. Not"],["1442","everything God created is supposed to grow to be a massive redwood tree. And I"],["1448.559","I remind people when they start new ministries, they'll plan an event and they're like, \"I'm going to announce my"],["1454.08","event at um the congregation on Sunday morning, you know, there's like 600 people here uh between the two services"],["1460.559","and they'll be all excited about their event.\" And then five people will show up and they'll be like, \"Well, a church"],["1466.32","of this size, I thought it would be a bigger crowd, pastor.\" And I'm always having this conversation. I said, \"A big"],["1471.679","crowd is not the goal, especially when you're first starting something.\" Actually, a big crowd can be a problem."],["1478.72","You want to build slowly so that you're caring for people, you're meeting needs,"],["1484.48","establishing the proper philosophies of ministry, and installing the right"],["1490","leaders into the positions, trusting that the Lord gives the increase when he"],["1496.96","feels you're ready for it and you can handle it. So, day one, the people hear Jonah's message and everyone repents."],["1505.12","Verse number six, the word came to the king of Nineveh. He rose up, laid aside his robe, covered himself with"],["1510.4","sackcloth, sat in the ashes, because that was the uh in in antiquities, that's the way they showed mourning."],["1516.24","They would take off their fancy clothes and put on some old sackcloth, and then they just dump ashes on their head. And"],["1522.799","that was the way to say, uh, I'm mourning. I'm grieving. Uh, I'm very sad about something. I'm repenting. So"],["1529.76","that's what the king did. And he said to everyone else in Nineveh, he said, \"Let"],["1535.279","man nor beast, nor herd, nor flock taste anything. Don't let them eat or drink water. Let man and beast be covered in"],["1541.12","sackcloth. Cry mightily to God. Yet everyone turn from their evil way and"],["1547.039","the violence of their hands. Who could tell that God will turn and relent and turn away from his fierce anger so that"],["1553.52","we will not perish?\" Now, that is amazing. Getting people to"],["1560","repent of their sin is one thing. Getting a king to repent. That that was"],["1566.4","always the problem with Israel. Uh you remember Jesus, he got the people, he got the crowds, he got the average the"],["1573.2","average citizen was ready to receive him as Messiah. But who wouldn't buy in?"],["1579.279","It was the high priest. The religious leaders, Herod, King Herod. But Herod"],["1585.039","wasn't technically the ruler, right? He was just a puppet king installed by the empire of Rome. It was the high priest"],["1591.76","who was the real power in the nation and they wouldn't repent. The message that they needed to repent, that was"],["1597.84","offensive to them. And that was true for Israel in the Old Testament as well, the"],["1603.279","the kings and the royal courts, the the the prophets would bring the word of the Lord and they would reject the word of"],["1609.279","the Lord. And when Israel had a good king like Josiah or Hezekiah, uh the"],["1615.76","king would be humble and submit to the word of the Lord and then the whole land would experience a spiritual renewal and"],["1621.84","then uh the whole land would be spared and they'd be prosperous. But the northern kingdom of of Israel, the 10"],["1627.52","northern tribes, they never had one good king in all their history. And uh that's why they were just destroyed and uh they"],["1634.32","never listened to the prophet. They were just arrogance. But here we"],["1639.52","have this king of this most powerful evil empire, the Assyrian Empire, and"],["1646.559","he's leading his people to repentance. And he even understands what the issue"],["1652.08","is. What did he say? He said, \"Let everyone turn, verse 8,"],["1657.919","from their evil way and from the violence that is in his hand.\" So he's admitting the fact we're evil and we're"],["1664.48","violent people. Like we already talked about, they we saw the history of the Assyrians. They"],["1671.039","were very very uh wicked. And the king knows what the issue is. And that astounds me because when I hear our"],["1677.279","nation's leaders talk, there there seems to be no real understanding of what the"],["1682.72","core root problems of America are. Right? We talk about the symptoms and then we talk about some ideas how to"],["1688.799","treat the symptoms, but we never get to the root of the problem. Right? the the the the the issue for America, it's not"],["1696.559","our economy. It's not crime or budgets or borders. The main issue is spiritual"],["1704.64","blindness. Americans are on this broad road leading to destruction. And Jesus"],["1710.72","is offering this narrow way that leads to everlasting life. And I just wish, you know, the leaders could figure that"],["1717.84","out and humble and repent and they would turn to Jesus and set that example for"],["1724.399","our nation. But what about us? All well and good to DC. We can't do anything about DC, but what about us? What about"],["1730.72","our homes? What about our families? Do we know what the root problems are? Oh,"],["1736.96","the kids are rebellious. That's the problem. It's these children. Okay. So,"],["1742.399","what's the home life like? I had this friend growing up. He was like super edgy kid. Always had an attitude. He was"],["1748.399","moody, very critical about everything. Hated church, hated school, you know,"],["1754","always arguing. He just make fun of everyone. Just not a nice, kind, peaceful guy. And uh one day I was over"],["1761.12","visiting their house. He was a neighbor. So, I would go over his house and uh him and his sister, they started fighting."],["1767.52","They were yelling at each other. And then their mom started yelling at them."],["1772.799","And uh he started yelling back at his mom. And I was like,"],["1779.36","\"He's going to die."],["1785.2","Pray for him.\" But nothing happened. He yelled at his mom and his mom yelled back and the"],["1791.36","sister yelled more and the dad came in and he yelled at everyone. And I realized that these people just yell at"],["1796.96","each other all the time about everything. Not a bit of wonder he's such a cranky, edgy guy. He's raised in"],["1802.159","this just negative, fighting, edgy environment. That wasn't my home. We did"],["1810.24","not yell at mom and dad. I wasn't yelled at all day long. If I was disobedient,"],["1815.44","there would be seriousness and there would be words and I would be reprimanded. But there was no arguing about anything. There's no yelling about"],["1822.08","it. If I ever yelled at my father, I had just been, you know, knocked into next week and be dead and that would have"],["1829.2","been the end of it. We had very clear, consistent boundaries in our home and I knew where the line was and what was"],["1836.24","tolerated and not tolerated and I wouldn't cross it and that consistency created harmony and peace in our home."],["1843.84","My friend did not have that environment and uh we have to figure out what is the root problems in our homes. Hey, Dad."],["1852.48","Are you modeling the fruit of the spirit? Are you leading in love or are"],["1860","we leading in anger and fear? We can't gloss over that. Everything rises and"],["1866.64","falls on leadership. If the leader won't lead in humility, if all we're doing is"],["1872.399","personifying pride and arrogance, nothing's ever going to change."],["1878.399","Now, you would have expected the king of the nation of Israel to may able to get on board with those ideas. Likewise,"],["1884.799","we'd expect Christian parents who are maybe spiritual leaders, maybe ministry"],["1890.48","leaders, maybe church leaders that they too could quickly assume the position of humility and deal honestly with sin and"],["1898.32","be a leader in admitting wrongs, be a leader at asking forgiveness for"],["1904","offenses that they have perpetrated. I mean, if the pagan, wicked, idol"],["1909.279","worshshiping king of Assyria can see the root problem, surely the spiritfilled children of God could respond"],["1915.679","appropriately, shouldn't we? Uh, another story for you. Uh, years"],["1923.76","back, and some of you remember this fellow, we had an elder who was a former master chief in the Navy, and most of"],["1931.44","his leadership style was rooted in that military mindset. I have a rank and I'm"],["1936.48","in charge and I bark orders and people do what I tell them to do. And while he"],["1941.6","was a phenomenal worker and a a eager servant to our church, he also was like"],["1947.12","quick to speak and was kind of loud and very opinionated. And from time to time"],["1953.44","he would offend people with that tone and people would come to me and say, \"Well, Elder so and so, he said this and"],["1960.24","he acted that way and that kind of offended me.\" And I would say, well, Matthew chapter 18 tells us how to deal"],["1966.799","with offenses. So, uh, it says, if your brother offends you, first you go to him, you tell him what he's done, and if"],["1974.64","he hears you, and he is humble, then great, problem solved. But if he"],["1980.24","doesn't, then come get me. And that's the next step. And the second step is, I'll go with you and we will revisit the"],["1986.32","offense. And they just looked at me like, \"So, you want me to go to Elder"],["1991.919","soandso and confront him on his edgy tone?\" And I'm like, \"Yeah, that's the"],["1997.6","biblical model.\" And they go and the elder would yell at them and kick them"],["2003.84","out of the church. No, he would he would hear them and he would say, \"Oh, yeah,"],["2009.6","okay. I see your point. I wasn't trying to be offensive. I'm sorry. I came across abrasive.\" And then they would be"],["2015.519","fine. and they come back and tell me, \"Yeah, he was great and it was fine.\" And uh they would tell him that, \"Well,"],["2021.679","you know, I was a little nervous, but Pastor Rob told me to go and talk to you oneon- one.\" And and and he's like,"],["2026.72","\"Okay.\" And then that happened again. And by the second time that happened, he came into my office. He says to me, \"You"],["2032.64","know, I would really appreciate it if you'd give me a heads up when you're someone to address me with that they're"],["2038.08","offended with me.\" And I said, \"No, I can't do that.\" And here's why. As an elder, a spiritual leader, you have to"],["2044.32","be able to showcase a spiritfilled servant response to someone. You have to"],["2049.599","be able to reply with humility and grace without being prompted by me. You have"],["2054.639","to have the character qualifications to be an elder, to respond in a Christlike manner to people in real time. But if"],["2062.079","you can't, then you're not qualified to be a spiritual leader. And I need you to"],["2067.119","respond with humility because that's who you truly are. He said, \"Oh, okay. That"],["2072.399","makes sense.\" And he was a wonderful servant who did a great job caring for the people of our"],["2078.24","church, but he was always in Master Chief mode. Does that make sense?"],["2083.839","Jonah, the prophet of the Lord, was outclassed in obedience"],["2088.879","by the sea, a fish, plant, and a worm."],["2095.52","He wouldn't listen to the word of the Lord and it cost him. The people he thought were so evil and deserving of"],["2101.44","God's wrath, even they responded appropriately to the word of the Lord."],["2107.119","So, who are you more like? And if you really want an honest answer on that question, give your family"],["2114.56","permission to answer it. Let your spouse and your kids tell you"],["2121.359","what they're seeing and hearing from you. Do they think you are humble, kind,"],["2128.72","patient? Now, the good news is if you're bombing at that, you can fix it. Humility and"],["2135.68","repentance results in a lot of grace and love real fast with people. Verse number"],["2141.28","10, God saw their works. They turned from their evil ways. And God relented from"],["2148.16","the disaster that he had said he would bring upon them, and he did not do it. God always wants to forgive and restore."],["2154.64","It's who he is. And Jonah knows that and even complains about that. He said in chap chapter 4:2, he said, 'Lord, wasn't"],["2161.839","this what I said when we were still in our country? I fled to Tarsus cuz I know you are so gracious and merciful and"],["2167.359","slow to anger, abundant and loving kindness, one who relents from doing"],["2172.48","harm. That's who God is. And that's what he wants us to model. He wants us to be"],["2179.52","shaped, molded and shaped to be like him. He wants us to be agents of mercy"],["2184.96","and grace with each other, with our families, with our brothers and sisters in Christ, and with our"],["2192.8","lost, needy neighbors in our community, our country,"],["2199.119","the people who are doomed to suffer the wraths of God. God wants to be at peace with them. And Jesus came to die for"],["2205.92","them. And it's our job to share that message and to shine that hope to them."],["2214.079","Will you practice the humility obedience to show everyone what it's supposed to"],["2219.44","look like? Well, Jonah said he would. We'll find out next week if he if he was"],["2226.32","able to keep that spirit. So, come back and we will wrap up the book of Jonah next week. Lord, we just pray thanking"],["2233.359","you for this prophet and the lessons that he learned and the lessons that it"],["2239.119","teaches us about how to uh be obedient to you and how to yield. What's the"],["2246.24","appropriate response to a powerful God to yield and listen and humble and Lord"],["2252.64","that you will use us? You can use our our attitudes and our obedience to reach"],["2258.4","needy, hurting people who you love, who you died for, who you want to see saved."],["2263.599","Lord, we pray for salvation of each and every heart here. We pray for us to be a light into our community, into our"],["2270.56","schools as we go back to school, into our workplaces, in our homes, Lord, that"],["2276.24","we could just be a light to the nation. We pray this in Jesus name. Amen."]]}]