[{"id":"cXNn71Aj72s","name":"2025-04-27  What Is The Blessing For Those Who Study This Book? (Pastor Rob McNutt)","date":"2025-04-27","transcript":[["21.359","My first introduction into the world of"],["24.48","sports came when I was four years old."],["28.32","We had moved uh to Nebraska Bible"],["30.56","Institute. My dad bought a trailer and"],["32.64","we moved right into a trailer court and"],["35.6","it was late August and kids were outside"],["38.32","playing baseball. Also, I went out to"],["40.719","play and to make new friends. I'd never"],["43.68","played a sport before that. This was not"],["46.559","an adult supervised event. There was no"],["49.28","parents, no coaches around, just a bunch"],["51.84","of kids up in a cow field with a bat and"],["54.079","a ball. And four years old, I wandered"],["57.28","over there and I got incorporated into"],["59.52","the game. The big kids let me play. So,"],["62.8","as you can imagine, I was completely"],["64.799","lost what the point was to the game. And"],["68.24","so they had to teach me. This is how"],["69.28","they taught me how to play baseball. All"],["70.32","right, kid. Get over here. Get in line."],["72.56","Here's your You're in line here. And you"],["74.88","get a turn to go up to bat and you get"],["77.439","to take two"],["79.32","swings. And so I got up there and I"],["82.159","swung and I missed and I swung late and"],["85.119","the ball was already by. I was pitiful."],["88.08","I'm four, you know. So I'm four. And uh"],["90.56","so then the big kid Danny says, \"All"],["93.759","right, there you go. You're done. Now"],["95.759","I'll take your third swing for you.\" So"],["98.159","Danny gets the bat and he takes the"],["101.2","pitch and he cranks it into the outfield"],["103.119","and I got to run the bases. So Danny was"],["106.96","basically the MVP, the coach and the"],["108.72","umpire all rolled up in one. He was the"],["110.72","oldest kid in the yard with two younger"],["113.759","brothers. So it was his game. It was his"],["116","world. We were just living in it. So"],["118.96","sure enough, he hit into the outfield"],["120.479","and I got to run the bases. So I didn't"],["122.96","really know what I was doing."],["124.159","Nevertheless, I was out there playing"],["126.6","baseball. I kept going out in the yard"],["129.119","to play sports with the big kids. And as"],["131.12","I grew, I got to understand the games"],["133.52","better. I figured out the rules. And"],["136.239","then one day, I actually got up for my"],["138.52","two pitches. And lo and behold, I"],["141.92","actually hit one for myself and I got to"],["143.68","run the bases. Probably got out because"],["145.44","it was probably a little dribbler, but"],["146.8","whatever, you know. So, for me, that's"],["149.04","been my entire life. basically joining"],["151.04","into something that I have no clue what"],["153.04","I'm doing and just figuring it out on"],["154.959","the fly. See, back in the day, there was"],["157.04","no such thing as YouTube instructional"],["159.239","videos. And when you went into a new"],["161.519","situation, you were just expected to"],["163.36","look around at what everyone was doing"],["165.28","and jump in and do the same thing. Hey,"],["168.239","we're going to go out to work on the"],["170.56","farm, right, kid? get up in that hay mau"],["173.04","and that and we're going to throw bales"],["174.319","of hay at you and we want you to build"],["176","tears and just look at the pattern and"],["178.8","do it and uh you know happen make it"],["182.72","happen and so sure enough they just"],["184.48","start throwing bails ahead you got to"],["186.08","figure it out first time ever preached a"],["187.76","sermon I was candidating to be a youth"],["189.76","pastor at the people's church never"],["191.599","wrote a sermon never preached a day in"],["193.28","my life and I was auditioning for the"],["195.8","job so I was like okay well I guess I'll"],["198.56","just step up here and take my swing"],["200.56","preach a sermon"],["201.76","I was probably a mess, but they gave me"],["204.319","the job anyways. Not sure how that"],["205.92","worked out. This has been my life. I got"],["208.959","married. No clue what I was doing. Just"],["210.72","had to figure it out. Six weeks later,"],["213.36","says I'm pregnant. Okay, so now I got to"],["215.04","figure out being a husband and a dad."],["218.879","Now, the challenge with doing things"],["220.56","this way is"],["223.319","what? I struck out a lot. Made a lot of"],["227","mistakes. Not always sure what I'm"],["229.04","doing. trial and error, lots of failure,"],["231.92","uh a lot of doing it wrong, trying to"],["234.159","figure it out. But here's the concern."],["236.319","What What if I don't? What if I don't"],["239.36","figure it out? Some things are too"],["241.2","important to fail at how to be a good"],["244.239","husband. How to be a good dad wasn't"],["246.879","easy. Could have cost me a great deal to"],["249.92","have struck out on that. Some people"],["252.08","don't figure it out. Some people don't"],["253.28","figure out how to work with others, how"],["255.84","to cope with stress. Many people develop"],["258.32","some maladaptive coping mechanisms, some"],["260.959","bad habits that don't help. They end up"],["263.12","actually hurting themselves, maybe"],["264.8","ruining their lives. So, for a time,"],["267.919","that's exactly what was happening with"],["269.56","me. I jumped into a bunch of stuff and I"],["272.72","was trying to figure it out on my own,"],["274","college, relationships, life, future,"],["276.84","career, and I realized I'm just whiffing"],["280.639","away up here. Just strike it out all"],["282.72","over the place. I was fouryear-old me"],["285.199","all over again, playing the game of"],["287.12","life, swinging and missing. But the"],["290.08","difference this time"],["292.04","was it didn't have to be that way. I had"],["295.52","a lot of information available, but I"],["298.16","was just choosing to ignore it. Matter"],["300.32","of fact, I had someone who once again"],["303.84","would pinch hit for me, who would hit a"],["306.88","home run on my behalf. I just needed to"],["309.039","step back and let him take a swing."],["313.28","This isn't just me I'm talking about."],["315.759","This is all of us. There is distinct"],["319.96","information. There is special revelation"],["323.36","given to us that assures us blessings,"],["326.8","assures us success and prosperity,"],["330","health and happiness, privilege and"],["332.72","protection. If you listen carefully"],["334.8","today, I'm going to tell you what it is."],["338.68","Revelation chapter 22."],["342.32","the last chapter in the last book of the"],["346.24","Bible. And we're going to finish our"],["348.4","study in Revelation today. What a"],["350.88","miracle this will"],["353","be. But we're in verse number six."],["355.919","Revelation 22:6. Then he said to me,"],["358.56","this is an angel speaking to John. These"],["360.479","words are faithful and true. The Lord"],["362.16","God of the holy prophets sent his angel"],["364.639","to show his servant the things which"],["366.479","must shortly take place. Behold, I am"],["369.919","coming quickly. Blessed is he who keeps"],["371.84","the words of the prophecy of this book."],["374.479","Now I, John, saw and heard these things."],["377.84","And when I heard and saw, I fell down to"],["380.08","worship before the feet of the angel who"],["381.6","had showed me these things. Then he said"],["383.759","to me, \"See that you don't do that. For"],["385.919","I am your fellow servant, and your"],["387.919","brethren, the prophets, and of those who"],["390.639","keep the words of the book, worship"],["392.919","God.\" And he said to me, \"Do not seal up"],["396.16","the words of the prophecy of this book,"],["398","for the time is at hand. He who is"],["400.28","unjust, let him be unjust still. He who"],["402.96","is filthy, let him be filthy si still."],["405.44","He who is righteous, let him be"],["406.8","righteous still. He who is holy, let him"],["409.36","be holy still. Behold, I come quickly,"],["413.199","and my reward is with me to give to"],["415.6","everyone according to his work. I'm the"],["417.84","alpha and omega, the beginning and the"],["420.319","end, the first and the last. Blessed are"],["423.36","those who do his commands that they may"],["427.039","have the right to the tree of life and"],["429.28","may enter through the gates into the"],["431.199","city, but outside are the dogs and the"],["434","sorcerers, sexually immoral, the"],["435.52","murderers, the idolattors, and whoever"],["437.12","loves and practices a lie. I, Jesus,"],["440.479","have sent my angel to testify to you of"],["443.759","the things in the churches. I am the"],["446.08","root and the offspring of David, the"],["449.36","bright and morning star. And the spirit"],["451.84","and the bride say, \"Come.\" And let him"],["454.639","who hears say, \"Come.\" And let him who"],["457.52","thirst come. Whoever desires, let him"],["460.319","take the water of life freely. For I"],["462.96","testify to everyone who hears the word"],["465.12","of the prophecy of this book. If anyone"],["467.199","adds to these things, God will add to"],["469.12","him the plagues that are written in this"],["470.479","book. If anyone takes away from the"],["472.24","words of this book of this prophecy, God"],["474.72","shall take away his part in the book of"],["477.44","in the book of life from the holy city"],["479.68","and from the things which are written in"],["481.68","this book. He who testifies to these"],["484.8","things says surely I come quickly. Amen."],["489.039","Even so, come Lord Jesus. And then the"],["491.52","benediction, the grace of the Lord Jesus"],["493.199","Christ be with you all. Amen."],["498.4","John says in verse number eight, I John"],["500.8","saw and heard these things. So that the"],["503.28","question is what"],["506.039","things? Everything that we have studied"],["508.639","for the last year. We're right back"],["511.52","where we started. Revelation 1, the"],["514.959","first chapter, the revelation of Jesus"],["517.44","Christ that God gave him to show his"],["519.519","servants things which must shortly take"],["521.519","place. And he sent and signified it by"],["523.919","his angel to his servant John who bore"],["526.959","witness to the word of God to the"],["528.88","testimony of Jesus to all the things he"],["531.12","saw. Blessed is he who hear reads and"],["534.56","those who hear the words of this"],["536.24","prophecy and keep those things which are"],["538.959","written in it for the time is near. The"],["542.959","message to the seven"],["545.56","churches, these things, the scene at the"],["549.68","throne room, the"],["552.12","seven seal judgments, the seven"],["554.8","trumpets, the various entities that we"],["557.6","saw, the two witnesses, the 144,000"],["560","sealed, the the beast, the dragon, the"],["562.32","false prophet, the harlot riding the"],["564.24","beast, the seven final bull judgments,"],["566.72","the return of Jesus, the battle of"],["568.88","Armageddon, the millennial kingdom, the"],["570.8","great white throne judgment, the new"],["572.72","heaven and the new earth. These are the"],["574.959","things that John has seen and heard. The"],["579.44","point of studying the whole book is to"],["582.64","learn all the details to know and"],["585.2","understand the information but"],["588.12","also to gain the blessing spoken of at"],["591.839","the beginning of the book. Revelation"],["594.279","1:3, blessed is he who reads and who"],["597.279","hears the words of the prophecy and"],["599.279","keeps the things that are written. And"],["601.519","then again at the end of the book, the"],["603.68","last chapter, blessed is he, chapter"],["606.6","22:7, blessed is he who keeps the words"],["608.88","of the prophecy, reads the words of the"],["611.12","prophecy and keeps them. Chapter"],["613.16","1. Chapter 22, same thing. And then"],["617.2","again in chapter 22:12, he says, \"I come"],["620.16","quickly and my reward is with me to give"],["622.959","to those according to their works.\" And"],["625.04","again chapter 22:14, blessed are those"],["628.16","who do his commandments that they have"],["630.16","the right to the tree of life and may"],["632.079","enter through the gate to the city. So I"],["634.079","think ch verse 14 clears up any"],["636.48","confusion as to what John means by"],["638.72","keeping the words. He says"],["642.6","who do blessed is he who does the"],["647.88","commandments. That's the challenging"],["649.959","part. The doing. The doing, obeying is"],["653.44","the proof that you believe the word."],["655.6","When God gives commands, instructions,"],["658.32","directives, how we respond is the"],["661.2","evidence, is the proof that we really do"],["663.92","believe him. I found out the hard way"],["666.64","that not keeping, not doing the"],["668.64","commandments just resulted in me"],["671.12","striking out in life. Then I determined,"],["674.48","let's actually, I don't try doing, try"],["678.56","keeping the commandments. Let's see what"],["680.24","happens if I actually do things God's"],["682.8","way. If I exercise just a modicum of"],["685.24","discipline, make an effort, put into"],["688","practice all this stuff that I was"],["690.36","taught. So I started implementing the"],["694.959","main things I implemented"],["698.2","prayer, regular church attendance,"],["701.36","giving a percentage of my earnings from"],["703.04","Red"],["704.279","Lobster. worked at Red Lobster, took my"],["707.519","ties, gave it to Gave it to God, serving"],["711.56","others, and then the hardest of"],["714.92","all, practicing"],["717.88","self-discipline,"],["719.64","self-control. All the things I was"],["721.519","instructed to do for my formative years,"],["723.279","all the things I resisted doing, I"],["725.12","repented of my disobedience, rebellious"],["727.12","attitudes, and I said, \"God, I'll do"],["728.639","things your way, and let's see what"],["730.639","happens.\" What happened was my life"],["733.6","changed for the better in everything I"],["736.959","was involved in. I earned the best"],["739.04","grades I'd ever earned in my life. I had"],["742.32","the most impactful soccer season,"],["745.2","finished my college sports days, winning"],["748.12","awards. I made the best money at Red"],["751.16","Lobster and paid my school bill. And I"],["754.16","had enough money left over, which came"],["756.16","in real handy because I started dating"],["757.68","this young lady. And apparently I had"],["759.44","illustrated enough maturity that she"],["760.72","took me serious enough to eventually"],["762","marry"],["763.16","me. What a blessing. Maybe not for her,"],["766.24","but for me it was a"],["768.76","blessing. So what I experienced was an"],["772.48","amazing turnaround. It was so obvious. I"],["774.959","could not deny it. Keeping God's word"],["778.079","brought me lifechanging blessings. Now"],["780.959","I'd heard that my whole life, but I"],["783.04","never actually put it into"],["785.399","practice. Committing my way to the Lord."],["787.92","Proverbs 3:5 and 6 says, you know this"],["791.44","one, trust in the Lord with all your"],["794.48","heart. Lean not on your own"],["796.16","understandings. In all your ways"],["798.079","acknowledge them, and he will make he"],["800","will direct your"],["801.399","paths. Do not be wise in your own eyes."],["804.639","Fear the Lord. Depart from evil. It'll"],["806.959","be health to your flesh, strength to"],["809.76","your bones. Honor the Lord with your"],["812.079","your possessions and with the first"],["813.519","fruits of your increase so that your"],["816.079","barns will be filled with plenty and"],["817.92","your vats will overflow with new wine. I"],["820.639","knew those verses. I memorized them in a"],["822.48","wana, but I wasn't keeping them. But"],["824.8","once I did, my life"],["827.32","changed. Now, there are and there have"],["830","been times along the way in areas of my"],["832.079","life I deviated from keeping God's word."],["835.279","Disobedience and sin I got involved in"],["838.88","and I paid for it. The pain and the near"],["842.68","destruction I almost experienced serve"],["845.6","to remind me the blessings are there for"],["847.839","those who keep the words of life. But"],["850.639","the pain and destruction is also waiting"],["853.279","if I choose to rebel. On the one hand,"],["856.72","the blessings motivate me to trust in"],["858.8","the Lord. On the other hand, the peer"],["860.959","the the pain and the fear of failure"],["862.88","provokes me to obey. I've experienced"],["866.76","both. I know which one I prefer. I've"],["870.079","had plenty of experience with failure"],["871.6","and rejection, being poor and weak,"],["874","being in a place of despair and"],["875.6","confusion. I've stood at the plate with"],["877.839","two strikes and came to the realization"],["880.399","I got no chance of hitting this ball. I"],["882.88","can't do this on my own. But God said,"],["885.04","if you let me, I'll I'll pinch it for"],["888.079","you. and let me take your last"],["891.399","swing. If you stop doing it in your own"],["893.92","strength, if you stop leaning on your"],["895.519","own understanding, if you let go and let"],["898.56","God have his way, he's going to hit a"],["901.04","home run for"],["902.279","you. We used to sing a little chorus in"],["904.639","church. If any of you remember this one,"],["906.959","let the Lord have his way in your life"],["909.519","every day. There's no rest. There's no"],["911.44","peace till the Lord has his way. Place"],["914.079","your life in his hands. rest secure in"],["917.68","his plans. Let the Lord let the Lord"],["920.88","have his way. I've been telling you,"],["923.44","Faith Bible Church, for 18 years now, if"],["927.6","you want the blessings of God, you need"],["929.92","to do the things that God blesses. He"],["933.839","blesses obedience and the keeping of his"],["936.48","word. This past Thursday, we had a"],["939.76","special congregational meeting that I"],["942.16","wanted to share with you all because"],["944.24","only 50 people showed up for the"],["945.839","congregational meeting, which means a"],["947.12","lot of you didn't find out what was"],["948.56","going on. So, we gave a financial"],["950.32","report. Uh, so far in 2025, we have put"],["956.6","$200,000 back into our emergency uh"],["959.839","savings fund, special account sitting"],["962.16","there. We spent 144,000 on projects and"],["966","improvements going on around here. And"],["968.16","after all of that and all of our"],["971.12","budgeted commitments have been met to"],["973.959","date, we still have an additional"],["976.399","$200,000 sitting in our checking"],["977.92","account. Since we have so much blessing,"],["981.199","the request was from the elders. Can we"],["984.56","go over and above our current missionary"],["987.279","budget and give away an extra five"],["991.16","$50,000 to missionaries who have some"],["994.16","challenging obstacles that we could help"],["995.759","them overcome. We can get some vehicles"],["997.6","to help them reach the needy villages"],["1000.16","and take the resources to the people and"],["1003.04","more importantly the gospel to needy"],["1006.16","people in hard-to-reach areas. And after"],["1009.199","detailing the blessings that God has"],["1010.8","poured out on us and explaining the"],["1012.32","needs of his children, his servants who"],["1015.12","are out there building the kingdom of"],["1016.48","God around the world, what did the"],["1018.32","members of Faith Bible Church vote to"],["1020.44","do? They voted unanimously to give away"],["1025.88","$50,000 just like that. Because time and"],["1029.52","time again, we have seen God prove"],["1032.48","himself to us. We have tested and proven"],["1035.439","this principle. If you want to be"],["1037.199","blessed by God, you simply, what do you"],["1039.48","do? Do the things that he blesses. We"],["1042.48","are blessed to be a blessing. We love"],["1046","God by loving others. We serve God by"],["1049.84","serving others. We give to God by giving"],["1053.52","to others. And every time in obedience,"],["1057.679","when we take one of those steps of"],["1059.2","faith, Faith Bible Church just receives"],["1061.6","more and more blessings. What What do I"],["1064.24","mean? Faith Bible Church gets more"],["1066.799","blessings. What What What exactly does"],["1068.88","those blessings look like? Well, it"],["1071.039","looks like all those babies in the"],["1073.6","nursery for starters. New babies. Oh,"],["1076.64","every time you turn around, somebody"],["1077.919","just walks in here with a new baby and"],["1079.12","sits behind you. Every Sunday that"],["1081.12","happens, all the children in the in the"],["1083.6","classes, all the families coming"],["1085.44","together for worship and to serve. A big"],["1088.32","church family celebration. and over 600"],["1090.72","people attended services last week to"],["1093.2","celebrate the resurrection of our Lord"],["1094.96","and Savior Jesus Christ. We were blessed"],["1097.36","when not preachers but just some"],["1099.679","ordinary guys in our congregation shared"],["1102.16","their testimonies at the sunrise service"],["1104","about how despite grief and sorrow,"],["1106.64","failure and loss, nevertheless the Lord"],["1109.679","heals and helps and saves. Blessings"],["1113.76","look like healing and miracles that we"],["1118.52","see. People who we go to visit in the"],["1121.679","hospital and ICU and now they're sitting"],["1125.84","here"],["1126.919","today worshiping with"],["1129.24","us. Miracles, people recovering from pa"],["1132.559","cancer, people recovering from"],["1134.16","addictions. Last week a young man's"],["1136.08","appendix burst. This week he's home safe"],["1138.64","and sound recovering."],["1140.64","Blessings for the church looks like"],["1142.88","people going out into the community to"],["1145.36","serve the least of these. Reviving a"],["1148.48","struggling sister church going to"],["1151.039","Kentucky to rebuild homes. That story"],["1153.679","Chrissy told us about that young gal"],["1156.32","whose baby was born and that child has"],["1158.64","hope for the future. Hosting a"],["1160.88","conference that is attended by people"],["1162.799","from 26 different states plus Canada."],["1165.84","And they're asking why is this happening"],["1168.24","down here? This church in the middle of"],["1170.48","nowhere is Mechanicsville. Why? Why is"],["1173.039","this happening here? I don't know."],["1176.72","Blessings look like broken marriages"],["1178.96","being saved and restored. People who are"],["1181.12","struggling with anxiety and depression,"],["1183.44","finding faith, hope, and love. Blessings"],["1186.96","is hundreds of people lifting their"],["1189.12","voices in praise, worshiping together in"],["1191.6","unity. I can go on and on and on about"],["1194.32","what blessings mean for me in my life"],["1197.039","and for this church collectively. But"],["1199.2","what are the blessings for you"],["1201.36","personally and specifically as they"],["1203.44","pertain to the book of Revelation as"],["1205.919","you've sat here for 13 months and"],["1207.679","learned the meaning of this book? How do"],["1209.84","these messages, these details, how do"],["1212.559","they bless you?"],["1215.44","Verse"],["1217.08","7"],["1219.88","says, \"Behold, I come quickly. Blessed"],["1223.12","is he who keeps the prophecies of this"],["1227.159","book. I've said it over and over again"],["1229.84","in this study. I know the future. I've"],["1234.32","been telling you the future.\" What"],["1236.799","blessing, what advantage is there to"],["1238.88","knowing the"],["1240.2","future? Well, think about it. when when"],["1243.039","Congress is going to make some big law,"],["1246","some change that the rest of the country"],["1248.08","doesn't know about yet, it's going to"],["1249.679","happen. People with that insider"],["1252.36","information, they buy or sell stocks and"],["1256.559","they profit off of the information based"],["1258.799","on what they know is coming in the"],["1260.32","future. If you could go back to"],["1263.08","2012, probably you would say, I should"],["1267.12","buy a bunch of"],["1268.52","Bitcoin, right?"],["1271.2","And the other side is true. Knowing the"],["1273.6","future also helps you know what pitfalls"],["1276.88","and disasters to avoid. Like on March"],["1280.96","26, 2024, avoid the key"],["1283.88","bridge. Last January, American Airlines"],["1287.679","flight"],["1289.559","5324. Let's not get on that"],["1292.44","one. Avoiding disasters like casting"],["1296.4","Rachel Ziggler to be Snow White. You can"],["1298.799","avoid that."],["1303.039","The things you about knowing the future"],["1305.6","is you know what to do and what not to"],["1308.72","do. You can prosper from knowing the"],["1311.679","future. You can protect yourself and"],["1313.76","your loved ones because you know the"],["1315.36","future. That information, that inside"],["1317.799","track, that blessing is sitting right"],["1320.72","here in your lap. And this is the"],["1323.2","blessing one receives from studying the"],["1325.76","book of Revelation. Like we sung at the"],["1328.4","sunrise service, because he lives, I can"],["1332.36","face tomorrow. Because he lives, all"],["1335.44","fear is gone because I know he holds the"],["1339.039","the future. Life's worth a living"],["1342.32","because he lives. The revelation of"],["1345.28","Jesus Christ tells us all about the"],["1347.28","future. We know how it all"],["1349.4","ends. Upon receiving all this"],["1352.4","information spoken to him by the"],["1353.799","prophet, the revelation comes to an end."],["1357.36","And now John being in utter awement,"],["1361.52","what does he do? Just falls down to"],["1365.44","worship at the feet of the messenger,"],["1367.52","the angel who is speaking to him. Verse"],["1370.799","number eight, I saw and I heard these"],["1374","things. And when I saw and heard, I just"],["1376.24","fell down for the defeated angel who was"],["1379.36","showed me these things. But he said to"],["1381.679","me, \"See that you don't do that, for I"],["1384.48","am your fellow servant, and your"],["1386.24","brethren, the prophets, and of those who"],["1388.64","keep the words of the book, worship"],["1391.159","God.\" The angel says, \"I'm just a fellow"],["1393.679","servant. We're all fellow servants,"],["1395.12","angels, prophets, those who keep the"],["1396.96","words. We're all servants. And we are"],["1400.4","all to"],["1401.88","what? Worship God."],["1404.559","And that would be the second thing I"],["1406.159","hope that this study has inspired you to"],["1408.159","want to do. Worship God, keep his word,"],["1412.159","and then join in with all the saints and"],["1415.2","angels as they bow before the throne."],["1418.24","All the elders cast their crowns before"],["1420.72","the lamb of God and sing, \"You're worthy"],["1423.44","of it all. You're worthy of it all. For"],["1426.799","from you are all things, and to you are"],["1429.919","all things. You deserve the glory."],["1433.679","I know I'm never going to be perfect in"],["1437.28","my obedience to God. I have all these"],["1440.64","instructions, commands, and wisdom, but"],["1443.2","I'm still just a kid swinging and"],["1447.88","missing, doing it wrong, failing tests,"],["1450.48","learning the hard way. Nevertheless,"],["1452.72","somehow it always works out for me. And"],["1456.4","you want to know why? Because of this"],["1458.96","promise that God made. Romans 8:28. We"],["1462.32","know that all things work together for"],["1465.6","good for those who love God and those"],["1468.159","who are called according to his"],["1470.159","purposes. See, God bats clean up for us."],["1475.039","The Psalmist says, God says, \"Call on me"],["1478","in the day of trouble and I will deliver"],["1480.4","you and you will glorify me. Call on me,"],["1483.6","Jeremiah 33:3, and I will answer you."],["1486.159","I'll show you great and mighty things"],["1488.159","which you do not know.\" We worship him"],["1491.36","and he blesses us. I serve him and he"],["1495.279","fulfills these promises to me. See,"],["1499.36","here's the thing about believing God's"],["1501.2","word and keeping God's word. You know"],["1502.559","who else keeps God's"],["1504.279","word? God keeps God's word. God does and"],["1509.52","is always faithful to his promises. Paul"],["1513.039","writes in second Timothy, \"If we are"],["1515.2","faithless, he's quits on us.\""],["1519.44","No, he's faithful. He cannot deny"],["1523.2","himself. So even if we're not perfect,"],["1525.679","he"],["1526.52","is. Verse number 10. And he said, \"Do"],["1529.76","not seal up the words of the prophecy of"],["1531.52","this book, for the time is at hand. He"],["1534.559","who is unjust, let him be unjust still."],["1537.12","He who is filthy, let him be filthy"],["1538.559","still. He who is unrighteous. He who is"],["1540.559","righteous, let him be righteous still."],["1542.08","And he who is holy, be holy"],["1544.919","still.\" Don't seal up the prophecies."],["1547.279","Meaning Jesus wants us to have this"],["1548.96","information, this inside scoop because"],["1550.96","this information is going to bless us if"],["1554.24","we keep it. So the question is, are we"],["1556.559","smart enough to take advantage of this"],["1559.08","information or ignore it? And the choice"],["1563.84","is there. That's what verse 11 is"],["1566.159","talking about when he"],["1568.84","says, \"He who is unjust, be unjust"],["1571.36","still. He is filthy be filthy still. Who"],["1573.2","is righteous be righteous still. He was"],["1575.919","holy. Be holy"],["1578.12","still. And behold, I come quickly, and"],["1581.12","my reward is with me to give to everyone"],["1583.44","according to his work, the Alpha and"],["1585.44","Omega, the beginning and the end, the"],["1587.279","first and last. Blessed are those who do"],["1590.4","his commandments, that they may have the"],["1592.799","right to the tree of life, and may enter"],["1594.64","through the gates into the city. But"],["1596.32","outside are the dogs and sorcers,"],["1598.559","sexually immoral, the murderers, the"],["1600.08","adulterers, and those whoever loves and"],["1602.799","practices a lie. I Jesus have sent my"],["1605.279","angel to testify to you these things in"],["1607.279","the churches. I am the root and the"],["1609.039","offspring of David, the bright and"],["1610.88","morning star and the spirits and the"],["1613.84","bride say come and let him who hears say"],["1617.36","come and let him who thirst come."],["1619.679","Whoever desires let him take the water"],["1622.24","of life freely. So the offer is extended"],["1626.96","to us all to come and take freely of the"],["1630.4","lifegiving water. Jesus the living"],["1633.36","water. Jesus declares that he is the one"],["1636.32","who has all the power and authority to"],["1639.679","do all of these things. He is the alpha"],["1642.24","and the omega, the beginning and the"],["1645.52","end, the first and the last. That means"],["1648.24","he creates us. He sustains us. And in"],["1651.279","the end, he rewards"],["1653.88","us. You're not going to get away. You're"],["1657.679","not going to get to the end of life and"],["1659.52","discover someone other than Jesus. Oh,"],["1662.799","actually, you know, there's this whole"],["1664","pantheon of gods, of deities, and they"],["1666.799","all can vote and change Jesus decrees."],["1670","No, Jesus is not some lower court, but"],["1673.52","there's another whole higher court above"],["1675.279","him that will change everything Jesus"],["1677.2","said. There is no other name."],["1682","Days after the resurrection, the"],["1683.52","disciples of Jesus preached the gospel"],["1685.84","and they had the power to heal people"],["1688","and they healed this lame man. And this"],["1690.08","greatly upset the leaders in Jerusalem"],["1692.32","who had rejected Jesus believing that"],["1694.32","they had already had the way to God and"],["1696.08","Jesus was just a false messiah. But even"],["1699.12","after he was dead and gone, the his"],["1702","disciples are now back and they're"],["1703.52","ministering in his name. And they healed"],["1705.12","this man. And as a result, 5,000 people"],["1708.08","put their faith in Jesus. And and and"],["1710.24","they arrested the disciples and they"],["1712","brought them in. This is Acts chapter 4."],["1714","And they demanded to know by what power"],["1716.159","and by what name have you done this? And"],["1718.72","then Peter being filled with the Holy"],["1720.64","Spirit said, \"Rulers of the people of"],["1722.72","the elders of Israel, if we this day are"],["1725.84","judged for a good deed done to this"],["1727.84","helpless man, by what means he has been"],["1730.48","made well, let it be known to you to all"],["1732.96","the people of Israel. But by the name of"],["1735.2","Jesus Christ of Nazareth, whom you"],["1737.72","crucified, God is raised from the dead."],["1740.32","By him, this man stands before the"],["1742.96","whole. This is the stone which you"],["1745.36","rejected by the builders, which has"],["1747.2","become the chief cornerstone. Neither is"],["1750","there salvation in any other. For there"],["1752.159","is no other name under heaven given"],["1754.559","among men whereby we must be saved. This"],["1758.72","is what the book of Revelation confirms"],["1761.12","for us. Jesus is the son of man and the"],["1765.12","son of God. Jesus said, \"I am Jesus sent"],["1768.799","my angel to testify to you on these"],["1771.36","things to the churches. I am the root"],["1774","and offspring of David, the bright and"],["1776.88","morning star. Jesus unites God and"],["1780.84","humanity. A son of man sits on the"],["1784.08","throne of God and rules everything given"],["1787.2","to him by his father. And though we are"],["1790.88","mere mortals, fallen sinful finite"],["1794.64","beings, through faith in Jesus, we are"],["1797.52","elevated to the position of sons and"],["1800.08","daughters of the most high God. We are"],["1802.64","made infinite. We are given eternal life"],["1805.679","that Jesus has the power to give us. And"],["1810","the spirit and the bride say come. And"],["1811.84","let him who hears say come. And let him"],["1814","who is thirsty, whoever desires, take of"],["1816.96","the water of life. The blessing is"],["1820.12","here to"],["1822.12","take. But for some reason, not everyone"],["1825.36","likes this book. People have been trying"],["1827.84","to change, redact, dismiss, discard,"],["1830.679","disavow this revelation since John"],["1833.84","penned it. And he gives a warning for"],["1835.279","that. Verse 18, I testify to everyone"],["1837.52","who hears the words of this prophecy of"],["1839.12","this book. If anyone adds to these"],["1841.36","things, God will add to him the plagues"],["1843.36","that are written in the book. If anyone"],["1844.96","takes away the words of this prophecy,"],["1846.88","God will take away his part in the book"],["1849.679","of life, from the holy city, and from"],["1851.919","the things that are written in this"],["1853.039","book."],["1854.559","So there's great blessings for those who"],["1856.48","keep the words, but there's great curse"],["1858.88","for those who alter the"],["1862.36","words. There's no changing"],["1865.32","this. There's no changing there. There's"],["1868.32","no parallel universe that we can branch"],["1871.52","off into where this future does not come"],["1873.76","to pass. This is it. This is what's"],["1877.039","coming. Accept it. Reject it. You're"],["1880.399","never going to stop it. Jesus is coming"],["1882.799","back. Amen. And Jesus is going to"],["1886.2","reign. He says, \"He who testifies to"],["1889.76","these things, surely I come quickly."],["1893.6","Amen. Even so, come Lord Jesus.\" And"],["1897.96","then John gives a benediction. The grace"],["1901.6","of the Lord Jesus Christ be with you"],["1904.279","all. Grace is God's unmmerited favor."],["1908.88","You did not earn it, but God freely"],["1911.84","offers it to us all. Dear friend, what"],["1915.36","I'm about to tell you next, you know is"],["1917.399","true. One day, your life will come to an"],["1920.64","end and you will have no more"],["1923.48","metaphorical"],["1925","atbats. Death comes to us all and we all"],["1929.039","strike out. You cannot hit a home run"],["1930.96","off of death. However, Jesus is ready,"],["1933.76","willing, and able to step up and knock"],["1936.72","one out of the park for you. so that you"],["1938.799","could win in the game of life. God's"],["1940.64","blessings are right"],["1942.519","here. Take them and believe"],["1946.36","them. May the grace of the God, may the"],["1949.279","grace of the Lord Jesus"],["1950.84","Christ be with you"],["1953.32","all. And thus ends the book of"],["1956.279","Revelation. So what a"],["1960.919","miracle. Let's turn in prayer. Every"],["1964.48","head bowed and every eye closed as our"],["1966.159","praise team comes to wrap things up for"],["1969.08","us. The big takeaway here from the"],["1971.919","beginning to the end is the blessings"],["1974.159","for those who do the words. And we just"],["1977.919","pray that everyone here, if you've not"],["1980.799","doing these words, if you're not"],["1982.159","believing, if you're not trusting, that"],["1984.24","you would take this time to confess that"],["1987.279","to God. Ask for the strength, ask for"],["1989.84","the faith to step out and do what he"],["1992.399","tells you. do what he asked so that you"],["1995.76","could have these blessings. All of you"],["1998.08","folks in here, all of our families, we"],["2000.64","pray Lord Jesus that you each and every"],["2003.039","soul, each and every home that we would"],["2005.36","hear the words and we would apply them"],["2007.84","to our lives, that we will know the"],["2009.919","truth and the truth will set us free."],["2012","Thank you, Jesus, for all you've done"],["2013.76","and all that you offer. May we come to"],["2016.399","you now boldly receiving that living"],["2019.44","water, receiving this hope and truth for"],["2022.08","all of eternity. Praying in Jesus name."],["2025.279","Amen."]]},{"id":"cXNn71Aj72s","name":"2025-04-27  What Is The Blessing For Those Who Study This Book? (Pastor Rob McNutt)","date":"2025-04-27","transcript":[["21.359","My first introduction into the world of"],["24.48","sports came when I was four years old."],["28.32","We had moved uh to Nebraska Bible"],["30.56","Institute. My dad bought a trailer and"],["32.64","we moved right into a trailer court and"],["35.6","it was late August and kids were outside"],["38.32","playing baseball. Also, I went out to"],["40.719","play and to make new friends. I'd never"],["43.68","played a sport before that. This was not"],["46.559","an adult supervised event. There was no"],["49.28","parents, no coaches around, just a bunch"],["51.84","of kids up in a cow field with a bat and"],["54.079","a ball. And four years old, I wandered"],["57.28","over there and I got incorporated into"],["59.52","the game. The big kids let me play. So,"],["62.8","as you can imagine, I was completely"],["64.799","lost what the point was to the game. And"],["68.24","so they had to teach me. This is how"],["69.28","they taught me how to play baseball. All"],["70.32","right, kid. Get over here. Get in line."],["72.56","Here's your You're in line here. And you"],["74.88","get a turn to go up to bat and you get"],["77.439","to take two"],["79.32","swings. And so I got up there and I"],["82.159","swung and I missed and I swung late and"],["85.119","the ball was already by. I was pitiful."],["88.08","I'm four, you know. So I'm four. And uh"],["90.56","so then the big kid Danny says, \"All"],["93.759","right, there you go. You're done. Now"],["95.759","I'll take your third swing for you.\" So"],["98.159","Danny gets the bat and he takes the"],["101.2","pitch and he cranks it into the outfield"],["103.119","and I got to run the bases. So Danny was"],["106.96","basically the MVP, the coach and the"],["108.72","umpire all rolled up in one. He was the"],["110.72","oldest kid in the yard with two younger"],["113.759","brothers. So it was his game. It was his"],["116","world. We were just living in it. So"],["118.96","sure enough, he hit into the outfield"],["120.479","and I got to run the bases. So I didn't"],["122.96","really know what I was doing."],["124.159","Nevertheless, I was out there playing"],["126.6","baseball. I kept going out in the yard"],["129.119","to play sports with the big kids. And as"],["131.12","I grew, I got to understand the games"],["133.52","better. I figured out the rules. And"],["136.239","then one day, I actually got up for my"],["138.52","two pitches. And lo and behold, I"],["141.92","actually hit one for myself and I got to"],["143.68","run the bases. Probably got out because"],["145.44","it was probably a little dribbler, but"],["146.8","whatever, you know. So, for me, that's"],["149.04","been my entire life. basically joining"],["151.04","into something that I have no clue what"],["153.04","I'm doing and just figuring it out on"],["154.959","the fly. See, back in the day, there was"],["157.04","no such thing as YouTube instructional"],["159.239","videos. And when you went into a new"],["161.519","situation, you were just expected to"],["163.36","look around at what everyone was doing"],["165.28","and jump in and do the same thing. Hey,"],["168.239","we're going to go out to work on the"],["170.56","farm, right, kid? get up in that hay mau"],["173.04","and that and we're going to throw bales"],["174.319","of hay at you and we want you to build"],["176","tears and just look at the pattern and"],["178.8","do it and uh you know happen make it"],["182.72","happen and so sure enough they just"],["184.48","start throwing bails ahead you got to"],["186.08","figure it out first time ever preached a"],["187.76","sermon I was candidating to be a youth"],["189.76","pastor at the people's church never"],["191.599","wrote a sermon never preached a day in"],["193.28","my life and I was auditioning for the"],["195.8","job so I was like okay well I guess I'll"],["198.56","just step up here and take my swing"],["200.56","preach a sermon"],["201.76","I was probably a mess, but they gave me"],["204.319","the job anyways. Not sure how that"],["205.92","worked out. This has been my life. I got"],["208.959","married. No clue what I was doing. Just"],["210.72","had to figure it out. Six weeks later,"],["213.36","says I'm pregnant. Okay, so now I got to"],["215.04","figure out being a husband and a dad."],["218.879","Now, the challenge with doing things"],["220.56","this way is"],["223.319","what? I struck out a lot. Made a lot of"],["227","mistakes. Not always sure what I'm"],["229.04","doing. trial and error, lots of failure,"],["231.92","uh a lot of doing it wrong, trying to"],["234.159","figure it out. But here's the concern."],["236.319","What What if I don't? What if I don't"],["239.36","figure it out? Some things are too"],["241.2","important to fail at how to be a good"],["244.239","husband. How to be a good dad wasn't"],["246.879","easy. Could have cost me a great deal to"],["249.92","have struck out on that. Some people"],["252.08","don't figure it out. Some people don't"],["253.28","figure out how to work with others, how"],["255.84","to cope with stress. Many people develop"],["258.32","some maladaptive coping mechanisms, some"],["260.959","bad habits that don't help. They end up"],["263.12","actually hurting themselves, maybe"],["264.8","ruining their lives. So, for a time,"],["267.919","that's exactly what was happening with"],["269.56","me. I jumped into a bunch of stuff and I"],["272.72","was trying to figure it out on my own,"],["274","college, relationships, life, future,"],["276.84","career, and I realized I'm just whiffing"],["280.639","away up here. Just strike it out all"],["282.72","over the place. I was fouryear-old me"],["285.199","all over again, playing the game of"],["287.12","life, swinging and missing. But the"],["290.08","difference this time"],["292.04","was it didn't have to be that way. I had"],["295.52","a lot of information available, but I"],["298.16","was just choosing to ignore it. Matter"],["300.32","of fact, I had someone who once again"],["303.84","would pinch hit for me, who would hit a"],["306.88","home run on my behalf. I just needed to"],["309.039","step back and let him take a swing."],["313.28","This isn't just me I'm talking about."],["315.759","This is all of us. There is distinct"],["319.96","information. There is special revelation"],["323.36","given to us that assures us blessings,"],["326.8","assures us success and prosperity,"],["330","health and happiness, privilege and"],["332.72","protection. If you listen carefully"],["334.8","today, I'm going to tell you what it is."],["338.68","Revelation chapter 22."],["342.32","the last chapter in the last book of the"],["346.24","Bible. And we're going to finish our"],["348.4","study in Revelation today. What a"],["350.88","miracle this will"],["353","be. But we're in verse number six."],["355.919","Revelation 22:6. Then he said to me,"],["358.56","this is an angel speaking to John. These"],["360.479","words are faithful and true. The Lord"],["362.16","God of the holy prophets sent his angel"],["364.639","to show his servant the things which"],["366.479","must shortly take place. Behold, I am"],["369.919","coming quickly. Blessed is he who keeps"],["371.84","the words of the prophecy of this book."],["374.479","Now I, John, saw and heard these things."],["377.84","And when I heard and saw, I fell down to"],["380.08","worship before the feet of the angel who"],["381.6","had showed me these things. Then he said"],["383.759","to me, \"See that you don't do that. For"],["385.919","I am your fellow servant, and your"],["387.919","brethren, the prophets, and of those who"],["390.639","keep the words of the book, worship"],["392.919","God.\" And he said to me, \"Do not seal up"],["396.16","the words of the prophecy of this book,"],["398","for the time is at hand. He who is"],["400.28","unjust, let him be unjust still. He who"],["402.96","is filthy, let him be filthy si still."],["405.44","He who is righteous, let him be"],["406.8","righteous still. He who is holy, let him"],["409.36","be holy still. Behold, I come quickly,"],["413.199","and my reward is with me to give to"],["415.6","everyone according to his work. I'm the"],["417.84","alpha and omega, the beginning and the"],["420.319","end, the first and the last. Blessed are"],["423.36","those who do his commands that they may"],["427.039","have the right to the tree of life and"],["429.28","may enter through the gates into the"],["431.199","city, but outside are the dogs and the"],["434","sorcerers, sexually immoral, the"],["435.52","murderers, the idolattors, and whoever"],["437.12","loves and practices a lie. I, Jesus,"],["440.479","have sent my angel to testify to you of"],["443.759","the things in the churches. I am the"],["446.08","root and the offspring of David, the"],["449.36","bright and morning star. And the spirit"],["451.84","and the bride say, \"Come.\" And let him"],["454.639","who hears say, \"Come.\" And let him who"],["457.52","thirst come. Whoever desires, let him"],["460.319","take the water of life freely. For I"],["462.96","testify to everyone who hears the word"],["465.12","of the prophecy of this book. If anyone"],["467.199","adds to these things, God will add to"],["469.12","him the plagues that are written in this"],["470.479","book. If anyone takes away from the"],["472.24","words of this book of this prophecy, God"],["474.72","shall take away his part in the book of"],["477.44","in the book of life from the holy city"],["479.68","and from the things which are written in"],["481.68","this book. He who testifies to these"],["484.8","things says surely I come quickly. Amen."],["489.039","Even so, come Lord Jesus. And then the"],["491.52","benediction, the grace of the Lord Jesus"],["493.199","Christ be with you all. Amen."],["498.4","John says in verse number eight, I John"],["500.8","saw and heard these things. So that the"],["503.28","question is what"],["506.039","things? Everything that we have studied"],["508.639","for the last year. We're right back"],["511.52","where we started. Revelation 1, the"],["514.959","first chapter, the revelation of Jesus"],["517.44","Christ that God gave him to show his"],["519.519","servants things which must shortly take"],["521.519","place. And he sent and signified it by"],["523.919","his angel to his servant John who bore"],["526.959","witness to the word of God to the"],["528.88","testimony of Jesus to all the things he"],["531.12","saw. Blessed is he who hear reads and"],["534.56","those who hear the words of this"],["536.24","prophecy and keep those things which are"],["538.959","written in it for the time is near. The"],["542.959","message to the seven"],["545.56","churches, these things, the scene at the"],["549.68","throne room, the"],["552.12","seven seal judgments, the seven"],["554.8","trumpets, the various entities that we"],["557.6","saw, the two witnesses, the 144,000"],["560","sealed, the the beast, the dragon, the"],["562.32","false prophet, the harlot riding the"],["564.24","beast, the seven final bull judgments,"],["566.72","the return of Jesus, the battle of"],["568.88","Armageddon, the millennial kingdom, the"],["570.8","great white throne judgment, the new"],["572.72","heaven and the new earth. These are the"],["574.959","things that John has seen and heard. The"],["579.44","point of studying the whole book is to"],["582.64","learn all the details to know and"],["585.2","understand the information but"],["588.12","also to gain the blessing spoken of at"],["591.839","the beginning of the book. Revelation"],["594.279","1:3, blessed is he who reads and who"],["597.279","hears the words of the prophecy and"],["599.279","keeps the things that are written. And"],["601.519","then again at the end of the book, the"],["603.68","last chapter, blessed is he, chapter"],["606.6","22:7, blessed is he who keeps the words"],["608.88","of the prophecy, reads the words of the"],["611.12","prophecy and keeps them. Chapter"],["613.16","1. Chapter 22, same thing. And then"],["617.2","again in chapter 22:12, he says, \"I come"],["620.16","quickly and my reward is with me to give"],["622.959","to those according to their works.\" And"],["625.04","again chapter 22:14, blessed are those"],["628.16","who do his commandments that they have"],["630.16","the right to the tree of life and may"],["632.079","enter through the gate to the city. So I"],["634.079","think ch verse 14 clears up any"],["636.48","confusion as to what John means by"],["638.72","keeping the words. He says"],["642.6","who do blessed is he who does the"],["647.88","commandments. That's the challenging"],["649.959","part. The doing. The doing, obeying is"],["653.44","the proof that you believe the word."],["655.6","When God gives commands, instructions,"],["658.32","directives, how we respond is the"],["661.2","evidence, is the proof that we really do"],["663.92","believe him. I found out the hard way"],["666.64","that not keeping, not doing the"],["668.64","commandments just resulted in me"],["671.12","striking out in life. Then I determined,"],["674.48","let's actually, I don't try doing, try"],["678.56","keeping the commandments. Let's see what"],["680.24","happens if I actually do things God's"],["682.8","way. If I exercise just a modicum of"],["685.24","discipline, make an effort, put into"],["688","practice all this stuff that I was"],["690.36","taught. So I started implementing the"],["694.959","main things I implemented"],["698.2","prayer, regular church attendance,"],["701.36","giving a percentage of my earnings from"],["703.04","Red"],["704.279","Lobster. worked at Red Lobster, took my"],["707.519","ties, gave it to Gave it to God, serving"],["711.56","others, and then the hardest of"],["714.92","all, practicing"],["717.88","self-discipline,"],["719.64","self-control. All the things I was"],["721.519","instructed to do for my formative years,"],["723.279","all the things I resisted doing, I"],["725.12","repented of my disobedience, rebellious"],["727.12","attitudes, and I said, \"God, I'll do"],["728.639","things your way, and let's see what"],["730.639","happens.\" What happened was my life"],["733.6","changed for the better in everything I"],["736.959","was involved in. I earned the best"],["739.04","grades I'd ever earned in my life. I had"],["742.32","the most impactful soccer season,"],["745.2","finished my college sports days, winning"],["748.12","awards. I made the best money at Red"],["751.16","Lobster and paid my school bill. And I"],["754.16","had enough money left over, which came"],["756.16","in real handy because I started dating"],["757.68","this young lady. And apparently I had"],["759.44","illustrated enough maturity that she"],["760.72","took me serious enough to eventually"],["762","marry"],["763.16","me. What a blessing. Maybe not for her,"],["766.24","but for me it was a"],["768.76","blessing. So what I experienced was an"],["772.48","amazing turnaround. It was so obvious. I"],["774.959","could not deny it. Keeping God's word"],["778.079","brought me lifechanging blessings. Now"],["780.959","I'd heard that my whole life, but I"],["783.04","never actually put it into"],["785.399","practice. Committing my way to the Lord."],["787.92","Proverbs 3:5 and 6 says, you know this"],["791.44","one, trust in the Lord with all your"],["794.48","heart. Lean not on your own"],["796.16","understandings. In all your ways"],["798.079","acknowledge them, and he will make he"],["800","will direct your"],["801.399","paths. Do not be wise in your own eyes."],["804.639","Fear the Lord. Depart from evil. It'll"],["806.959","be health to your flesh, strength to"],["809.76","your bones. Honor the Lord with your"],["812.079","your possessions and with the first"],["813.519","fruits of your increase so that your"],["816.079","barns will be filled with plenty and"],["817.92","your vats will overflow with new wine. I"],["820.639","knew those verses. I memorized them in a"],["822.48","wana, but I wasn't keeping them. But"],["824.8","once I did, my life"],["827.32","changed. Now, there are and there have"],["830","been times along the way in areas of my"],["832.079","life I deviated from keeping God's word."],["835.279","Disobedience and sin I got involved in"],["838.88","and I paid for it. The pain and the near"],["842.68","destruction I almost experienced serve"],["845.6","to remind me the blessings are there for"],["847.839","those who keep the words of life. But"],["850.639","the pain and destruction is also waiting"],["853.279","if I choose to rebel. On the one hand,"],["856.72","the blessings motivate me to trust in"],["858.8","the Lord. On the other hand, the peer"],["860.959","the the pain and the fear of failure"],["862.88","provokes me to obey. I've experienced"],["866.76","both. I know which one I prefer. I've"],["870.079","had plenty of experience with failure"],["871.6","and rejection, being poor and weak,"],["874","being in a place of despair and"],["875.6","confusion. I've stood at the plate with"],["877.839","two strikes and came to the realization"],["880.399","I got no chance of hitting this ball. I"],["882.88","can't do this on my own. But God said,"],["885.04","if you let me, I'll I'll pinch it for"],["888.079","you. and let me take your last"],["891.399","swing. If you stop doing it in your own"],["893.92","strength, if you stop leaning on your"],["895.519","own understanding, if you let go and let"],["898.56","God have his way, he's going to hit a"],["901.04","home run for"],["902.279","you. We used to sing a little chorus in"],["904.639","church. If any of you remember this one,"],["906.959","let the Lord have his way in your life"],["909.519","every day. There's no rest. There's no"],["911.44","peace till the Lord has his way. Place"],["914.079","your life in his hands. rest secure in"],["917.68","his plans. Let the Lord let the Lord"],["920.88","have his way. I've been telling you,"],["923.44","Faith Bible Church, for 18 years now, if"],["927.6","you want the blessings of God, you need"],["929.92","to do the things that God blesses. He"],["933.839","blesses obedience and the keeping of his"],["936.48","word. This past Thursday, we had a"],["939.76","special congregational meeting that I"],["942.16","wanted to share with you all because"],["944.24","only 50 people showed up for the"],["945.839","congregational meeting, which means a"],["947.12","lot of you didn't find out what was"],["948.56","going on. So, we gave a financial"],["950.32","report. Uh, so far in 2025, we have put"],["956.6","$200,000 back into our emergency uh"],["959.839","savings fund, special account sitting"],["962.16","there. We spent 144,000 on projects and"],["966","improvements going on around here. And"],["968.16","after all of that and all of our"],["971.12","budgeted commitments have been met to"],["973.959","date, we still have an additional"],["976.399","$200,000 sitting in our checking"],["977.92","account. Since we have so much blessing,"],["981.199","the request was from the elders. Can we"],["984.56","go over and above our current missionary"],["987.279","budget and give away an extra five"],["991.16","$50,000 to missionaries who have some"],["994.16","challenging obstacles that we could help"],["995.759","them overcome. We can get some vehicles"],["997.6","to help them reach the needy villages"],["1000.16","and take the resources to the people and"],["1003.04","more importantly the gospel to needy"],["1006.16","people in hard-to-reach areas. And after"],["1009.199","detailing the blessings that God has"],["1010.8","poured out on us and explaining the"],["1012.32","needs of his children, his servants who"],["1015.12","are out there building the kingdom of"],["1016.48","God around the world, what did the"],["1018.32","members of Faith Bible Church vote to"],["1020.44","do? They voted unanimously to give away"],["1025.88","$50,000 just like that. Because time and"],["1029.52","time again, we have seen God prove"],["1032.48","himself to us. We have tested and proven"],["1035.439","this principle. If you want to be"],["1037.199","blessed by God, you simply, what do you"],["1039.48","do? Do the things that he blesses. We"],["1042.48","are blessed to be a blessing. We love"],["1046","God by loving others. We serve God by"],["1049.84","serving others. We give to God by giving"],["1053.52","to others. And every time in obedience,"],["1057.679","when we take one of those steps of"],["1059.2","faith, Faith Bible Church just receives"],["1061.6","more and more blessings. What What do I"],["1064.24","mean? Faith Bible Church gets more"],["1066.799","blessings. What What What exactly does"],["1068.88","those blessings look like? Well, it"],["1071.039","looks like all those babies in the"],["1073.6","nursery for starters. New babies. Oh,"],["1076.64","every time you turn around, somebody"],["1077.919","just walks in here with a new baby and"],["1079.12","sits behind you. Every Sunday that"],["1081.12","happens, all the children in the in the"],["1083.6","classes, all the families coming"],["1085.44","together for worship and to serve. A big"],["1088.32","church family celebration. and over 600"],["1090.72","people attended services last week to"],["1093.2","celebrate the resurrection of our Lord"],["1094.96","and Savior Jesus Christ. We were blessed"],["1097.36","when not preachers but just some"],["1099.679","ordinary guys in our congregation shared"],["1102.16","their testimonies at the sunrise service"],["1104","about how despite grief and sorrow,"],["1106.64","failure and loss, nevertheless the Lord"],["1109.679","heals and helps and saves. Blessings"],["1113.76","look like healing and miracles that we"],["1118.52","see. People who we go to visit in the"],["1121.679","hospital and ICU and now they're sitting"],["1125.84","here"],["1126.919","today worshiping with"],["1129.24","us. Miracles, people recovering from pa"],["1132.559","cancer, people recovering from"],["1134.16","addictions. Last week a young man's"],["1136.08","appendix burst. This week he's home safe"],["1138.64","and sound recovering."],["1140.64","Blessings for the church looks like"],["1142.88","people going out into the community to"],["1145.36","serve the least of these. Reviving a"],["1148.48","struggling sister church going to"],["1151.039","Kentucky to rebuild homes. That story"],["1153.679","Chrissy told us about that young gal"],["1156.32","whose baby was born and that child has"],["1158.64","hope for the future. Hosting a"],["1160.88","conference that is attended by people"],["1162.799","from 26 different states plus Canada."],["1165.84","And they're asking why is this happening"],["1168.24","down here? This church in the middle of"],["1170.48","nowhere is Mechanicsville. Why? Why is"],["1173.039","this happening here? I don't know."],["1176.72","Blessings look like broken marriages"],["1178.96","being saved and restored. People who are"],["1181.12","struggling with anxiety and depression,"],["1183.44","finding faith, hope, and love. Blessings"],["1186.96","is hundreds of people lifting their"],["1189.12","voices in praise, worshiping together in"],["1191.6","unity. I can go on and on and on about"],["1194.32","what blessings mean for me in my life"],["1197.039","and for this church collectively. But"],["1199.2","what are the blessings for you"],["1201.36","personally and specifically as they"],["1203.44","pertain to the book of Revelation as"],["1205.919","you've sat here for 13 months and"],["1207.679","learned the meaning of this book? How do"],["1209.84","these messages, these details, how do"],["1212.559","they bless you?"],["1215.44","Verse"],["1217.08","7"],["1219.88","says, \"Behold, I come quickly. Blessed"],["1223.12","is he who keeps the prophecies of this"],["1227.159","book. I've said it over and over again"],["1229.84","in this study. I know the future. I've"],["1234.32","been telling you the future.\" What"],["1236.799","blessing, what advantage is there to"],["1238.88","knowing the"],["1240.2","future? Well, think about it. when when"],["1243.039","Congress is going to make some big law,"],["1246","some change that the rest of the country"],["1248.08","doesn't know about yet, it's going to"],["1249.679","happen. People with that insider"],["1252.36","information, they buy or sell stocks and"],["1256.559","they profit off of the information based"],["1258.799","on what they know is coming in the"],["1260.32","future. If you could go back to"],["1263.08","2012, probably you would say, I should"],["1267.12","buy a bunch of"],["1268.52","Bitcoin, right?"],["1271.2","And the other side is true. Knowing the"],["1273.6","future also helps you know what pitfalls"],["1276.88","and disasters to avoid. Like on March"],["1280.96","26, 2024, avoid the key"],["1283.88","bridge. Last January, American Airlines"],["1287.679","flight"],["1289.559","5324. Let's not get on that"],["1292.44","one. Avoiding disasters like casting"],["1296.4","Rachel Ziggler to be Snow White. You can"],["1298.799","avoid that."],["1303.039","The things you about knowing the future"],["1305.6","is you know what to do and what not to"],["1308.72","do. You can prosper from knowing the"],["1311.679","future. You can protect yourself and"],["1313.76","your loved ones because you know the"],["1315.36","future. That information, that inside"],["1317.799","track, that blessing is sitting right"],["1320.72","here in your lap. And this is the"],["1323.2","blessing one receives from studying the"],["1325.76","book of Revelation. Like we sung at the"],["1328.4","sunrise service, because he lives, I can"],["1332.36","face tomorrow. Because he lives, all"],["1335.44","fear is gone because I know he holds the"],["1339.039","the future. Life's worth a living"],["1342.32","because he lives. The revelation of"],["1345.28","Jesus Christ tells us all about the"],["1347.28","future. We know how it all"],["1349.4","ends. Upon receiving all this"],["1352.4","information spoken to him by the"],["1353.799","prophet, the revelation comes to an end."],["1357.36","And now John being in utter awement,"],["1361.52","what does he do? Just falls down to"],["1365.44","worship at the feet of the messenger,"],["1367.52","the angel who is speaking to him. Verse"],["1370.799","number eight, I saw and I heard these"],["1374","things. And when I saw and heard, I just"],["1376.24","fell down for the defeated angel who was"],["1379.36","showed me these things. But he said to"],["1381.679","me, \"See that you don't do that, for I"],["1384.48","am your fellow servant, and your"],["1386.24","brethren, the prophets, and of those who"],["1388.64","keep the words of the book, worship"],["1391.159","God.\" The angel says, \"I'm just a fellow"],["1393.679","servant. We're all fellow servants,"],["1395.12","angels, prophets, those who keep the"],["1396.96","words. We're all servants. And we are"],["1400.4","all to"],["1401.88","what? Worship God."],["1404.559","And that would be the second thing I"],["1406.159","hope that this study has inspired you to"],["1408.159","want to do. Worship God, keep his word,"],["1412.159","and then join in with all the saints and"],["1415.2","angels as they bow before the throne."],["1418.24","All the elders cast their crowns before"],["1420.72","the lamb of God and sing, \"You're worthy"],["1423.44","of it all. You're worthy of it all. For"],["1426.799","from you are all things, and to you are"],["1429.919","all things. You deserve the glory."],["1433.679","I know I'm never going to be perfect in"],["1437.28","my obedience to God. I have all these"],["1440.64","instructions, commands, and wisdom, but"],["1443.2","I'm still just a kid swinging and"],["1447.88","missing, doing it wrong, failing tests,"],["1450.48","learning the hard way. Nevertheless,"],["1452.72","somehow it always works out for me. And"],["1456.4","you want to know why? Because of this"],["1458.96","promise that God made. Romans 8:28. We"],["1462.32","know that all things work together for"],["1465.6","good for those who love God and those"],["1468.159","who are called according to his"],["1470.159","purposes. See, God bats clean up for us."],["1475.039","The Psalmist says, God says, \"Call on me"],["1478","in the day of trouble and I will deliver"],["1480.4","you and you will glorify me. Call on me,"],["1483.6","Jeremiah 33:3, and I will answer you."],["1486.159","I'll show you great and mighty things"],["1488.159","which you do not know.\" We worship him"],["1491.36","and he blesses us. I serve him and he"],["1495.279","fulfills these promises to me. See,"],["1499.36","here's the thing about believing God's"],["1501.2","word and keeping God's word. You know"],["1502.559","who else keeps God's"],["1504.279","word? God keeps God's word. God does and"],["1509.52","is always faithful to his promises. Paul"],["1513.039","writes in second Timothy, \"If we are"],["1515.2","faithless, he's quits on us.\""],["1519.44","No, he's faithful. He cannot deny"],["1523.2","himself. So even if we're not perfect,"],["1525.679","he"],["1526.52","is. Verse number 10. And he said, \"Do"],["1529.76","not seal up the words of the prophecy of"],["1531.52","this book, for the time is at hand. He"],["1534.559","who is unjust, let him be unjust still."],["1537.12","He who is filthy, let him be filthy"],["1538.559","still. He who is unrighteous. He who is"],["1540.559","righteous, let him be righteous still."],["1542.08","And he who is holy, be holy"],["1544.919","still.\" Don't seal up the prophecies."],["1547.279","Meaning Jesus wants us to have this"],["1548.96","information, this inside scoop because"],["1550.96","this information is going to bless us if"],["1554.24","we keep it. So the question is, are we"],["1556.559","smart enough to take advantage of this"],["1559.08","information or ignore it? And the choice"],["1563.84","is there. That's what verse 11 is"],["1566.159","talking about when he"],["1568.84","says, \"He who is unjust, be unjust"],["1571.36","still. He is filthy be filthy still. Who"],["1573.2","is righteous be righteous still. He was"],["1575.919","holy. Be holy"],["1578.12","still. And behold, I come quickly, and"],["1581.12","my reward is with me to give to everyone"],["1583.44","according to his work, the Alpha and"],["1585.44","Omega, the beginning and the end, the"],["1587.279","first and last. Blessed are those who do"],["1590.4","his commandments, that they may have the"],["1592.799","right to the tree of life, and may enter"],["1594.64","through the gates into the city. But"],["1596.32","outside are the dogs and sorcers,"],["1598.559","sexually immoral, the murderers, the"],["1600.08","adulterers, and those whoever loves and"],["1602.799","practices a lie. I Jesus have sent my"],["1605.279","angel to testify to you these things in"],["1607.279","the churches. I am the root and the"],["1609.039","offspring of David, the bright and"],["1610.88","morning star and the spirits and the"],["1613.84","bride say come and let him who hears say"],["1617.36","come and let him who thirst come."],["1619.679","Whoever desires let him take the water"],["1622.24","of life freely. So the offer is extended"],["1626.96","to us all to come and take freely of the"],["1630.4","lifegiving water. Jesus the living"],["1633.36","water. Jesus declares that he is the one"],["1636.32","who has all the power and authority to"],["1639.679","do all of these things. He is the alpha"],["1642.24","and the omega, the beginning and the"],["1645.52","end, the first and the last. That means"],["1648.24","he creates us. He sustains us. And in"],["1651.279","the end, he rewards"],["1653.88","us. You're not going to get away. You're"],["1657.679","not going to get to the end of life and"],["1659.52","discover someone other than Jesus. Oh,"],["1662.799","actually, you know, there's this whole"],["1664","pantheon of gods, of deities, and they"],["1666.799","all can vote and change Jesus decrees."],["1670","No, Jesus is not some lower court, but"],["1673.52","there's another whole higher court above"],["1675.279","him that will change everything Jesus"],["1677.2","said. There is no other name."],["1682","Days after the resurrection, the"],["1683.52","disciples of Jesus preached the gospel"],["1685.84","and they had the power to heal people"],["1688","and they healed this lame man. And this"],["1690.08","greatly upset the leaders in Jerusalem"],["1692.32","who had rejected Jesus believing that"],["1694.32","they had already had the way to God and"],["1696.08","Jesus was just a false messiah. But even"],["1699.12","after he was dead and gone, the his"],["1702","disciples are now back and they're"],["1703.52","ministering in his name. And they healed"],["1705.12","this man. And as a result, 5,000 people"],["1708.08","put their faith in Jesus. And and and"],["1710.24","they arrested the disciples and they"],["1712","brought them in. This is Acts chapter 4."],["1714","And they demanded to know by what power"],["1716.159","and by what name have you done this? And"],["1718.72","then Peter being filled with the Holy"],["1720.64","Spirit said, \"Rulers of the people of"],["1722.72","the elders of Israel, if we this day are"],["1725.84","judged for a good deed done to this"],["1727.84","helpless man, by what means he has been"],["1730.48","made well, let it be known to you to all"],["1732.96","the people of Israel. But by the name of"],["1735.2","Jesus Christ of Nazareth, whom you"],["1737.72","crucified, God is raised from the dead."],["1740.32","By him, this man stands before the"],["1742.96","whole. This is the stone which you"],["1745.36","rejected by the builders, which has"],["1747.2","become the chief cornerstone. Neither is"],["1750","there salvation in any other. For there"],["1752.159","is no other name under heaven given"],["1754.559","among men whereby we must be saved. This"],["1758.72","is what the book of Revelation confirms"],["1761.12","for us. Jesus is the son of man and the"],["1765.12","son of God. Jesus said, \"I am Jesus sent"],["1768.799","my angel to testify to you on these"],["1771.36","things to the churches. I am the root"],["1774","and offspring of David, the bright and"],["1776.88","morning star. Jesus unites God and"],["1780.84","humanity. A son of man sits on the"],["1784.08","throne of God and rules everything given"],["1787.2","to him by his father. And though we are"],["1790.88","mere mortals, fallen sinful finite"],["1794.64","beings, through faith in Jesus, we are"],["1797.52","elevated to the position of sons and"],["1800.08","daughters of the most high God. We are"],["1802.64","made infinite. We are given eternal life"],["1805.679","that Jesus has the power to give us. And"],["1810","the spirit and the bride say come. And"],["1811.84","let him who hears say come. And let him"],["1814","who is thirsty, whoever desires, take of"],["1816.96","the water of life. The blessing is"],["1820.12","here to"],["1822.12","take. But for some reason, not everyone"],["1825.36","likes this book. People have been trying"],["1827.84","to change, redact, dismiss, discard,"],["1830.679","disavow this revelation since John"],["1833.84","penned it. And he gives a warning for"],["1835.279","that. Verse 18, I testify to everyone"],["1837.52","who hears the words of this prophecy of"],["1839.12","this book. If anyone adds to these"],["1841.36","things, God will add to him the plagues"],["1843.36","that are written in the book. If anyone"],["1844.96","takes away the words of this prophecy,"],["1846.88","God will take away his part in the book"],["1849.679","of life, from the holy city, and from"],["1851.919","the things that are written in this"],["1853.039","book."],["1854.559","So there's great blessings for those who"],["1856.48","keep the words, but there's great curse"],["1858.88","for those who alter the"],["1862.36","words. There's no changing"],["1865.32","this. There's no changing there. There's"],["1868.32","no parallel universe that we can branch"],["1871.52","off into where this future does not come"],["1873.76","to pass. This is it. This is what's"],["1877.039","coming. Accept it. Reject it. You're"],["1880.399","never going to stop it. Jesus is coming"],["1882.799","back. Amen. And Jesus is going to"],["1886.2","reign. He says, \"He who testifies to"],["1889.76","these things, surely I come quickly."],["1893.6","Amen. Even so, come Lord Jesus.\" And"],["1897.96","then John gives a benediction. The grace"],["1901.6","of the Lord Jesus Christ be with you"],["1904.279","all. Grace is God's unmmerited favor."],["1908.88","You did not earn it, but God freely"],["1911.84","offers it to us all. Dear friend, what"],["1915.36","I'm about to tell you next, you know is"],["1917.399","true. One day, your life will come to an"],["1920.64","end and you will have no more"],["1923.48","metaphorical"],["1925","atbats. Death comes to us all and we all"],["1929.039","strike out. You cannot hit a home run"],["1930.96","off of death. However, Jesus is ready,"],["1933.76","willing, and able to step up and knock"],["1936.72","one out of the park for you. so that you"],["1938.799","could win in the game of life. God's"],["1940.64","blessings are right"],["1942.519","here. Take them and believe"],["1946.36","them. May the grace of the God, may the"],["1949.279","grace of the Lord Jesus"],["1950.84","Christ be with you"],["1953.32","all. And thus ends the book of"],["1956.279","Revelation. So what a"],["1960.919","miracle. Let's turn in prayer. Every"],["1964.48","head bowed and every eye closed as our"],["1966.159","praise team comes to wrap things up for"],["1969.08","us. The big takeaway here from the"],["1971.919","beginning to the end is the blessings"],["1974.159","for those who do the words. And we just"],["1977.919","pray that everyone here, if you've not"],["1980.799","doing these words, if you're not"],["1982.159","believing, if you're not trusting, that"],["1984.24","you would take this time to confess that"],["1987.279","to God. Ask for the strength, ask for"],["1989.84","the faith to step out and do what he"],["1992.399","tells you. do what he asked so that you"],["1995.76","could have these blessings. All of you"],["1998.08","folks in here, all of our families, we"],["2000.64","pray Lord Jesus that you each and every"],["2003.039","soul, each and every home that we would"],["2005.36","hear the words and we would apply them"],["2007.84","to our lives, that we will know the"],["2009.919","truth and the truth will set us free."],["2012","Thank you, Jesus, for all you've done"],["2013.76","and all that you offer. May we come to"],["2016.399","you now boldly receiving that living"],["2019.44","water, receiving this hope and truth for"],["2022.08","all of eternity. Praying in Jesus name."],["2025.279","Amen."]]}]