[{"id":"jaEfVlGwwAo","name":"2025-05-11  Why Does God Afflict Us? (Pastor Rob McNutt)","date":"2025-05-11","transcript":[["22","20 years"],["23.64","ago, I could not provide for my wife and"],["29.359","mother of my three children. I was"],["32.079","living with my in-laws."],["36.16","Summer of 2005, I had finished my first"],["39.44","year of seminary. I couldn't go back to"],["41.68","Canada since there was no job there for"],["43.52","me in the summer. I couldn't get a"],["44.96","full-time job in the States or afford"],["47.12","any housing here. My in-laws graciously"],["50.239","offered to house us while I was"],["52.239","studying. So, I had to be content being"],["55.6","a foreigner on a student visa, making do"],["58.8","with the odd jobs friends from church"],["61.44","offered me. So, I found some jobs that"],["64.32","paid cash, working for a moving company"],["67.76","and doing some"],["69.24","construction. 10 years earlier, when I"],["71.439","married, I had a job. I could provide"],["73.84","for my family, but I decided to give all"],["75.84","that up, leave Canada, and go back to"],["77.759","school. For all of my childhood, school"],["80.96","felt like an affliction. Can I get an"],["83.68","amen from anybody? School, right? Even"],["86.96","after I graduated college like Garrett"],["89.28","did, I was just like, \"Woo! Glad that's"],["93.119","over. I don't ever want to go back to"],["95.6","school.\" But 10 years later, I was back"],["97.28","in school feeling very poor and"],["100","afflicted working on moving trucks in"],["102.96","the summer here in the DMV and that 100"],["105.439","90 degree like wet blanket wrapped"],["108.64","around you humidity felt like an"],["110.96","affliction."],["112.64","There are times when we all feel like we"],["115.92","are suffering some level of affliction."],["117.6","Whether that's some educational pain or"],["119.68","some financial pain or maybe broken"],["122.56","relationships with family and with"],["124.68","friends, sickness. We've had requests"],["127.92","for people dealing with sickness."],["130","Sometimes even when we're trying to"],["132.319","serve the"],["134.12","Lord, we are in the middle of a crisis"],["136.64","in ministry. For me, it was ministry"],["138.959","related crisis in 2004 that pushed me to"],["142.64","resign from my church in Canada and come"],["145.28","back to seminary which resulted in the"],["147.76","financial affliction that I was feeling"],["150.239","in 2005. One affliction just led to"],["153.44","another affliction. I was trying to"],["155.04","serve God. Why was my life so hard?"],["158.08","Well, many people here today, you're"],["160.239","feeling afflicted and you're wondering"],["162.16","why God, why are you allowing this"],["166","affliction?"],["167.519","Today, as Pastor Mark said, we begin a"],["169.92","new series in the book of Ruth. I invite"],["172.48","you to take your copy of the word of God"],["174.16","and turn to Ruth chapter 1. Let's read"],["177.28","the whole chapter and then we will make"],["179.92","some observations, interpretations, and"],["182.2","applications for ourselves today. Ruth"],["185.28","chapter 1 verse one. Now it came to pass"],["187.28","in the days when the judges ruled, there"],["189.2","was a famine in the land. A certain man"],["191.84","of Bethlehem Judah went to dwell in the"],["194.239","country of Moab. He and his wife and his"],["196.48","two sons. The name of the man was IMC."],["199.2","The name of the wife, his wife, was"],["200.8","Naomi. And the name of the two sons,"],["202.959","Malon and Chilon, Ephraimites of"],["205.76","Bethlehem of Judah, and they went to the"],["208.239","country of Moab, and remained there."],["210.72","Then Almc Naomi's husband, died. She was"],["213.84","left with her two sons. Now they took"],["216.159","wives of the women of Moab and the name"],["218.48","of one was"],["220.04","Oprah and the other was Ruth and they"],["224.319","dwelt there 10 years and then both Malon"],["227.12","and Chilion also died. So the woman"],["229.68","survived her two sons and her husband."],["233.28","Then she arose with her daughter-in-laws"],["235.519","and that she might return from the"],["237.2","country of Moab. For she had heard in"],["239.92","the country of Moab that the Lord had"],["241.599","visited his people and given them bread."],["243.2","Therefore, she went out from the place"],["245.2","where she was, and her two"],["246.879","daughter-in-laws with her, and they went"],["248.56","on their way to return to the land of"],["250.439","Judah. Naomi said to her two"],["252.56","daughter-in-laws, \"Go return each to her"],["256.56","mother's house. The Lord deal kindly"],["259.199","with you as you have dealt with the dead"],["261.6","and with me. The Lord grant that you"],["263.759","will find rest each in the house of her"],["266.08","husband.\" So he she kissed them and they"],["269.759","lifted up their voices and wept. And"],["271.84","they said to her, \"Surely we'll return"],["273.84","with you to your people.\" But Naomi"],["276.16","said, \"Turn back, my daughters. Why will"],["279.44","you go with me? Are there still sons in"],["282","my womb that they may bring you"],["284.639","husbands?\" \"Turn back, my daughters. Go,"],["287.28","for I am too old to have a husband. If I"],["290.08","should say I have hope, if I should have"],["292.4","a husband tonight and should also bear"],["294.479","sons, would you wait for them till they"],["296.56","are grown? Would you restrain yourselves"],["298.88","from having husbands? No, my daughters,"],["301.6","for it grieves me very much for your"],["303.759","sakes that the hand of the Lord has gone"],["306.56","out against"],["307.96","me. Then they lifted up their voices and"],["310.4","they wept again. And Oprah"],["313.24","kissed her mother-in-law, but Ruth clung"],["316.56","to her. And she said, \"Look, your"],["319.919","sister-in-law is gone back to her people"],["322.08","and to her gods. Return after your"],["324.16","sister-in-law.\" But Ruth said, \"Entreat"],["326.56","me not to leave you or to turn back from"],["330.08","following after you. For wherever you"],["332.88","go, I will go, and wherever you lodge, I"],["336.08","will lodge. Your people shall be my"],["338.639","people and your God my God. When you"],["341.84","die, I die. And there I will be me be"],["345.199","there I will be buried.\" the Lord do so"],["348.639","to me and more also if anything but"],["352","death parts you and"],["354.28","me. When she saw that she had determined"],["356.96","to go with her, she stopped speaking to"],["358.88","her. Now the two of them went until they"],["361.68","came to Bethlehem and it happened when"],["364.4","they had come to Bethlehem and all the"],["367.36","city was excited because of them. And"],["369.12","the woman said, \"Is this not Naomi?\" But"],["371.52","she said to them, \"Don't call me Naomi."],["373.6","Call me Mara. For the Almighty has dealt"],["376.88","very bitterly with me. I went out full"],["380.08","and the Lord has brought me home again"],["381.68","empty. Why do you call me Naomi since"],["383.84","the Lord has testified against me and"],["385.919","the Almighty has afflicted me? So Naomi"],["390.24","returned and Ruth the Moabitis her"],["392.16","daughter-in-law with her who returned to"],["394.8","the country of Moab returned from the"],["397.6","country of Moab. Now, they came to"],["400.08","Bethlehem at the beginning of the barley"],["404.36","harvest. Chapter 1, it starts out with"],["407.84","Naomi feeling like the hand of the"],["410","Almighty has been against her, that she"],["412.08","has been afflicted by God. She says in"],["414.72","verse 21, \"Don't call me Naomi, call me"],["419.28","Mara,\" which means bitter, \"ince the"],["421.44","Lord has testified against me and the"],["423.199","Almighty has afflicted me.\""],["427.28","She feels this way"],["429.24","because she was being afflicted by God."],["434","And it will do us no good for me to deny"],["437.72","that. Many preachers do not want you to"],["441.12","have any negative emotions about the"],["444.24","topic of God or church. Many people"],["447.919","think that all your experiences here in"],["450.08","church, they they need to be warm and"],["452.639","and pleasant so that you'll feel safe"],["456.16","around"],["457.56","God. I have"],["460.12","not,"],["461.72","cannot, will not offer you a safe God. I"],["466.72","can show you a powerful God who has a"],["469.759","great plan to save you and bless you."],["472.479","But the way he leads all of us is not"],["475.599","around affliction, but through it. Ruth"],["479.919","is a beautiful story. It is a prequel to"],["483.36","God's great plan for the redemption and"],["485.84","the glorification of humanity. It does"],["488.56","have a happy ending, but it starts with"],["490.879","the cold, hard truth that Naomi needs to"],["494.479","be saved from something. We cannot"],["497.28","ignore the state of debt, poverty,"],["499.84","sickness, and desperation that all of"],["502.56","humanity needs to be redeemed from. The"],["506.72","pain, the affliction is making everyone"],["509.84","aware of the problem. When you break a"],["512.88","bone, you feel pain, right? The pain"],["516.479","tells you, \"Hey, something's wrong."],["518.159","Something's broke here.\" Without it,"],["519.68","you'd be unaware of your broken state."],["521.519","The pain is not the problem. The problem"],["523.599","is the is the broken bone. But the pain"],["526.72","makes you stop what you're doing and"],["528.72","attend to the problem. So Naomi is"],["530.959","feeling the pain affliction from God."],["533.68","Let's see if we can find what the root"],["535.36","of the problem is. Actually, it's not"],["537.519","very hard to figure out. It's right"],["538.959","there in the opening statement. Did you"],["540.399","catch it? Ruth chapter 1 verse number"],["543.12","one. It tells you right up front, in the"],["546.399","days when the judges ruled, there was a"],["549.839","famine in the"],["551.56","land. See? Makes sense, right? This is"],["556","not a random tale. This is not a"],["558.16","historic w with no historical or"],["560","theological"],["561.32","context. There is all that is being"],["563.68","communicated in that opening statement."],["565.519","You just got to know what was going on"],["567.12","before you get to Ruth. So, let me catch"],["569.6","us up. Let me give us the context."],["572.08","Little history lesson. I'll tell you"],["574.399","what this means. The days of the judges,"],["577.44","when was that? What was going on? So"],["579.519","around 2000 BC, God called Abraham and"],["584.08","he said, \"Leave your father's land."],["586.72","Follow me to a land that I will give"],["588.8","your descendants as an inheritance. And"],["590.64","I will make of you a great nation, and I"],["592.56","will bless you, and I will bless those"],["594.56","that bless you, and I will curse those"],["596.24","that curse you, and through your seed,"],["598.24","through your family line, all the"],["600.56","nations of the world will be blessed.\""],["602.399","Abraham by faith believed God, and he"],["605.6","obeyed. God made an unconditional"],["608","covenant with Abraham. God was going to"],["610.16","fulfill these promises. God was going to"],["612.24","keep his word. So Abraham had a son,"],["614.64","Isaac, and that covenant was passed on"],["616.72","to Isaac. And Isaac had a son, Jacob,"],["619.44","and that covenant was passed to Jacob."],["621.76","Jacob's name was changed to Israel. And"],["625.279","Israel had 12 sons. And the covenant was"],["629.44","passed to the 12 tribes of Israel. The"],["632.399","covenant of God went down to the"],["634","children of Israel there. That's the"],["635.36","whole book of Genesis. Just finish that."],["637.519","Just like that. At the conclusion of"],["640","Genesis, we see that Israel and his 12"],["642.72","sons, all their families moved to Egypt"],["646.48","where they were blessed for a time. They"],["648.64","grew into a nation, but then they were"],["651.88","enslaved and they were enslaved for 400"],["656.079","years. But the Lord sent Moses to lead"],["659.76","them out of slavery to the promised land"],["662.56","around 1500 BC. there. The book of"],["665.04","Exodus just took care of that. On the"],["667.44","way, Moses received the laws of God and"],["670.64","wrote them down."],["671.88","Leviticus, Numbers, and Deuteronomy. God"],["675.76","said he's going to give the people the"],["677.68","land he's promised them that he promised"],["680.16","to Abraham, and he will greatly bless"],["682.16","them and prosper them if they obey the"],["685.279","laws and don't worship any other gods."],["687.44","However, if they do not obey the laws of"],["689.839","God and they worship other gods, he"],["692.32","would curse them. And this is called a"],["695.519","conditional covenant. Slightly different"],["697.36","from the unconditional covenant that God"],["699.36","made with Abraham. Those promises do not"],["701.519","change. The conditional covenant is obey"],["703.76","the laws and be blessed. Disobey the"],["706","laws and be cursed. And this was to"],["709.2","teach the people about justice,"],["712.2","righteousness, sacrifice, and"],["715.04","redemption."],["716.72","The laws were so very hard for the"],["718.48","people to keep. People sinned and they"],["720.48","fell short of living right. However, God"],["723.04","had instituted the animal sacrificial"],["726.079","system to atone for their sins. So, as"],["729.12","long as the nation followed the laws and"],["731.6","practiced the sacrifices to atone for"],["733.76","sin, worshiped the God of Abraham only,"],["736.48","they were going to be blessed. After"],["739.44","Moses died, Joshua led the people in"],["742.24","conquest of the promised land. That's"],["744.48","now the book of Joshua. They divided the"],["746.8","land up. They won the land and they"],["748.32","divided it from between the 12 tribes"],["750.92","around 1400 BC through that time period."],["755.44","Near the end of his life, Joshua"],["757.2","implored the people, be faithful, serve"],["760","the Lord. And actually, Pastor Mark did"],["761.68","that song for us. As for me and my"],["764.32","house, we will serve. That was Joshua."],["767.2","Serve the Lord our God. The people"],["769.6","pledged that they would do it. and all"],["771.519","the elders of the tribe of Israel"],["773.2","fulfilled that pledge even after Joshua"],["775.68","died. The whole generation was faithful."],["778.16","But then we get to the book of Judges."],["781.12","Turn to Judges chapter"],["783.72","2. Oh, why did it take us a whole year"],["785.839","to do Revelation? Look, I've just done"],["787.92","six books of the Bible. It's like"],["790.44","that"],["791.959","ridiculous. Chapter 2, verse number"],["795.16","7. Judges 2:7. So the people served the"],["798.32","Lord all the days of Joshua, all the"],["800.48","days of the elders who outlived Joshua,"],["802.16","who had seen the great works of the"],["803.519","Lord, which he' done for Israel. Now"],["805.92","Joshua, the son of Nun, the servant of"],["808","the Lord, died, and he was 110 years"],["810.16","old, and they buried him at the border"],["811.6","of his"],["812.519","inheritance, went verse number 10, when"],["815.12","all the generation had been gathered to"],["817.279","their fathers, what does that mean? What"],["818.8","does that idiom mean? They were gathered"],["820.32","to their fathers. Means that that whole"],["822.32","generation passed away. They died."],["825.279","Another generation arose after them who"],["828.24","did not know the Lord nor the works that"],["830.48","he had done for"],["833.88","Israel. So all the people, the children"],["836.48","who remember Joshua faithful, the next"],["838.399","generation, verse number 11, the"],["839.839","children of Israel did evil in the sight"],["841.519","of the Lord and served the baales. They"],["844.88","forsook the Lord God of their fathers"],["847.04","who had brought them into the out of the"],["848.56","land of Egypt, followed other gods from"],["850.32","among the gods of the people who were"],["851.68","around them. And they bowed down to them"],["853.68","and they provoked the Lord to anger."],["856.32","They forsook the Lord. They served the"],["857.92","bales and the asteros. And the anger of"],["860.639","the Lord was hot against Israel. So he"],["862.56","delivered them into the hands of"],["864.32","plunderers who desoiled them and he sold"],["866.72","them into the hands of the enemies all"],["868.16","around. So they could no longer stand"],["870.48","before their enemies. Wherever they went"],["873.199","out, the hand of the Lord was against"],["874.56","them for calamity. As the Lord said, and"],["876.48","as the Lord had sworn to them, they were"],["878.32","greatly distressed. Nevertheless, the"],["880.48","Lord raised up judges who delivered them"],["882.32","out of the hands of those who plundered"],["883.76","them. Yet they would not listen to their"],["885.519","judges, but they played the harlots with"],["887.44","the other gods, bowed down to them,"],["889.44","turned quickly from the way which their"],["890.959","fathers walked in, and obeying the"],["892.16","commandments of the Lord. They did not"],["894.079","do"],["895.079","so. So that right there is a summary of"],["897.44","what happens for the next 300"],["901","years. From the time of Joshua for about"],["904.32","300 years, the people rebel, worship"],["907.12","false gods. God withholds protection and"],["909.12","blessing off the nation. Famine strikes."],["912.16","Foreign invad nations invade because of"],["914.959","the affliction. The people repent and"],["918.24","they call out to the Lord for help. And"],["920","then God raises up a judge to deliver"],["922.24","the nation. And then the people"],["924.56","experience peace and blessing. But then"],["926.399","that generation passes away and the next"],["928.399","generation does the same thing, disobys"],["930.32","and repeats the cycle. So the story of"],["933.279","Ruth is in the time of the"],["936.44","judges. And since there is famine in the"],["939.44","land, this tells us that during the time"],["941.68","of Naomi and her husband IMC, the nation"],["944.399","is in a period of rebellion. How do I"],["948.32","know that? Deuteronomy 28, turn to"],["951.199","Deuteronomy 28, listed very clearly in"],["954.48","the laws of Moses. Deuteronomy 28:1. Now"],["958.24","it shall come to pass, if you diligently"],["960.8","obey the voice of the Lord your God, to"],["963.199","observe carefully all his commands,"],["964.88","which I command you today, that the Lord"],["966.88","your God will set you high above the"],["968.72","nations of the earth. And all these"],["970.24","blessings shall come to you, overtake"],["972.079","you, because you obey the voice of the"],["974","Lord your God. Blessed shall you be in"],["976.56","the city. Blessed shall you be in the"],["978.72","country. Blessed shall be the f fruit of"],["981.12","your body. What does that mean? The"],["982.399","fruit of your body."],["984.48","Your wombs will be open. You will have"],["985.839","children, right? Happy Mother's Day."],["988.24","They get the kids. Blessed shall you be"],["990.8","the produce of the ground in the"],["992.639","increase of your herds, the increase of"],["994","your cattle, the offspring of your"],["995.44","flocks. Verse 5. Bless shall be the"],["997.44","basket and your kneading bowl. Blessed"],["1000","you will be when you come in and blessed"],["1001.44","you will be when you go out. The Lord"],["1002.959","will cause your enemies to rise against"],["1004.48","you and to be defeated before your face."],["1006.399","They shall come out against you one way"],["1008.24","and flee before you seven ways. The Lord"],["1012.24","will command the blessing on you in your"],["1013.959","storehouses and all which you set your"],["1016.48","hands, he will bless you in the land"],["1018.959","which the Lord your God is giving"],["1021.16","you. Go down to verse"],["1023.4","15. But it shall come to pass if you do"],["1026.48","not obey the voice of the Lord your God"],["1028.72","to observe carefully all his commands"],["1030.799","and his statutes which I command to you"],["1032.559","today that all these curses will come"],["1034.959","upon you and overtake you. Here we go."],["1038","Cursed you'll be in the city and cursed"],["1039.439","you'll be in the country. Curse shall be"],["1040.799","your basket in your kneading bowl."],["1042.319","Cursed shall be the fruit of your body"],["1044.079","and the produce of the land and the"],["1045.76","increase of your cattle and offspring"],["1047.28","and your flocks. Curse shall you be when"],["1049.52","you go in and curse will be when you go"],["1051.6","out. The Lord will send his cursings,"],["1054.72","confusion and rebuke in all that you set"],["1057.52","your hand to do until you are destroyed"],["1060.24","until you perish quickly because the"],["1062.08","wickedness of your doings in which you"],["1063.76","have forsaken me. The Lord will make"],["1066.16","these plagues cling to you until he's"],["1069.52","consumed you from the land which you're"],["1071.6","going to"],["1072.36","possess. So we look at Ruth and there's"],["1075.28","a famine in the land. That's a curse on"],["1078","the produce. The famine is an affliction"],["1081.76","sent by God because his people were"],["1084.48","being unfaithful to his laws. Was Alimc"],["1088.48","himself worshiping false gods? I don't"],["1091.039","know. It doesn't say that in Ruth. Maybe"],["1093.2","he was. Maybe he wasn't. Sometimes we're"],["1096.799","experiencing afflictions through no"],["1098.88","fault of our own simply because we are"],["1101.36","living in a fallen and cursed world."],["1104.16","We're suffering hardships because of the"],["1107.2","leadership of our nation and what"],["1109.679","they're doing is having some impact on"],["1111.84","our lives. For example, we're wondering"],["1115.36","why can't I afford a home in"],["1117.559","2025? Well, maybe because back in 2008"],["1120.72","when the housing market crashed in order"],["1122.48","to save the banks, the federal"],["1123.919","government gave all this taxpayer money"],["1125.52","to BlackRock and they bought up all the"],["1128","foreclosures to bail out the banks."],["1129.76","Black Rockck gobbled up all this cheap"],["1131.679","houses, turned them into rentals. Now,"],["1133.919","in 2025, there's a shortage of houses."],["1136.559","Supply and demand has driven up the"],["1138.32","prices. Black Rockck's now sitting on a"],["1140","gold mine of real estate. They're a"],["1141.44","multi-billion dollar company while the"],["1143.039","taxpayers are $37 trillion in debt and"],["1145.44","you can't afford a house. Thanks a lot,"],["1147.84","federal"],["1148.679","government."],["1150.2","Famine, you're afflicted through no"],["1153.36","fault of your own. The famine is hurting"],["1155.76","the whole nation. Those who worship the"],["1157.76","false gods and those who did not worship"],["1159.919","the false god. Well, that's not fair."],["1162.4","Shouldn't the famine only hit the"],["1163.919","sinners?"],["1167.6","Well, it is. And that's a theological"],["1170.4","theme running all throughout the entire"],["1172.48","scripture. There is none righteous. know"],["1176.4","not one. Isaiah 64. But we are all as an"],["1181.44","unclean thing, and all of our"],["1183.2","righteousness is filthy rags. We all do"],["1186.559","fade as a leaf, and our iniquities like"],["1188.4","the wind has taken us away. So even"],["1191.44","though we would claim to be innocent,"],["1193.76","that we've done nothing to deserve"],["1195.88","affliction, that's intellectually"],["1198.2","dishonest. All have sinned and fallen"],["1201.76","short of the glory of God. We all"],["1204.24","deserve wrath."],["1206.08","If you sit here today and you say, \"What"],["1209.44","sin have I committed? I I I deserve no"],["1212.84","affliction. This is"],["1215.799","unfair.\" Maybe your sin is"],["1219.24","pride, your ignorance to your plight,"],["1222.88","and too arrogant to own"],["1226.2","it. Here's another biblical answer for"],["1229.52","your affliction. Your faith is being"],["1232.159","tested like Job to see if you can praise"],["1235.679","God in all"],["1237.64","circumstances. As James tells us, \"Count"],["1241.6","it all joy, my brothers, when you fall"],["1243.44","into various trials.\" Paul says, \"Not"],["1245.84","only that, but we rejoice in our"],["1248.24","sufferings, knowing that their suffering"],["1250.08","is going to produce"],["1252.44","endurance.\" Because here's the honest"],["1254.24","truth, folks. Chaos and affliction is"],["1257.52","coming for all of us. You cannot avoid"],["1260.799","it in this lifetime. Joshua, he was a"],["1264.24","godly, faithful leader who led Israel to"],["1267.76","conquer the land. What happened to him"],["1269.52","at the end of the book?"],["1271.96","Joshua, he dies. He dies. All the"],["1275.6","wonderful godly servants, all the"],["1277.28","prophets, they all they all die because"],["1280.4","we're all afflicted with this curse of"],["1282.799","death. Scripture says death passed to"],["1285.44","all men because all have sinned. But one"],["1289.52","day the curse will be lifted. Sin and"],["1293.039","death will be defeated. This is the"],["1296.24","message of the gospel. And Ruth is going"],["1299.2","to teach us how we're going to get"],["1302.84","there. But we have to understand that"],["1305.76","affliction is part of being in this"],["1307.84","world whether we feel it is or is not"],["1310.64","justified."],["1312.64","But to show you that everyone is a"],["1314.159","sinner and to prove the point that"],["1315.84","Israel in this time is being"],["1317.36","disobedient, even"],["1318.84","IMC, we see IMC disobey the laws of God"],["1323.36","by what do you do? He leaves the land of"],["1326.96","promise and he moves to Moab. That was a"],["1330.08","disobedience to God. And then the second"],["1331.679","thing he does is disobedience is what?"],["1334.799","They lets the boys marry the Moabitete"],["1338.4","women. Now, sure, Alimc, he can justify"],["1341.12","his disobedience. We got We got no food"],["1343.28","here. We got to move. Bethlehem means"],["1345.919","house of bread. There's no bread here."],["1350.4","The bread, the blessing is in Moab. I"],["1353.12","got to feed my"],["1354.6","family. Often we fall prey to"],["1357.12","situational ethics because someone else"],["1360","is dishonest or the system's corrupt or"],["1362.88","that person's talking bad about me. This"],["1365.2","gives me the right to"],["1368.6","retaliate and do bad behavior. God says,"],["1372.159","\"Don't let your sons marry the foreign"],["1373.76","women.\" Well, we're here in Moab. I I"],["1377.12","don't see any other women. How are we"],["1379.76","going to have a lineage if they don't"],["1381.52","marry some foreign women? Doesn't matter"],["1384.32","what God said. It's what makes sense to"],["1386.6","us. What's rational at the moment? So,"],["1390.72","this is how our faith is tested. Will we"],["1394.08","do things God's way when it's hard, when"],["1398.159","it's hurting us,? When we're not getting"],["1400.72","what we want? Will we be patiently"],["1404.32","obedient and endure affliction? Or will"],["1407.2","we rush out to find a solution in our"],["1409.36","own"],["1411.32","strength? So, when we make decisions out"],["1414.24","of anger or fear, generally they are"],["1416.799","unwise decisions. Have you noticed that?"],["1419.6","One of the reoccurring messages of"],["1421.76","scripture is wait on the"],["1424.84","Lord. Everybody remember this one. They"],["1428.08","that wait upon the Lord shall renew"],["1432.72","their strength. They will mount up with"],["1436.32","wings. You can do a solo. Come on."],["1438.159","Somebody knows the song. As he goes,"],["1441.12","I'll do it. They will run and not grow"],["1444.08","weary. They will walk and not faint."],["1447.76","Teach me Lord. Teach me Lord to wait."],["1451.76","Thank you Wayne and Sandy for helping me"],["1453.36","out. Appreciate"],["1455","that. Wait on the"],["1457.24","Lord. Galatians Paul says, \"Let us not"],["1460.08","grow weary while doing good, for in due"],["1462.159","season we'll reap if we do not lose"],["1464.48","heart. Cast all your cares upon him and"],["1468.4","then wait for his deliverance.\" in in"],["1472.4","2004 2005 we're living with the"],["1475.799","in-laws but in"],["1477.88","2005 God had a place for us and that"],["1481.44","door opened up and we got to move there"],["1483.2","and we just had to wait and then in 2007"],["1486.4","God had another place for us and we got"],["1487.919","to move down here to St. Mary's County"],["1489.84","and uh here we are and uh it took three"],["1493.279","years but God had a plan. Sometimes the"],["1495.36","best move is"],["1496.76","just don't move. Wait for the answer."],["1501.52","But like Alimc people are quick to jump"],["1503.76","up and do something disobedient thinking"],["1506.24","it's going to solve the problem. Leaving"],["1508.08","the promised land was Alimc trying to"],["1510.24","get away from the affliction but all it"],["1512.08","does is make matters worse. Trying to"],["1514.24","get the quick fix to stop the pain."],["1516.159","getting out from under the affliction,"],["1517.52","the chastening of the Lord. That didn't"],["1519.039","make IMC's family's life better. It just"],["1521.279","resulted in"],["1522.44","everyone"],["1524.36","dying. Look at"],["1526.279","this verse number"],["1528.84","three. It"],["1531.64","says, I got to find it. There's an"],["1534.64","affliction. I can't read scripture."],["1536.72","Elimc Naomi's husband died and she was"],["1539.2","left with her two sons. And they took"],["1540.64","wives of the Moabites, one Oprah and the"],["1542.559","other Ruth, and they dwelt 10 years. And"],["1545.6","then both those sons"],["1549.32","died. Now IMC's sons disobeyed God's"],["1552.159","laws by marrying the Moabitete girls."],["1554.32","That did not grow the family. It just"],["1556","resulted in their deaths. And you notice"],["1558.96","that they were married for 10 years and"],["1561.36","they died and they had no grandchildren."],["1563.84","What was the promises that were made in"],["1565.96","Deuteronomy? Blessed will be your your"],["1569.039","your the fruit of your womb. These girls"],["1572.559","did not have any children in the whole"],["1574.799","time they were in Moab. There was no"],["1576.72","blessings and they all"],["1580.679","died. Folks were like, \"Wow, it' be so"],["1583.039","nice to get out of Revelation and study"],["1584.88","something kinder and"],["1587","happier.\" Like what, Ruth? Oh, Ruth"],["1589.679","sounds nice. How you liking it so far?"],["1593.039","The husband and the two sons are dead."],["1595.12","Happy Mother's Day."],["1598.08","Naomi is afflicted by God. And she felt"],["1601.52","that way"],["1602.6","because she was afflicted by God. And it"],["1605.6","does us no good to deny that. If we"],["1608.08","don't learn why God afflicts us, we will"],["1610.559","always just be shocked and confused"],["1613.52","about why we're being"],["1615.08","afflicted. We will never learn the"],["1617.44","lessons. And thus, we'll be destined to"],["1619.679","repeat the same mistakes over and over"],["1622.72","and over. But if we can learn why God"],["1625.2","afflicts us and how we ought to respond"],["1627.84","to his chastening, then we can learn and"],["1630.559","we can grow and we can discover the good"],["1632.96","on the other side. And that is the hope"],["1635.919","in the story of"],["1637.32","Ruth,"],["1638.84","redemption. But first we have to deal"],["1641.039","with the debt, the sin and the reason"],["1643.52","for the affliction. So yes, you are"],["1646.48","being or you will experience affliction."],["1650","And this is done often to"],["1652.679","purify, to refine our faith. Prophet"],["1656.32","Zachchariah says, \"I will put a third of"],["1658.72","you into the fire and refine them as one"],["1661.679","refined silver and test them as gold is"],["1664.559","tested. They will call on my name and I"],["1666.96","will answer them and they will say, I"],["1668.88","will say to them, they are my people.\""],["1671.36","And they will say, \"The Lord is my God.\""],["1674.24","You go into the fire, you call on his"],["1676.48","name, and he says, \"Those are my"],["1679.64","people.\" Peter says, \"So that the tested"],["1683.2","genuiness of your faith being more"],["1685.039","precious than gold that perishes, though"],["1687.84","tested by fire, may be found to result"],["1690.24","in praise and glory and honor at the"],["1692.32","revelation of Jesus.\" And then Job tells"],["1694.72","us, \"But he knows the way that I take,"],["1697.279","and when he's tried me, I'll come out as"],["1700.559","gold.\""],["1702.08","So, you're here today. You're going"],["1703.84","through the fire, dealing with the"],["1705.96","affliction. Understand God is using this"],["1709.76","to refine your faith. Don't reject him."],["1712.96","Don't respond like a Limc with more"],["1715.279","disobedience. Don't try to get out of"],["1717.039","the affliction. Trust him to get you"],["1719.039","through it. Trust that he has a plan and"],["1722.559","a"],["1723.559","purpose. Verse number six."],["1726.88","So Naomi arose with her god"],["1729.24","daughter-in-laws that she might return"],["1731.36","from the country of Moab. For she had"],["1733.12","heard in the country of Moab that the"],["1734.96","Lord had visited his people and given"],["1736.24","them bread. Therefore, she went out from"],["1738.559","that place where she was with her two"],["1740.08","daughter-in-laws with her and they went"],["1742.24","to return to the land of Judah. So Naomi"],["1745.6","shows us the first step that we need to"],["1748.32","take. She returns to the land of"],["1751.2","blessing. She returns to the Lord."],["1754.399","Repentance is going in one direction and"],["1758.039","then turning around and going in the"],["1761.679","right direction. You're going one way,"],["1763.76","you realize this is wrong, and you turn"],["1765.84","around and you go the other way. IMC"],["1768.399","went to Moab to find the bread. Naomi"],["1771.44","comes to the conclusion this is a bad"],["1773.279","idea. Everyone's dead here. I need to"],["1776.64","turn around and go back to the land of"],["1780.24","the Lord. Some people would say, \"Well,"],["1783.679","this is what my husband decided. I got"],["1786.08","to respect his"],["1787.96","wishes. This is what my family does. I"],["1791.36","got to be loyal. This is what my church"],["1794.72","denomination taught me to adhere to."],["1797.76","This is what my culture, my upbringing,"],["1800.64","this is what to do. I can't change.\" No."],["1804.48","What we all have to do is put the Lord"],["1808.679","first and follow him and do not let the"],["1812.48","failures of the past, culture, society,"],["1815.84","even your family trap you in sin. Repent"],["1819.919","and turn to the Lord. Take a step of"],["1823.12","faith regardless of what everyone else"],["1825.12","is doing. Yes. Verse number"],["1829.559","eight. Naomi said to her two dear"],["1832.84","daughter-in-laws, \"Go return each to her"],["1835.36","mother's house. The Lord deal kindly"],["1837.2","with you as you've dealt with the dead"],["1838.96","and with me. The Lord grant that you"],["1841.2","will find rest in each of the house of"],["1842.96","her husband. So go get another husband.\""],["1845.279","She kissed them and they lifted up their"],["1847.279","voices and wept. And they said, \"Surely"],["1849.36","we'll return with you to your people.\""],["1851.2","But Naomi said, \"Turn back, my"],["1852.64","daughters. Why will you go with me? Are"],["1856.72","there still sons in my womb that they"],["1859.12","may be your husbands? Turn back, my"],["1860.799","daughters. No, for I am too old to have"],["1863.2","a husband. If I should say, I have hope."],["1866.08","And if I should have a husband tonight"],["1867.76","and bear sons, would you wait till"],["1869.919","they're grown up? Would you restrain"],["1871.52","yourself from h having husbands? No, my"],["1874","daughters, for it grees me very much for"],["1876.32","the sake that for your sake that the"],["1878.64","hand of the Lord has been against me."],["1882.96","So you got to remember that during this"],["1884.559","period of time, your life insurance"],["1887.44","policy, your welfare system, your social"],["1890.64","security, your Medicare, your Medicaid"],["1892.64","was all bundled in your family. You"],["1897.039","needed your family. And this is why sons"],["1900.64","finding wives and continuing the lineage"],["1903.519","was so vital to IMC. He and Naomi"],["1906.48","provided for the sons and in the future"],["1909.36","the sons would provide for them. But"],["1912.32","when they died and there is no"],["1914.279","grandchildren, these three women are in"],["1917.679","a desperate"],["1919.08","situation. It is obvious that Naomi"],["1921.679","loves these"],["1922.679","girls. And she could have banked on that"],["1925.279","that these girls love her, right? She"],["1927.76","could have said, \"Well, these girls are"],["1928.799","very loyal, so they'll take care of me."],["1931.12","They're young. They're beautiful."],["1932.32","They'll remarry and then I'll have a"],["1934.159","family. I'll be okay.\" Now, in Israel,"],["1936.48","the laws of Moses would dictate that the"],["1938.399","family would provide for Naomi. She"],["1940.88","could have expected that in Israel, but"],["1943.84","would that happen in"],["1945.559","Moab? We don't know if that would be the"],["1947.76","case in Moab. If the girls marry"],["1949.679","Moabitete men, perhaps they have no"],["1952.159","interest in providing for the former"],["1954.559","dead husband's"],["1956.76","mother. That's a financial burden. I"],["1959.919","mean, you get your own mother-in-law."],["1961.12","Can you imagine this dead guy's mother,"],["1963.76","too? That's double the mother-in-law."],["1967.519","Naomi's presence would have been a"],["1969.88","deterrent for these girls to find"],["1973","husbands. And these girls on their own,"],["1975.279","they can't provide for her. So out of"],["1976.88","love, Naomi does what's best for them."],["1979.519","So she thinks and she releases them."],["1981.76","Return to your families. Go find"],["1983.2","husbands. You got to move on with your"],["1985.2","lives. You can't stay here with me. That"],["1988.64","was a huge step of faith because Naomi"],["1990.96","is not young and the chances of her"],["1992.399","getting a husband, she already said, is"],["1993.76","like slim to none."],["1996.399","these young girls, the relationship that"],["1998.799","Naomi has with them is really all that"],["2003.039","all that she has of value. Those that"],["2006.24","family right there, those two girls is"],["2007.919","all that she has and she gives it up"],["2010.88","because that would be what's best for"],["2012.24","those girls. So Orpha makes the rational"],["2016.32","decision and she leaves her"],["2017.679","mother-in-law and she returns to her"],["2018.96","family. But it says, \"What does Ruth"],["2020.72","do?\" Verse 14, Ruth clung to"],["2026.2","her and she said, \"Look, your your"],["2029.679","sister-in-law is going back to her"],["2031.039","people and to her gods. Return after"],["2033.84","your"],["2034.919","sister-in-law.\" But Ruth said, \"Entreat"],["2038.159","me not to leave you or go back from"],["2040.159","following after you. For wherever you"],["2042.039","go, I will go. And wherever you lodge, I"],["2045.919","will lodge. And your people will be my"],["2048.72","people. And your God will be my God. And"],["2052","where you die, I will die. And there"],["2054.72","I'll be married. So the Lord do so to"],["2057.52","me. And more also, if anything but death"],["2060.639","parts you and"],["2064.2","me. And that right there is when the"],["2067.28","story turns about being about the sin of"],["2070.839","IMC to being about the faith of"],["2074.679","Ruth. One of the most beautiful"],["2076.8","utterances in all of"],["2078.599","literature. If you need some passages of"],["2080.8","scripture to commit to memory, get that"],["2083.2","one. Where you go, I will go. And where"],["2087.04","you lodge, I will lodge. You can put"],["2088.48","that one right in your wedding, right?"],["2091.119","Your people, my people. Your God, my"],["2093.839","God."],["2095.44","This is Ruth's step of"],["2098.68","faith. Just as Abraham left his father's"],["2102.32","house to go to a land he did not know in"],["2104.96","obedience to"],["2106.2","God. Just as Moses stepped up to Pharaoh"],["2110.16","and declares, \"Thus sayaeth the Lord,"],["2112.32","let my people go.\""],["2115.359","As David confronted the giant and said,"],["2117.68","\"You come against me with sword and"],["2119.599","spear and javelin, but I come against"],["2121.44","you in the name of the Lord Almighty,"],["2124.16","the God of the armies of Israel, whom"],["2126.32","you have defied. And this day the Lord"],["2129.44","will deliver you into our hands. and"],["2132","I'll strike your head off and we will"],["2134.64","cut down your armies and I'll give your"],["2137.76","carcasses to the birds of the of the sky"],["2140.72","and the wild beasts and the whole world"],["2142.4","will know that there's a God in Israel"],["2144.56","and all who gather here will know it is"],["2146.56","not by sword or by spear that the Lord"],["2149.28","saves. The battle is the Lord's and he"],["2152.079","gives you into our hands. As David and"],["2156.72","his friends Shadrach, Meshach, and"],["2158.079","Abedneo replied to King Nebuchadnezzar,"],["2161.359","\"We do not need to defend ourselves"],["2164","before you in this matter. If we are"],["2166.88","thrown into the blazing furnace, the God"],["2169.28","who we serve is able to deliver us from"],["2172.16","it, and he will deliver us from your"],["2175.119","majesty's hand. But even if he does not,"],["2178.56","let it be known, your majesty, we will"],["2181.28","not serve your gods or worship your"],["2184","golden image."],["2186","There comes a time when we have to"],["2188.48","decide will we or will we not take a"],["2192.16","step of"],["2193.8","faith. Will we believe in God and follow"],["2196.56","him even if his way seems like it's"],["2199.2","going to destroy us, ruin us? Will we"],["2203.04","trust him and take a step of faith? Ruth"],["2204.96","was leaving the safety and the"],["2206.88","protection of her people and her nation"],["2209.599","to go with Naomi to a foreign land to an"],["2212.48","uncertain situation. It was only"],["2214.4","offering"],["2215.64","poverty. I can only speculate as to why,"],["2219.599","but it has something to do with what she"],["2222.16","believed about the Lord. Did you catch"],["2226.32","that? In verse number"],["2228.599","17, she in her pledge, she says, \"Your"],["2231.28","people, my people, your God, my God,"],["2234.079","where you die, I will die. I'll be"],["2235.839","buried.\" And then she says, \"The"],["2239.56","Lord,\" what do you observe about that?"],["2243.44","What do you observe about that right"],["2246.44","there? Look at"],["2248.359","it. What's the"],["2251.64","Lord? Somebody sees it, right? It's all"],["2255.2","capitalized. Every letter is"],["2256.8","capitalized. What does that tell"],["2258.92","you? That is the formal name. What?"],["2262.72","Yahweh. Yahweh. That is the name of the"],["2265.839","God of"],["2267.079","Israel. Naomi said, \"Go back to your"],["2269.599","gods. Go back to your gods at Moab.\" and"],["2271.599","she says"],["2273.8","Yahweh the"],["2275.8","Lord. She wasn't going back to the gods"],["2278.8","of Egypt. She wasn't trusting in the"],["2280.72","gods of Canaanite. She was turning to"],["2283.28","Yahweh. And that ought not be overlooked"],["2285.839","because this story is not about learning"],["2288.32","how to have love and loyalty like Ruth."],["2292.4","It's not about being good and good"],["2294.8","things will come to you. Karma and the"],["2297.2","universe will repay you."],["2300.76","vibes. Good vibes. This is specifically"],["2304.8","about our relationship with Yahweh, the"],["2308.079","Lord God of Abraham, Isaac, and Jacob,"],["2312.079","the great I am who was and is and is to"],["2316.8","come. And the reason why we study this"],["2320.2","book because it is the special"],["2322.8","revelation of the one true God, the"],["2326.24","things that he has done and doing and"],["2328.8","wants us to know. And ignoring him and"],["2331.52","rejecting him has brought Israel"],["2334.599","affliction. But trusting him and seeking"],["2337.44","him likewise has ramifications. So let's"],["2341.52","be clear on the theological message of"],["2343.52","the story. It's not be good to your"],["2346.2","mother-in-law even though that would be"],["2348.52","nice and she would think that was"],["2351.8","lovely. Pastor Rob, this was such a easy"],["2355.68","softball that was lobbed up to you. Why"],["2358.16","didn't you just do a nice Mother's Day"],["2360.88","message that we could just say love your"],["2363.119","mothers and your mother-in-laws? Because"],["2364.96","that's not what Ruth is about. It's"],["2367.28","about a step of faith honoring the Lord,"],["2369.92","not moms. Naomi was being afflicted by"],["2373.599","God and she returned to him. And Ruth"],["2376.16","takes a step of faith to follow and"],["2378","trust in"],["2379.56","Yahweh. And then Naomi does a very wise"],["2383.2","thing. She realizes that this was not"],["2386.32","about what she thought was best for"],["2389.56","Ruth. She had already given her wisdom"],["2391.839","and shared her opinion. You know, go"],["2393.599","with your sister. Go back to your family"],["2395.52","and your gods. But after she hears"],["2398.64","Ruth's declaration, Naomi is wise enough"],["2402.8","to shut her mouth and let Ruth come with"],["2406.48","her to the land of Yahweh. Verse 18. And"],["2410.8","when she saw that she was determined to"],["2412.72","go with her, she stopped speaking to"],["2416.76","her. There is a time to talk to stop"],["2420.8","speaking and let people follow the Lord"],["2423.599","as the Holy Spirit is leading them."],["2426.8","us older"],["2429","people speaking to the"],["2431.4","parents, the"],["2434.119","grandparents, all the people that got"],["2436.48","all these opinions about what the young"],["2439.68","people are doing and how they're"],["2441.68","parenting their children and how they're"],["2443.599","organizing their"],["2445.16","lives. We have all these opinions about"],["2448","what they should be doing. You know,"],["2449.839","it'd be better if you would. I think you"],["2452.8","ought to. What we you need to do"],["2456.599","is when our children are trusting in the"],["2459.88","Lord, we need to let God lead them and"],["2463.52","not us try to be the Holy"],["2465.88","Spirit. We need to know when to stop"],["2469.8","micromanaging and treating them like"],["2471.92","children. Let them grow and develop in"],["2474.8","their faith. Let them even have some"],["2477.64","affliction so that their faith can be"],["2480","made gold. and the Holy Spirit can lead"],["2482.88","them. Roose prepared to make a journey"],["2484.88","to the promised land just as Joshua did."],["2488.4","It's going to be challenging. It's going"],["2489.92","to be hard. But God is going to lead her"],["2492.64","through the affliction to a great"],["2495.72","blessing. Verse number"],["2497.88","19. Now the two of them went along. They"],["2500.319","came to Bethlehem and it happened when"],["2501.92","they came to Bethlehem. All the city was"],["2503.68","excited because of them. And the woman"],["2505.119","said, \"Is this not"],["2506.44","Naomi?\" But she said, \"Don't call me"],["2508.839","Naomi. Call me"],["2510.839","Mara. The Almighty has dealt very"],["2513.119","bitterly with me. I went out full and"],["2515.119","the Lord has brought me back empty. Why"],["2516.8","do you call me Naomi? The Lord has"],["2518.8","testified against me. The Almighty has"],["2521.92","afflicted"],["2523.4","me. As we said at the start, God is"],["2526.44","afflicting Naomi."],["2529.48","Why? To bring her back to the promised"],["2533.24","land. And as she returns, she brings"],["2536.88","Ruth with her. And Ruth's got a and"],["2539.599","God's got a plan for Ruth. So, you know"],["2542.56","what's amazing? We see this time and"],["2544.72","time again. When people go through"],["2546.64","trials and afflictions and return to"],["2548.64","God, they often influence other people"],["2551.839","to come with them. People go out there"],["2554.319","and they live their lives in"],["2555.599","disobedience and sin and they hurt"],["2557.04","themselves and finally they repent and"],["2558.72","they return. And when they do that, they"],["2561.119","end up influencing somebody to come out"],["2562.8","of that mess. Somebody who was in that"],["2564.56","mess with them. It's like, \"Oh, well,"],["2566.24","you're going to go that way. Well, I"],["2567.52","might as well give it a try, too. And"],["2569.76","God always has this way of using our"],["2572","pain and brokenness to help someone"],["2574.52","else. People go into the hospital and"],["2578.079","then while they're in there sick and"],["2579.839","suffering, they dis help some"],["2582.64","discouraged person laying in the bed"],["2584.079","beside them learn about Jesus. Some"],["2586.24","exhausted, wore out nurse. They testify"],["2588.56","to them about God's healing power."],["2591.359","People go to jail and they end up"],["2593.68","reaching people with the gospel. So many"],["2596.72","jail ministries happen because some"],["2598.72","disobedient child of God ends up in"],["2600.56","jail, repents of their sin, and then"],["2602.319","they help people in jail find Jesus."],["2604.64","Isn't that amazing? This is how God will"],["2607.359","use something that seems like it's going"],["2609.04","to destroy us and turn it for good. And"],["2612.56","he loves to do that. Through our"],["2614.96","brokenness and weakness and failure, he"],["2617.28","brings glory to his name. And God loves"],["2619.52","to use broken people because in our"],["2621.96","weakness, his strengths are showcased."],["2625.119","And we see this over and over, God using"],["2627.68","the least of these. So here's Ruth, a"],["2630.4","widow, a Moabitete afflicted by God. She"],["2634.96","by all earthly accounts is the least,"],["2638.24","but we're going to see great things that"],["2641.119","God has in store for her. So we close"],["2644.16","with this. Yes, God does afflict us, but"],["2649.92","he has a plan to bring us through it to"],["2653.52","a place of blessing. So, trust him"],["2657.2","through your afflictions. Obey him. Wait"],["2661.28","to see what great things he's going to"],["2663.68","do for you. Amen. Amen. Let's bow in"],["2667.28","prayer. Thank you, Lord Jesus, for the"],["2670.16","story of Ruth, for these examples of"],["2672.8","people who take steps of faith in the"],["2674.64","hardest, darkest times of their life."],["2677.599","And through that pain, they are in the"],["2681.68","fire and yet it purifies them and they"],["2684.319","come out as gold. We pray that everyone"],["2686.8","here today as they will or are going"],["2691.2","through this affliction that they will"],["2693.68","be tested and their faith will shine."],["2696.48","They will call upon you and you will say"],["2699.76","these are my children and they will say"],["2702.56","you are my God. Praying all this in"],["2705.2","Jesus name. Amen. Close you with a"],["2708.88","benediction now unto him that is able to"],["2711.52","keep you from falling and to present you"],["2714.079","faultless before the presence and glory"],["2716.88","with exceeding joy. To the only wise"],["2719.28","God, our savior be glory and majesty,"],["2723.119","dominion and power, both now and forever"],["2726.28","more. Amen. Have a great Mother's Day."]]},{"id":"9Im0kT0SV1Q","name":"2025-05-25  Discover the Kingman Redeemer (Pastor Rob McNutt)","date":"2025-05-25","transcript":[["21.6","Turn in your copy of the word of God to"],["23.519","Ruth and we're in chapter two. Last week"],["25.439","we saw Ruth went out looking to find"],["27.76","what was it? Favor. Find favor. And we"],["31.279","learned what exactly favor is and why we"],["34.239","too ought to be looking for it. And we"],["36.48","talked about how to find favor. Sure"],["39.2","enough, Ruth found favor with one of"],["42.04","Naomi's husband's relatives, and his"],["44.879","name is Boaz. Okay. Because of the favor"],["49.28","Boaz shows Ruth, she had a really good"],["52.079","day gleaning barley. So, that's where"],["54.32","we're picking up the story. Chapter 2,"],["56.32","verse number 14. Uh, and it says here,"],["59.6","\"Now Boaz said to her at meal time, come"],["62","here, sit, and eat of the bread and dip"],["66.32","your piece of bread in the vinegar.\" So"],["69.04","she sat beside the reapers, and he"],["71.52","passed her parched grain to her, and she"],["73.2","ate and was satisfied, and kept some"],["75.4","back. And when she rose up to glean,"],["78.24","Boaz commanded the young men, saying,"],["79.92","\"Let her glean even amongst the sheav."],["81.92","Do not reproach her. Also, let grain"],["85.799","from the bundles fall purposely for her."],["88.96","Leave it that she may glean, and do not"],["91.119","rebuke her. So she gleaned in the field"],["93.52","until the evening, and beat out what she"],["95.2","had gleaned. And it was about an ephod"],["98.159","of barley. Then she took it up and went"],["100.799","into the city, and her mother-in-law saw"],["103.119","that what she had gleaned. So she"],["105.28","brought out what and gave her what she"],["107.68","had kept back after she had been"],["110.479","satisfied. and her mother-in-law said to"],["112.399","her, \"Where have you gleaned today? And"],["114.56","where did you work? Blessed be the one"],["117.2","who took notice of you.\" So Naomi"],["120.56","recognizes that Ruth had a really good"],["122.479","day. She has lots of barley, and she"],["124.88","even has some leftovers from lunch that"],["126.799","she brought home to share with Naomi. I"],["129.119","don't know about you, but I like it when"],["131.44","someone brings me some leftovers."],["134.4","Elelliana will go to a lady's fellowship"],["136.08","and she'll sneak out a plate of"],["137.959","leftovers and I think that's really"],["140.239","nice. Not that I need it, but it's"],["143.12","always something tasty. Now, for Naomi,"],["145.599","this is more than just nice. They need"],["148.8","this food because right now they're very"],["152.08","poor and they can't afford to waste"],["155.04","anything. There is a generation of"],["158.16","people here today who were taught waste"],["162.68","not want not. It was practically a sin"],["167.519","to throw food away. You had to clean"],["170.4","your plate. It's a throwback to a time"],["172.959","when folks were had hard times and"],["175.519","getting food on the table was a struggle"],["177.68","in and of itself. So throwing anything"],["179.36","away, you couldn't afford to do that."],["181.76","And you know, like I'll I'll still be at"],["184","restaurants and somebody will order like"],["185.68","a $30 entree and uh leave a third of it"],["188.879","on the plate and I'm just shocked. It's"],["191.519","like that's $10 worth of food right"],["193.36","there. It's like, why don't you take"],["194.959","that home? Take it with you. When"],["197.36","Elelliana and I would take the boys out"],["198.959","to eat, I guarantee you there was never"],["201.36","any leftovers for those guys. But"],["203.84","between the four of us boys, there was"],["206.159","there was nothing left. And still to"],["208.72","this day, if we're at a restaurant and"],["211.04","somebody is full and they're done, you"],["213.28","just kind of hold the plate up and says,"],["214.56","\"Anybody want to finish these fries?"],["217.36","Does anybody want the rest?\" And it's"],["219.36","open season for all of us. Especially if"],["222.239","Roberto's home, he just hawks everything"],["224.56","down now. Ricky used to be the garbage"],["226.64","can, but now Robbie has taken that. And"],["230.239","sometimes, um, I just wants to see them"],["233.44","happy eating, so she doesn't even finish"],["235.36","her food. She just lets them eat it. And"],["237.28","it it's always sad for me because I want"],["239.519","it and she just, you know, prefers"],["243.04","giving it to the boys. So, what can you"],["247.56","do? These boys have been in my way my"],["249.92","whole"],["252.2","life. Verse"],["254.519","18. I'll get counseling. I promise."],["258.88","She took what she went up and went into"],["261.199","the city and her mother-in-law and saw"],["262.96","she had gleaned and she brought out what"],["265.28","she gave her and kept back for her and"],["267.52","was satisfied. And then her"],["269.919","mother-in-law says, \"Where have you"],["271.28","gleaned today?\" Verse 19, \"Where did you"],["273.28","work? Blessed be the one who took notice"],["275.12","of you.\" So, uh, remember that we"],["278.16","learned last week, the assignment wasn't"],["280.52","food. It was to find favor. So, Naomi is"],["284.88","curious. Where did you glean? who took"],["287.36","notice of you? And she says, \"This guy,"],["291.96","Boaz.\" And to Ruth, that's just some"],["294.479","fella she just met out there in the"],["296.32","field. To Naomi, Boaz is so much more."],["300.4","Verse 20, Naomi said to her"],["302.4","daughter-in-law, \"Blessed be he of the"],["304.72","Lord who has not forsaken his kindness"],["307.6","to the living and the dead.\" Naomi said"],["310.08","to her, \"This man is a relation of ours,"],["312.72","one of our close relatives.\" So if you"],["315.84","go back to the beginning of the chapter"],["317.759","verse number one uh we see that there is"],["321.479","a again a emphasis on the relationship"],["326.08","of Boaz the there was a relative of"],["328.4","Naomi's husband a man of great wealth of"],["330.479","the family of IMC his name was Boaz"],["333.28","verse number three uh Ruth went and"],["335.919","gleaned in the fields after the reapers"],["337.759","and she happened to be in the part of"],["339.52","the field belonging to Boaz who was what"],["342.639","of the family of Imc"],["345.4","So out of the first three verses, two"],["348.24","times the story tells us Boaz is a"],["350.72","family member on IMC's side. And uh it's"],["354.24","interesting that the text uses two"],["356.4","different Hebrew words. So in chap"],["358.72","chapter 2 verse one, Moda is the the"],["362","Hebrew word it means kinsman or"],["363.919","relative. Chapter 2:3 it's mitzaka. It's"],["368.639","clan or tribe. And that word carries a"],["371.199","more broader idea. Then we get to verse"],["374.319","number 20 and then again he she uses"],["378.479","these different words. He says this man"],["380.319","is a relation of ours one of our close"],["383.44","relatives and these likewise are"],["385.759","completely different words. It's uh"],["387.919","first relation is kob which means"],["390.4","personal relation. And then the second"],["393.199","word which is uh translated here in the"],["395.919","king new king James one of our close"],["397.84","relatives is"],["400.36","gaal. And that word uh the English"],["404.16","translation here does not do justice to"],["406.96","what gal is. It's very specific. So I"],["410.319","was just wondering why these different"],["412.08","terms. This is something that I think we"],["414.8","can relate to because we will do the"],["416.639","same thing, right? Family is a word that"],["418.88","can mean several things. And if I said"],["421.52","the Mcnut family, those of you been"],["423.68","around here for a while, you just in"],["425.12","intuitively think Rob, Iana, and the"],["427.44","three boys. Uh, but since the boys have"],["429.84","gotten married, now our family has"],["431.919","grown. And so now we got some"],["433.12","daughter-in-laws and they are now part"],["435.039","of the Mcnot family. And for the"],["437.759","wedding, my father and mother and my"],["439.68","sister and her kids were in town and"],["441.68","they too are my family. And then there's"],["444.8","times where you see Illana and his"],["446.72","mother and sister and her children here"],["448.479","and they too are my family. And uh then"],["452","if the daughter-in-laws uh have their"],["454.16","family over here, they too get all"],["456","lumped in as being part of my family."],["458.72","And then I we're going to talk about"],["460","going to Canada to visit uh family up"],["462.479","there. And that's a whole bunch of"],["463.52","people you've never even seen before."],["465.28","And so the word family can mean a whole"],["467.84","pile of people. So in order to be"],["470.479","specific, we use other words. We say"],["473.12","immediate family. We say uh family on my"],["476.72","mother's side, family on my father's"],["478.879","side. We say in-laws, nieces, nephews,"],["481.52","uncles, aunts. Some people call me uncle"],["484.24","Rob. The Spanish side, the kids call me"],["486.8","Tio Rob. Some of the kids who call me"],["489.36","uncle or teo. That's not accurate. I'm"],["491.84","not their uncle. Technically, I'm a"],["493.36","cousin or I'm married to their cousin."],["494.879","But since I'm older, they think of me as"],["497.12","an uncle. And at some point, it really"],["499.199","doesn't matter. All anyone knows is"],["501.199","whoever shows up on Memorial Day for"],["502.879","crabs is considered family. Call me"],["505.919","whatever you want. Pass the crabs."],["509.68","However, when it comes to scripture,"],["512.479","it's not whatever. The relationships are"],["515.68","important and the details matter because"],["518.159","there are laws that govern how these"],["520.8","people are to interact with one another."],["522.8","There are covenants. There are"],["524.72","prophecies spoken. There are specific"],["527.12","things God is doing that is directly"],["529.839","connected to these specific people. See,"],["532.32","these accounts are not fairy tales."],["534.959","They're not myths. They're not folklore."],["537.2","There is historical evidence. There is"],["539.519","textural evidence. There is"],["541.24","archaeological evidence. There is DNA"],["543.839","evidence, genealogies that detail who's"],["547.44","related to who. And it's all important"],["550","because it's all one message, the word"],["552.959","of God. And it's all tied together. So,"],["556.32","in order to accurately interpret it and"],["558.399","fully comprehend it, we need to pay"],["560.24","attention to what the author is"],["562.399","emphasizing. A big importance is being"],["565.12","placed on the family that Ruth has"],["567.76","married into. IMC of the tribe of Judah"],["571.6","of the town of Bethlehem. Have you ever"],["574.56","heard of Bethlehem before? Oh, I think"],["577.279","we remember. Oh, little town. Yeah, you"],["580.399","know that one. It's wrong season. Can't"],["582.399","talk about that now. Boaz is of this"],["584.56","tribe and he is a close relative, a near"],["587.959","relation, which means what? Well, the"],["591.2","word near personal relation. We know"],["593.36","it's not brother because we know the"],["595.04","Hebrew word for brother. It's a it's not"],["598.16","uncle because that's dod. That's the"],["600.16","Hebrew word for uncle. So what could he"],["602.24","be if he's a close relation? He's not an"],["603.68","uncle. He's not a brother. He's a maybe"],["606.36","a cousin. A cousin. My uh grandfather"],["611.839","has passed on. Had 13 grandsons."],["615.36","The oldest is Benjamin Stockdike,"],["618.88","married Dutch side. So he's 10 days"],["621.2","older than me. He's born on April 16th,"],["623.24","1971. I was born 10 days later, April"],["625.959","26. And I'm the second oldest grandson."],["628.64","The next fella is Jonathan Benjamin's"],["631.36","brother who's two years younger than us."],["633.44","Growing up, these were my favorite guys"],["635.6","to go visit. I we lived six hours away"],["638.399","so we would generally travel down there"],["640","like in the summer one time a year and"],["643.12","uh typically that resulted in a"],["644.72","sleepover at Uncle Bill and Aunt"],["646.24","Bonnie's and so I would uh go and hang"],["648.88","out with my cousins and we would have a"],["650.88","you know sleep in the room there"],["652","together and uh that resulted in"],["654.44","shenanigans and Uncle Bill would stomp"],["656.959","down the hall and threaten to whoop us"],["658.72","all if we didn't settle in. Good times."],["664.32","Ben and John love to fish. They love it"],["667.519","so much that they are members of the"],["668.959","Canadian International Sports Fishing"],["671.399","Association, the"],["673.88","CISA. They're so good at bass fishing"],["676.64","that they qualified to be on Team Canada"],["680.32","that this week is in Mexico competing in"],["682.48","an international bass fishing"],["684.24","competition. There's a picture of them."],["686.16","They're official uh on the website. Now,"],["688.8","I don't know what you think about that,"],["689.92","but I think that's pretty cool. and I"],["692","hope my cousins win the international"],["694.399","bass fishing"],["696.6","tournament. I have cousins who were in"],["698.64","the Canadian Army, cousins who are"],["700.48","engineers, cousins who own construction"],["702.8","companies. One fella has green houses"],["705.44","and he grows tomatoes and cucumbers, the"],["707.92","very finest in the land. I'm not"],["710.24","particularly close to any of my cousins,"],["711.839","but from what I hear, they're all"],["713.279","married, good dads who love and provide"],["716.079","for their families. When we go up to"],["718.24","Canada this summer, my aunt Sherry is"],["720.48","planning a family get together and this"],["722.399","will be the first time I'll see any of"],["723.68","these folks in six years now. So maybe"],["726.72","Ben and John will bring us some Mexican"],["728.8","bass. Or maybe they won't even bother to"],["731.519","show up because they may have something"],["733.76","else planned. Or maybe they won't feel"],["736.24","it's worth their time to come see us."],["738.56","After all, it's been years since we've"],["740.16","talked. We are family. We're first"],["742.32","cousins, but we're not very close."],["745.2","meaning I don't know how they feel about"],["748.079","me. I don't know if they feel any bond"],["750.88","of affection that it would be worth"],["752.88","their time to come hang out for the"],["754.639","afternoon. I I think that's what the"],["756.8","different words for family in chapter 2"],["758.72","is communicating. Naomi in verse 20 is"],["761.279","stressing that Boaz is more than just a"],["763.04","family member. This man is Karob. He's"],["766","near. He's personal relation. He's one"],["768.72","of the"],["770.519","gaal next kinsmen. Now, that word some"],["775","translations and maybe some of your"],["776.88","translations in here will say our"],["778.48","family's redeemer. Anybody got that one"],["780.079","that says family's redeemer? Some of you"],["782","have that. Gal is more than just a"],["784.079","relative. The word carries with it legal"],["786.839","responsibilities. It could be translated"],["789.519","redeemer or even"],["792.279","avenger. Boaz is an avenger. Oo, like"],["795.04","Iron Man or Captain America. Oo, maybe"],["797.92","we have similar similar terminology. We"],["800.639","call it next of kin. It's what we call"],["803.12","the person who's been delegated to deal"],["805.36","with the legal responsibilities of a"],["807.279","loved one once they've passed away."],["809.12","Probably they're going to inherit the"],["811.88","estate and be the one who makes sure the"],["814.48","person's will has been followed. We"],["817.839","don't really have the avenger part, at"],["820.24","least that I'm aware of. Um, but you"],["824.56","know, talking to some of the folks"],["827.639","from the hillbilly side of, you know,"],["831.399","people, did you ever see that movie uh"],["833.519","Next to Kin by Patrick Sees? It's an old"],["835.76","movie, 1989. So, uh, sees from"],["838.92","Appalachia and his brother was a cop in"],["841.68","Chicago who was murdered by the mob and"],["844.88","sees to go to the city and administer"],["847.519","some hillbilly justice. Is that still"],["849.36","going on, Jennifer? Do we still do that?"],["850.88","Still apparently we still do this uh"],["853.6","hillbelly justice thing. Now since he"],["855.68","was next of kin, he had to go avenge his"],["857.6","brother's death. It's a cool movie, but"],["859.44","actually that is Old Testament. It's"],["862.8","part of what is entailed in being God, a"],["865.279","kinsman redeemer. Look at Numbers"],["867.36","chapter 35. Turn to Numbers chapter 35."],["870.399","This is some wild stuff this morning. We"],["872.48","go back into the laws of Moses. Verse"],["875.6","number nine. Moses, Numbers 35, verse"],["877.92","number nine. The Lord spoke to Moses,"],["880.24","saying, \"Speak to the children of Israel"],["882.079","and say to them, 'When you cross the"],["883.6","Jordan into the land of Canaan, then you"],["885.6","will appoint cities to be cities of"],["887.04","refuge for you, that the manslayer who"],["889.839","kills another person accidentally may"],["891.76","flee there.\" Numbers"],["894.44","35:12. They shall be cities of refuge"],["896.8","for you from the avenger. The avenger,"],["899.199","the gaal is the Hebrew, that the"],["902.24","mansllayer may not die until he stands"],["904.56","before the congregation in judgment. And"],["907.199","of the cities which you shall give, you"],["909.12","shall have six cities of refuge. You"],["911.12","shall appoint three cities on this side"],["912.48","of the Jordan, and three cities you"],["913.68","shall appoint in the land of Canaan,"],["914.959","which shall be the cities of refuge."],["916.399","These six cities shall be for refuge for"],["918.32","the children of Israel, for the"],["919.76","stranger, for the sojourer among you,"],["922","that anyone who kills a person"],["924.04","accidentally can flee there. But if he"],["926.8","strikes him with an iron implement so"],["928.24","that he dies, he's a murderer. The"],["930.079","murderer shall be put to death. If he"],["931.839","strikes him with a stone in the hand,"],["933.36","which by which he could die, and he does"],["935.199","die, he's a murderer. The murder will be"],["936.88","put to death. If he strikes him with the"],["938.399","wooden hand weapon by which the person"],["940.72","could die and he does die, he's a"],["942.48","murderer and the murderer will be put to"],["943.839","death. So, here's what this law is"],["945.519","dealing with. It's dealing with murder"],["947.199","and manslaughter. Someone has lost their"],["949.519","life and now the family avenger, the"],["953.04","goal is hunting the asalent down. In the"],["956.399","Old Testament law, it was eye for an"],["959.16","eye, tooth for tooth, life for life."],["963.12","Now, sometimes death is accidental. And"],["965.759","if you accidentally killed someone, you"],["968.079","fled to a city of refuge. And once you"],["971.36","got there, the gaal, the avenger, could"],["974.24","not kill you until you got a trial. If"],["976.959","it was an unintentional death, your life"],["978.48","would be spared. But if you didn't get"],["980.16","to the city of refuge, the gaal caught"],["981.92","up with you. He could legally kill you."],["984.32","If you unintentionally killed someone,"],["986.32","the kins and redeemer, he was out to get"],["988.8","you. But if you intentionally killed"],["990.32","someone, oh, he you you were done for."],["992.8","Look at verse number uh 19. Uh the"],["995.36","avenger of blood, that's the go all"],["997.68","himself shall put the murderer to death."],["999.44","When he meets him, he'll put him to"],["1000.72","death. If he pushes him out of hatred,"],["1003.199","lying in weight, hurl something to him"],["1005.759","to die, emnity to strike with his hand"],["1008.399","so that he dies. The one who struck him"],["1010","will surely must be put to death. He is"],["1013.279","a murderer. The avenger of blood shall"],["1015.279","put the murderer to death when he meets"],["1016.8","him."],["1018.48","That's what the Gal is. Now, in Naomi's"],["1021.04","case, her husband was not killed. He"],["1023.759","died of, I don't know, disease or"],["1025.28","something, but he wasn't murdered. So,"],["1026.959","Boaz is not required to hunt anybody"],["1029.36","down and kill anybody. But there are"],["1031.199","other jobs that the kinsman redeemer was"],["1033.199","supposed to do. Turn to Leviticus 25."],["1036.72","Leviticus 25"],["1040.6","23 says, \"The land is not to be sold"],["1044.12","permanently.\" This is God speaking. The"],["1046.64","land is mine. You are strangers and"],["1048.88","sojourers with me. And in all the land"],["1051.12","of your possession, you shall grant"],["1053.12","redemption of the land. Redemption of"],["1055.919","the land. Verse 25. If one of your"],["1059.28","brethren becomes poor and has sold some"],["1062.16","of his possession, and if his redeeming"],["1064.32","relative comes to redeem it, then he may"],["1067.12","redeem what his brother sold. Or if a"],["1069.2","man was not with has no one to redeem"],["1071.6","it, but he himself is able to redeem it,"],["1074.4","then let him count the years for the"],["1075.76","sale and restore the remainder to the"],["1077.28","man to whom he sold, he may return to"],["1079.6","his"],["1081","possession. God swore a covenant with"],["1084.12","Abraham that his family would have this"],["1087.039","promised land. God had Moses lead the"],["1090.32","people out of slavery to the promised"],["1093.2","land. God had Joshua conquer the land"],["1096.32","and distribute it between the 12 tribes"],["1098.96","of Israel. That was the fulfillment of"],["1101.039","God's covenant with Abraham. The point"],["1103.36","here is God has given the land to the"],["1106.16","nation of Israel as an inheritance."],["1108.64","Their children are always to inherit the"],["1111.44","land, which means they always have a"],["1113.679","home. The land provides food for the"],["1116.08","people. So they will always be provided"],["1118.24","for. But sometimes people fall on hard"],["1120.48","times. People get sick or injured and"],["1122.64","they can't work the land. Famine comes"],["1124.559","and brings poverty. People can't afford"],["1126.48","to stay on their land. That's what"],["1128","happened with IMC. He sold the land and"],["1130.08","he moved to Moab. That was disastrous"],["1132","move for his family. Nevertheless,"],["1134.4","despite IMC's foolishness and"],["1136.28","disobedience, God has a way for the land"],["1139.76","sold in poverty to be returned back to"],["1142.72","IMC's family because it is IMC's"],["1146.52","eternal"],["1148.28","inheritance. But since IMC sold it, it"],["1151.919","has to be bought back. Legally, it has"],["1155.039","to be sold back. They can't just take it"],["1156.559","back. So, as long as there's a kinsman"],["1158.88","redeemer who can buy it back, he can get"],["1161.2","that land back. This summer, we're going"],["1163.36","to go to Nova Scotia and we're going to"],["1165.52","drive by all these properties that used"],["1167.84","to belong to my"],["1170.28","greatgrandfathers and my grandfathers on"],["1172.799","both sides, father and mother's side."],["1174.88","And I know where these homesteads are,"],["1176.799","and I know where the grave sites are. I"],["1178.799","know where the old farms are. And those"],["1181.28","properties, if I wanted to redeem them,"],["1184.08","my family's homesteads, I would"],["1187.16","need millions of dollars to buy them"],["1191.36","back. Just the house my father built 50"],["1194.08","years ago for"],["1198.2","$19,000. Built his own house for"],["1200.36","$19,000. I was a baby in that house. He"],["1203.039","sold it when I was like four years old."],["1204.88","He was telling us when he was down"],["1206.08","visiting how he built it that he built"],["1208.16","the forms for the septic tank. I was"],["1210.4","like, \"Oo, you built the for he built"],["1212.08","the forms for the foundation to be"],["1214.08","poured in.\" Tony was amazed that he did"],["1216","that. He was 21 years old when he went"],["1218","out and he built all of that with his"],["1220.24","own hands. And if I wanted to buy that"],["1222.24","three-bedroom home back, I would need"],["1226.76","$400,000. In 1975, he sold it for"],["1231.08","$27,000. That's what's going on. I have"],["1234.72","no land inheritance. Even if I had the"],["1237.679","money to buy all these properties back,"],["1239.6","they may not be for sale. And there"],["1241.44","would be no legal way for me to compel"],["1243.12","those people to sell them to me. You"],["1244.559","know, I go in the go into the house and"],["1246.24","say, \"My dad built this house. This is"],["1248.88","my childhood bedroom right here.\" They"],["1251.6","would say, \"Get out of here, crazy"],["1254.52","person.\" 911. I don't know if they have"],["1257.36","911 in Canada. I don't call somebody"],["1260.52","RCMP. I have no inheritance in Canada."],["1263.679","But for the children of Israel, they"],["1266.24","always had ancestral rights, inheritance"],["1269.6","rights to that land. Even if it was"],["1272.32","sold, it had to legally come back to"],["1274.72","them. All you needed was a kinsman"],["1277.44","redeemer who would buy that land back"],["1279.52","for you. Now, the question is, why would"],["1282.64","he want to do that? Why would this"],["1284.799","kinsman redeemer spend his own money to"],["1287.039","buy your land back for you? H let's"],["1291.039","let's wait on that answer. Avenging a"],["1293.76","death and buying back land is part of"],["1295.28","what the kinsman redeemer does. Now"],["1297.2","sometimes someone is so poor they sell"],["1298.919","themselves into debt into slavery. And"],["1303.28","the kinsman redeemer could buy that"],["1305.36","person back out of that debt. That's"],["1308.12","Leviticus 25 47. If a sojourer or a"],["1312.64","stranger close to you becomes rich and"],["1314.799","one of your brother who dwells him"],["1316.48","becomes poor and sells himself to the"],["1318.64","stranger, the sojourer close to you or"],["1320.559","to a member of the stranger's family"],["1322.559","after he's sold, he may buy him back"],["1324.88","again. One of his brothers may redeem"],["1327.28","him. That's ga the same Hebrew word"],["1330.08","redeem him or his uncle or his uncle son"],["1332.88","may redeem him or anyone who is near of"],["1334.559","kkin to him. His family may redeem him"],["1337.039","or if he's able, he can redeem himself."],["1338.96","Well, that sounds horrible. selling"],["1340.64","yourself into slavery. Who would do"],["1342","that? Well, you know, actually pretty"],["1343.2","well all of us, right? For houses and"],["1344.88","cars and credit cards and education, we"],["1346.799","assume debt. And we've agreed to pay"],["1349.76","work and pay that debt. And that person"],["1352.159","who owns our debt, they charge us"],["1354.08","interest, compound interest, 5, 10,"],["1357.96","19%. So, they load that on us unless"],["1362.159","someone with a lot of money wants to pay"],["1364.88","that off for us. Anybody want to pay off"],["1367.28","my credit card? No. Okay. Maybe I'll be"],["1370.159","debtree before I die. Who knows? But a"],["1372.08","kinsman redeemer could buy you out of"],["1374.72","that debt slavery. Now the question is"],["1378.559","once again, why would he want to do"],["1380.72","that? Spend his own money to get you out"],["1382.96","of"],["1384.039","debt. Let's answer that in a minute."],["1386.4","There's yet another duty that the"],["1388.4","kinsman redeemer could assume. And this"],["1390.159","one's really interesting. So if you're"],["1391.84","bored right now, I think I'll get your"],["1393.2","attention on this one. The duty of the"],["1395.919","kinsman redeemer was not limited to"],["1398.24","preservation of the relative or their"],["1400.159","property. They also were required to"],["1403.36","ensure that a relative got a descendant"],["1406.72","in the case of death. If someone died"],["1409.2","without having children, his kinsman"],["1411.52","redeemer, his brother was expected to"],["1413.6","marry the wife in order to preserve the"],["1415.679","name of the one who died through the"],["1417.039","firstborn of that wife."],["1420.28","Deuteronomy 25-10."],["1424.32","Look at this"],["1426.28","one. If a brother dwells together and"],["1429.44","one of them dies and has no son, the"],["1431.919","widow of the dead man shall not marry a"],["1434.799","stranger outside the family, but her"],["1436.4","husband's brother shall go to her, take"],["1438.88","her as wife, perform the duty of a"],["1440.4","husband's brother to her. And it shall"],["1442.64","be that the firstborn which bears will"],["1445.679","succeed the name of the dead brother,"],["1447.76","that his name may not be blotted out of"],["1449.6","Israel. But if the man does not want to"],["1452","take his brother's wife, then his"],["1453.919","brother's wife will go up to the gate to"],["1455.76","the elders and say, \"My husband's"],["1458.4","brother refuses to raise up a name to"],["1460.799","his brother in Israel. He will not"],["1463.12","perform the duty of my husband's"],["1465.48","brother.\" Then the elders of the city"],["1467.84","will call and speak to him. But if he"],["1469.52","stands firm and says, \"No, I don't want"],["1471.6","to take her.\" Then the brother's wife"],["1473.679","shall come to him in the presence of the"],["1475.279","elders. Remove his sandal from his foot,"],["1478.48","spit in his face, and say, \"So shall be"],["1481.279","done to the man who does not build up"],["1482.96","his brother's house, and his name in all"],["1485.36","of Israel would be called the house of"],["1487.12","him who had his sandal"],["1490.919","removed.\" Now, remember that sandal part"],["1493.44","because we're going to we're going to"],["1494.559","get to that in another sermon. This"],["1496.96","sounds weird to us, but you have to"],["1498.96","understand back in the day, the"],["1500.72","covenants and the blessings of God were"],["1502.96","connected to the land and to your seed,"],["1506.159","to your descendants. The laws were"],["1508.799","there. The laws of Moses were there to"],["1511.36","ensure everyone had blessing through"],["1514.08","your family. You are provided for on"],["1516.799","your family land. So, a father worked"],["1519.279","the land and provided for his wife and"],["1520.96","children. And once he was old, his sons"],["1523.44","and his son-in-laws would work the land"],["1525.679","and provide for him. And once he died,"],["1527.52","the land passed on to them. And they"],["1529.679","continued that same process. But if he"],["1532.08","had no children, once he was old, who"],["1533.76","would provide for him? And if he died"],["1535.36","and his wife was left there with any"],["1537.36","children, who would provide for her? And"],["1539.12","who would get the land? So the kinsman"],["1541.76","redeemer was a way of providing for this"],["1543.84","family in that situation. IMC had land,"],["1548.08","sold it because he was poor, went to"],["1550.4","Moab. Na, he dies, his sons die. Naomi"],["1554.799","comes back with nothing to no land, and"],["1558.48","all she's got is"],["1560.12","what? A daughter-in-law. But this"],["1563.96","daughter-in-law and the kinsman redeemer"],["1567.6","is the key to getting this family out of"],["1569.919","debt. Which is what Naomi means when she"],["1573.12","says Boaz is ga. He is legally the guy"],["1577.279","who can save us, redeem us out of"],["1580.64","poverty. And yet the question is why"],["1583.279","would he want to do that? Why would he"],["1585.279","spend his money and marry this"],["1587.96","widow? All right, let's get to that"],["1589.84","answer. Verse 21. Ruth the Moabus said,"],["1593.52","\"He also said to me,\"You shall stay by"],["1595.6","my young men until they have finished"],["1597.679","all the my harvest.\" And Naomi said to"],["1599.84","Ruth, her daughter-in-law, \"Ooh, it is"],["1602.159","good, my daughter, that you go out with"],["1604.88","these young women, and that people do"],["1606.96","not meet you in any other"],["1609.4","field.\" So she stayed close by the young"],["1612.24","men of Boaz to glean until the end of"],["1614.08","barley harvest and wheat harvest, and"],["1615.84","she dwelt with her mother-in-law. This"],["1617.679","is very intentional, isn't it? It's good"],["1620.159","that people do not meet you in any other"],["1622.48","field, Ruth. Why,"],["1624.84","Naomi? Well, Naomi's got something in"],["1626.96","mind here. For this kinsman, redeemer,"],["1630.72","Boaz. She doesn't want anyone else to"],["1633.12","meet Ruth. H, you got to got a sneaking"],["1636.159","suspicion. Why? Naomi doesn't want"],["1638.799","anyone to meet Ruth because Naomi wants"],["1641.24","Boaz to be the kinsman redeemer. And I"],["1644.96","suspect Ruth is very attractive. And if"],["1648.64","other people meet her, they would"],["1650.48","realize, \"Hey, this family needs a"],["1652.88","kinsman redeemer. I will get a nice"],["1654.799","piece of land and I'll get a pretty"],["1656.48","young wife.\" But Naomi is hatching a"],["1658.96","plan where Ruth gets the kind, wealthy"],["1663.12","Boaz. How's she going to do that? Well,"],["1666.32","you'll have to come back next week to"],["1667.36","find out. So, you got to sit there with"],["1669.12","that. And that's a good reason to come"],["1670.48","back. But maybe you're sitting here and"],["1672.32","you're intrigued by this history lesson."],["1674.64","You know, you like sociology and the"],["1676.96","laws and the customs of ancient Israel,"],["1678.799","but you might be a little confused."],["1679.919","Well, what am I supposed to do with"],["1680.799","this, Pastor Rob? I mean, how is this"],["1682.64","relate to me? So, remember this is not"],["1686.159","just sociology. This is"],["1690.44","theology. And because it's theology, God"],["1694.159","through these laws is teaching us his"],["1696.64","standard for righteousness, his ideas"],["1699.279","for holiness. With this kinsman redeemer"],["1702.08","laws, we see that God has taken into"],["1704.919","consideration failure, poverty, slavery,"],["1708.88","brokenness, sin, and death. And he's"],["1712.159","created a system that can pull people"],["1714.559","out of these horrible situations and"],["1716.64","redeem them from all this debt. God"],["1719.039","cares so much about this that he made it"],["1721.6","law. He made it part of the standard for"],["1723.84","righteousness. He wants people redeemed."],["1727.039","Now the challenge for Naomi and Ruth is"],["1729.6","do we have a gal? Is there someone who"],["1732.399","will redeem us? And the answer is yes."],["1734.799","It's Boaz. He is qualified. He's next of"],["1738.159","kin and he's wealthy. He's got the money"],["1740.559","to do it. So he could, but will"],["1745.32","he? So this is where we finally answer"],["1747.679","the question. The question is why would"],["1750.159","anyone want to be kinsman and redeemer?"],["1752.24","Why would anyone want to pay someone"],["1754.64","else's debts? Why would anyone want to"],["1756.559","sacrifice their resources? Why would"],["1758.64","someone want to take the responsibility"],["1760.32","of raising an heir on the behalf of"],["1762.64","another? Why do you want to provide for"],["1764.48","someone else's family? And the answer to"],["1766.799","that has got to"],["1768.919","be"],["1770.52","love. It's got to be love. Boaz is going"],["1773.76","to do this because Ruth found favor in"],["1777.2","his eyes. And Boaz is about loyalty to"],["1780.24","family and about loving his family."],["1784.48","This is Memorial Day weekend and we"],["1787.36","remember people who sacrificed for our"],["1790.159","freedoms. People who sacrificed for our"],["1792.799","country, people who fought to avenge and"],["1796.44","defend. And nobody signed up thinking,"],["1798.72","\"Oh man, I really hope I can die. Hope I"],["1800.72","can just, you know, get in a battle over"],["1802.64","some"],["1803.399","wast.\" But when they signed up, they"],["1805.84","knew that would be an option. So they"],["1807.84","had to think, am I okay with"],["1810.76","that? And then they concluded."],["1813.84","I'm prepared to sacrifice for the good"],["1816.32","of people. Jesus says, \"Greater love has"],["1820.399","no man than this, that a man would lay"],["1823.039","down his life for his friends.\" And"],["1825.12","Jesus knew what he was talking about."],["1827.039","The kinsman redeemer from the laws of"],["1829.36","Moses from the story of Ruth is God's"],["1832.08","way of explaining to us how much he"],["1834.52","cares. That love and loyalty are core"],["1838.559","values. And you know this John 3:16, for"],["1842.559","God so loved the world that he gave his"],["1846.48","only begotten son that whosoever"],["1848.72","believes in him will not perish but have"],["1852.559","everlasting life. God cares about us and"],["1855.36","has a plan to redeem us back out of debt"],["1859.559","slavery. A way to make us"],["1863.399","hes and provide all the promised"],["1866","blessings to all of us. It is through"],["1869.36","the kinsman redeemer. Someone who has"],["1871.919","the resources and someone who has the"],["1874.08","love and loyalty to family to want to"],["1876.72","save us. And this was what God was"],["1878.96","planning through the line of Abraham. He"],["1881.6","incorporated the plans in the law of"],["1883.6","Moses. He enacted a literal biological"],["1886.48","line through Judah that's running"],["1889.279","through this story right here leading at"],["1891.84","the end of Ruth to King David which"],["1894.08","ultimately leads to Jesus Christ. Jesus"],["1898","is the son of God, but he is literally a"],["1900.64","physical son of man. He has a historical"],["1904.279","biological genealogy that connects him"],["1906.96","to the kinsman redeemer. Jesus is flesh"],["1909.519","and blood. He is our brother. He is our"],["1912.32","near relative. He has the resources and"],["1915.12","he has the love to compel him to redeem"],["1917.679","us."],["1919.64","So,"],["1922.2","amen. God's plan for humanity is"],["1925.039","redemption. And Paul lays it all out for"],["1927.12","us in Ephesians chapter 1. Turn to"],["1929.279","Ephesians chapter 1 verse number three."],["1931.919","Blessed be the God and father of our"],["1934.159","Lord Jesus Christ who has blessed us"],["1936.24","with every spiritual blessing in the"],["1938.96","heavenly places in Christ just as he"],["1941.039","chose us in him before the foundations"],["1943.6","of the world that we should be holy and"],["1945.76","without blame before him in love. Having"],["1949.919","predestined us to the adoption as sons,"],["1952.48","we are adopted as sons and daughters"],["1955.039","into his family by Jesus Christ to"],["1957.36","himself according to the good pleasure"],["1959.12","of his will to the praise and glory of"],["1960.96","his grace which he made us acceptable in"],["1964.799","the beloved. Verse seven. And this is"],["1968.08","the"],["1969.32","redemption through his"],["1971.72","blood, even the forgiveness of sins,"],["1974.32","according to the riches of his grace,"],["1976.32","which he made abound to us in all wisdom"],["1978.88","and prudence, having made known to us"],["1981.039","the mystery of his will, according to"],["1982.799","his good pleasure, which he purposed"],["1984.559","himself, that in the dispensation of the"],["1986.48","fullness of time, the dispensation of"],["1988.08","the fullness of time. See what I've been"],["1989.6","doing with you in Ruth and talking about"],["1991.519","Abraham and Moses and the laws. That's"],["1993.84","the That's God planning it all the way"],["1996.64","back then to how we get it to 2025 here"],["1999.519","to you today. That God has already"],["2001.76","planned this. And he's predestined you"],["2003.919","to be redeemed in this"],["2007.64","manner. He might gather together in one"],["2011.76","all in Christ both which are in heaven"],["2014.24","and which are on earth. In him, in him"],["2016.48","also we have obtained an inheritance."],["2019.36","We have an inheritance and it can't be"],["2021.279","taken from us just like that in the Old"],["2023.6","Testament predestined according to the"],["2025.519","purpose that he works all things"],["2026.96","according to the council of his will"],["2028.799","that we who first here it is trusted in"],["2032.519","Christ should be to the praise of his"],["2034.84","glory redemption through his blood that"],["2037.76","we will gain the inheritance why does he"],["2040.08","do this of his good pleasure to the"],["2042.48","praise of his glory and grace he's made"],["2044.88","us accepted in the"],["2046.84","beloved I told you uh when we first came"],["2049.839","down here from Canada and uh I was in"],["2052.56","seminary and we didn't have any place to"],["2053.839","live. So we we live with the in-laws. We"],["2056.159","were 14 months. Now what I didn't tell"],["2058.879","you is one month in they sold their"],["2062.2","house. So we got moved into the house"],["2064.639","and no sooner we got there my"],["2066","mother-in-law says, \"Uh this house's too"],["2067.919","small. We're going to sell it.\" And so"],["2069.76","we packed her right back up again and uh"],["2072.48","we had to move out. But um in between"],["2075.52","selling the old house and buying a new"],["2076.96","house, there was like a month that we"],["2078.879","had no place to"],["2080.28","live. So we lived in our minivan. No, we"],["2083.879","didn't. Leiana's aunt, Zoa, said,"],["2086.72","\"That's no problem. You can just stay"],["2088.639","with me.\" At the time, she had a"],["2090.599","townhouse. Uh two of her three adult"],["2093.119","children were living with her, plus one"],["2094.96","of her other nieces was living with her,"],["2096.8","plus grandma Abolita was living there."],["2100.48","So there was already five people living"],["2102.88","in this four bedroomedroom townhouse. So"],["2105.28","you know why not just move another whole"],["2107.68","family of five right on in here with us."],["2110.24","And she gave and I her master bedroom"],["2112.88","suite and the boys all sacked out in the"],["2115.599","basement in the family room sleeping on"],["2118","the floor. It was like a big sleepover"],["2119.839","for a whole"],["2120.839","month. And uh I was always amazed that"],["2124.56","Zoa would do that for us. But that's"],["2126.8","just how Aliana's family operates and"],["2128.72","just take care of each other. And that's"],["2131.2","what this story is teaching us. It's"],["2134.079","God's vision of family. God has shown us"],["2137.68","through the kinsman redeemer that family"],["2140.48","sacrifices for family. But he didn't"],["2142.96","just decree it in his laws for us to do"],["2145.28","it. No, it's his standard of"],["2147.52","righteousness that he likewise lives up"],["2150.16","to. And we learn that Jesus fulfills all"],["2153.119","the laws. He is the kinsman redeemer."],["2156.24","The family who he loves. He"],["2160.599","sacrifices. He loves you. He sacrifices"],["2164.24","to buy you out of debt. So as we go"],["2166.96","through this family, we discover the"],["2169.119","kinsman redeemer for"],["2171.32","Ruth and for all of us. And these are"],["2175.04","God's promised blessings for all of us."],["2178.24","This is what God has done for you. And"],["2181.599","all you got to do is trust him. John"],["2186.68","1:12. But as many as receive him, to"],["2190.16","them gave he the power to"],["2192.44","become the sons of God, even to those"],["2195.52","who believe on his name. May you believe"],["2198.4","on his name and receive this gift today."],["2201.92","Let's bow in prayer. Every head bowed"],["2203.68","and every eye closed. You've never"],["2205.92","believed in"],["2207","Jesus. You didn't know you had this"],["2209.2","great gift, these promises, predestined"],["2212.88","to be a child of God. It's right there."],["2215.04","All you got to do is believe and say,"],["2216.48","\"Dear Lord Jesus, please forgive me of"],["2218.96","my sins. Please pay my debt. Please make"],["2221.76","me part of that family. If you"],["2223.88","ask, he"],["2226.04","will answer you. He's promised. He's"],["2229.599","promised that he will receive you if you"],["2232.079","trust in him.\" Lord, we pray someone"],["2233.76","here today would put their faith in you,"],["2236","would trust in you, would believe on"],["2238.24","your name, be free of their sins, and"],["2240.64","have this hope of eternal blessings,"],["2243.04","this great inheritance. We're so excited"],["2244.96","for it. We thank you that some here"],["2246.48","today are going to take that step of"],["2247.839","faith"],["2250.2","to showcase their faith in the waters of"],["2253.119","baptism. We pray blessings on all today"],["2255.52","in Jesus name."]]},{"id":"oJi7lP76ZSM","name":"2025-06-01  The Meaning of Ruth Uncovering Boaz's Feet (Pastor Rob McNutt)","date":"2025-06-01","transcript":[["21.199","Let's uh take your copy of the word of"],["23.279","God and turn to the book of Ruth. We'll"],["25.68","continue our study. We're in chapter 3."],["27.76","Is it hard to believe how quick we're"],["29.76","ripping through this book? I don't know"],["32.079","what is happening. We are uh going to"],["34.88","read verses 1-9 and then make some"],["36.88","observations. So Ruth 3:1 Naomi her"],["40.559","mother-in-law said to her, \"My daughter,"],["43.44","shall I not seek security for you that"],["45.68","it may be well with you?\" Now Boaz, who"],["49.44","whose young women you were with? Is he"],["51.68","not our relative? In fact, he is"],["53.52","winnowing barley tonight at the"],["55.6","threshing floor. Therefore, wa wa wash"],["58.559","wash wash yourself, anoint yourself, put"],["61.44","on your best garment, and go down to the"],["63.76","threshing floor, but do not make"],["65.6","yourself known to the man until he's"],["67.6","finished eating and drinking. Then it"],["69.68","shall be when he lies down, you notice a"],["72.64","place where he lies. You shall go in,"],["75.28","uncover his feet, lie down, and he will"],["78.64","tell you what you should do.\" And she"],["81.36","said to her, \"All that you say to me, I"],["83.759","will do.\" So she went down to the"],["85.119","threshing floor, did according to all"],["86.96","that her mother-in-law instructed her,"],["88.799","and after Boaz had eaten and drunk, and"],["90.479","his heart was cheerful, he went to lie"],["93.04","down at the end of the heap of grain,"],["94.96","and she came softly and covered his feet"],["98.72","and lay down. Now it happened at"],["101.2","midnight that the man was startled, and"],["103.28","he turned himself, and there was a woman"],["104.64","laying on his feet. He said, \"Who are"],["106.04","you?\" And she answered, \"I'm Ruth, your"],["108.64","maidervant. Take your maidervant under"],["111.119","your wing, for you are a close"],["115.32","relative. Weird. What's going on here?"],["118.24","When Elelliana and I first got married,"],["120.159","I had this job in Canada. So, she"],["122.159","agreed. She she would move to Canada,"],["123.92","but she said, \"Family is really"],["125.84","important to me, so we have to get down"],["127.68","to see my family at least once a year.\""],["129.44","And I was like, \"Okay, we'll make that a"],["131.36","priority.\" Now, the challenge with that"],["132.64","was two things. I wasn't making a lot of"],["135.04","money and it was, you know, a 21-hour"],["138.959","drive to get down to Virginia. So, in"],["141.92","order to see family, we either had to"],["143.52","buy some plane tickets or we had to do a"],["146.16","three-day drive. We chose the drive"],["149.28","because it was cheaper than buying three"],["150.8","to four plane tickets. And here's why."],["153.519","We started out driving 5 hours from Nova"],["156","Scotia to the border of New Brunswick"],["158.4","and Maine, where my parents live. That"],["161.36","was a 5-hour trip. and we would just"],["163.2","break for the night there and my uh"],["165.68","parents would let us spend the night."],["167.599","They were so happy because we got to"],["169.04","visit grand grandkids at that time."],["171.2","They'd feed us supper. They'd let us"],["172.879","stay for free and uh then we'd get"],["175.68","breakfast in the morning and uh my dad"],["178.56","would take my car keys and run to the"],["181.12","gas station and take my car up and then"],["183.519","mom would give us a lunch for the road."],["186","So basically our first day of travel did"],["188.4","not cost us anything. Then we would uh"],["191.12","drive probably like Connecticut. Anybody"],["194.239","been to Mystic, Connecticut? That was a"],["195.92","place we'd like to stop in Connecticut."],["198","And then uh the next day we would finish"],["199.92","up the drive to Virginia. And once we"],["203.12","got to Virginia, we would stay, of"],["204.48","course, with Elelliana's family. And"],["206.48","just like my parents, her parents would"],["208.48","cover us. They would take us out to eat"],["211.2","and they would pay the bill. They would"],["212.799","get tickets to King's Dominion and"],["215.12","insist on covering everything. So, the"],["217.92","main cost of our vacations was basically"],["219.92","six days of driving down and back and"],["224.159","some shopping, but uh that was still a"],["227.28","substantial cost to us uh at that time"],["230.159","because we were living paycheck to"],["232.319","paycheck. If we managed to get a little"],["234.08","bit of money saved, generally a car"],["236.319","repair would come along and just wipe it"],["238.159","all out. So, this particular year, it"],["241.12","was uh earlier in our marriage, things"],["242.64","were tight, of course, because that's"],["244","the way we lived. and uh we still"],["246.239","decided we're going to take two weeks"],["247.439","and go to Virginia. Now, while we were"],["250.4","down here, Illiana's father's plumbing"],["253.68","company, he worked for Woodbridge"],["255.439","Plumbing over in Woodbridge and they"],["257.759","were having this special anniversary"],["260","dinner. The company had done very well"],["262.32","and the boss wanted to celebrate with"],["264.24","all of his employees. He had a big"],["266.16","dinner and then he gave surprising to"],["268.32","them everybody got a bonus and uh for"],["271.36","every year that somebody worked with the"],["273.12","company he gave them $100 per year they"],["275.68","worked. So Julio he worked 10 to 12"],["278.56","years for them and he got this"],["280.56","substantial bonus. Now this is back in"],["282.16","the 90s when $100 was still worth"],["284.32","something right that was big money back"],["286.32","in the 90s. So all the employees were"],["288.4","very shocked and they were very grateful"],["290","to get that bonus and we were very happy"],["292","for Julio. Well, when vacation was over"],["294.8","and we were packing to leave, Julio"],["296.8","comes up and he gives me"],["299.479","$800, a big chunk of his bonus, and he"],["302.96","was so happy that we brought the boys"],["304.639","and spent the the vacation with them."],["306.96","And that basically covered the cost of"],["309.199","that trip getting down there. So, I've"],["311.84","been blessed with parents and with"],["313.759","in-laws who when we were struggling were"],["316.88","all too happy to cover us. It's a"],["320.56","blessing and it molded and shaped my"],["323.12","understanding of what a parent is"],["324.8","supposed to do and what family does for"],["327.68","one another. When we come to chapter 3,"],["330.32","we see Naomi has that same attitude here"],["333.039","in verse one. She says, \"My daughter,"],["335.199","shall I not seek security for you that"],["338.16","it may be well with you?\" Now other"],["341.52","translations uh where it says security"],["343.759","here in the New King James, others will"],["345.44","say what what do you it says find rest."],["349.44","Some of you it says find rest for you."],["352.24","The Hebrew word here is"],["354.6","manoak. When we say rest we we think you"],["357.84","know sleeping or just kind of having"],["359.44","some"],["360.28","downtime."],["361.88","Security the English word better"],["364.16","communicates what that Hebrew word mono"],["366.4","is trying to communicate because it does"],["368.4","mean rest. Menak means taking a break"],["370.72","from work. Like after the seven days of"],["373.12","creation, God rested on the Sabbath. And"],["376.4","the Sabbath rest was a time when you"],["379.199","took a break from work, right? Allowed"],["381.199","yourself to rejuvenate. But there's more"],["383.36","depth to Monoak than is right in that"],["387.6","idea of just taking a break. Uh it"],["389.52","described when the nation of Israel"],["391.919","inhabited the promised land in"],["393.52","Deuteronomy chap 12. It says, \"For as"],["398","yet you have not come to the rest and"],["400.4","the inheritance which the Lord God has"],["402.96","given you. But when you cross over the"],["404.479","Jordan and dwell in the land which the"],["406.24","Lord God has given you to inherit and he"],["409.12","gives you what? Rest from your enemies"],["412.56","roundabout so that you will dwell"],["414.479","safely.\" So rest in the promised land is"],["417.12","associated with the Israelites having"],["418.96","relief from their enemies, dwelling"],["421.96","securely, rest from wanting."],["425.52","So from struggling to survive, the land"],["428","flowed with milk and honey and the land"],["430.96","was going to provide for them. Often"],["432.88","when we are struggling to make ends"],["434.72","meet, we think if I could just get a"],["436.88","better job or I could get this car paid"],["439.12","off, then I can get a break. We'll say"],["441.52","that, right? We say that word. If I"],["443.039","could just get a break, I could save up"],["445.599","and then we could have some financial"],["448.4","security. The land, the promised land"],["451.919","was financial security. taking a level"],["454.8","of stress off the people. So Naomi is"],["457.52","wanting to take this burden of struggle"],["460.16","to survive off of Ruth. And she has a"],["463.28","plan. She says, \"Should I not uh find"],["466.08","security for you that it'll be well with"],["469.28","you?\" And then her next question, Boaz,"],["472.4","whose young woman you were with, is he"],["474.96","not our relative?"],["478","So I noticed that in this book right"],["480.96","here in these two verses and I went back"],["482.639","and looked at the previous chapters much"],["484.8","of Naomi's dialogue is in the form of"],["487.4","questions. Jewish folks are known for"],["489.84","asking questions and answering questions"],["492.24","with questions. Have you noticed that"],["494","the Pharisees would come and ask Jesus a"],["496","question and they were generally"],["497.759","strategies to test his interpretation of"],["499.68","the law and hope to trap him. You know"],["501.28","is it lawful to pay taxes? Should is it"],["504.16","lawful for a man to divorce his wife?"],["506.4","teacher, what's the greatest commandment"],["507.759","in the law? One time they asked him, \"By"],["510.479","whose authority are you doing miracles,"],["512","Jesus?\" And he responded by answering"],["513.76","their question with a question. I'll ask"],["516.08","you a question. Whose"],["518.12","baptism was John from? Was it from"],["521.12","heaven or from men? So Jesus likewise"],["523.44","was good at answering questions with"],["525.04","questions. And we see this all"],["526.959","throughout scripture. The Psalms does"],["528.8","this a lot. David starts out, \"Why,"],["531.6","Lord, do you stand far off? Why do you"],["534.48","hide yourself in times of trouble? You"],["536.88","ever ask the Lord that"],["538.92","question? For who is God beside the"],["541.6","Lord? And who is a rock except our God?"],["544.24","Makes you think. And then you answer the"],["546.32","question in your mind. Well, who is? Who"],["549.12","may ascend to the mountain of the Lord?"],["550.56","And who may stand in the holy place? We"],["552.959","see this also through the prophets. They"],["554.64","did the same thing. Jeremiah, why do the"],["557.04","ways of the wicked prosper? Why do the"],["559.44","faithless live at ease? Doesn't seem"],["561.44","fair. God Habach, how long, oh Lord,"],["564.32","must I cry for help, but you don't"],["566.32","listen? Why do you tolerate"],["569","wrongdoing? And we even see God do this."],["571.839","Remember with Job, Job's asking all"],["574","these questions to God, and then Job"],["576.32","chapter 38, God says, the Lord says to"],["579.04","Job in the whirlwind and he says, \"Who's"],["581.12","this that darkens counsel by words"],["583.68","without knowledge? Now prepare yourself"],["586.399","like a man and I will question you and"],["588.56","you will answer me. Where were you when"],["590.959","I laid the foundations of the earth?"],["592.959","Tell me if you have understanding."],["596.68","Probing questions. Probing questions are"],["600.72","essential for deepening understanding,"],["603.6","encouraging critical thinking, and"],["605.68","fostering meaningful conversations. They"],["608","push individuals to think beyond surface"],["610.16","level answers and explore deeper"],["612.48","insights. They help us uncover details"],["614.959","that might otherwise be overlooked,"],["617.04","ensuring a more complete"],["620.36","understanding. John Harris does this to"],["622.399","me all the time. I'll come into an"],["623.92","elers's meeting and I'll be like, \"Oh, I"],["625.44","got this great idea.\" And John will go,"],["626.64","\"Hey, well, have you thought of this or"],["628.16","what about that?\" And I'm like, \"Ah,"],["629.519","John, you know, you're beating me up"],["630.959","with all these qu and that's good for"],["632.32","me. It tightens me up. It makes me think"],["634.48","clearly about what we need to do.\" Uh,"],["637.44","probing questions strengthen"],["639.12","communication. The peer listening"],["641.839","ministry, they know this one, right?"],["643.68","Probing questions promote active"],["645.68","listening and engagement, making"],["647.92","conversations more productive. Oh, well,"],["649.92","how did you feel about that? Or, you"],["651.76","know, how what's going on? So, you're"],["654.56","drawing people into a deeper"],["656","conversation and they enhance learning."],["659.04","Uh, often teachers do this, right? They"],["661.519","ask questions to the class. Sometimes I"],["663.44","do this, too. I'll ask a question and"],["665.279","leave a gap for you"],["667.24","to think about what's coming next. Just"],["669.92","like that. So, uh, so whether it's"],["672.64","education, business, or personal"],["674","interaction, probing questions, refine"],["676.079","ideas, expand knowledge. Naomi, she does"],["679.2","this to help people, the people she's"],["681.6","trying to communicate with. She does"],["683.519","this so they can think about the issues"],["685.279","that she's grappling with and then come"],["687.36","to her same"],["689.079","conclusions. My daughter, shall I not"],["691.36","seek security for you? Ruth's"],["694.279","like, yeah. And then her answer but in"],["699.12","the form of a"],["700.279","question. Boaz is he not a relative? So"],["705.04","no Naomi asked Ruth the question so she"],["707.519","can understand Naomi's train of thought"],["710.079","so that Ruth will come to the same"],["711.68","conclusions that she has. And what's the"],["713.6","conclusion that Naomi's come to"],["716.68","here? Go ask Boaz to marry you."],["721.48","Yeah. And here's how you're going to do"],["723.839","it. Let me show you how."],["726.16","So she says, \"This is crazy.\" Verse"],["729.68","number"],["731.639","three, wash yourself. Well, that's a"],["733.92","good first step, ladies."],["738.04","Just girl, wash your face. Put on your"],["741.04","best garment. Go down to the threshing"],["743.279","floor. But do not make yourself known"],["745.36","until he's finished eating and drinking."],["747.68","And then it shall be when he lies down"],["750.72","that you shall notice the place he lies"],["752.56","and go and uncover his feet and lie down"],["756.24","and he'll tell you what you should do."],["758.12","Now for your"],["760.12","information, this is not a prescription"],["762.399","of how to get a marriage proposal."],["766.24","Let's not get confused about what"],["768","narrative passages, historical books are"],["770.079","teaching us. This is not teaching you"],["771.839","how to find love. This is a story about"],["773.76","how Ruth got a husband, not you."],["777.6","Sneaking into somebody's house and"],["779.2","covering their feet. It's a good way to"],["780.56","get shot or arrested. Not a marriage"],["784.36","proposal. But there is some practical"],["786.72","takeaway here. And maybe it's this."],["788.32","Naomi"],["789.72","is Jewish and she knows the Jewish"],["793.36","customs. She's been married before. So"],["796.48","seems that she would be a good person to"],["798.56","listen to for advice on how to marry a"],["800.48","Jewish guy. Someone who knows the laws,"],["802.72","knows the customs, someone who's already"],["804.32","accomplished the feat. No pun intended."],["807.279","Well, actually, it wasn't intended. It's"],["809.279","a dad joke. Sorry. She's accomplished"],["811.839","the feat. Also, someone who loves you,"],["815.44","wants what's best for you. Chances are"],["817.12","that's a good person to ask advice of."],["819.44","You know, back when I was dating"],["820.399","Elelliana, I was working as youth pastor"],["822.399","in this um in this church in Canada, and"],["824.959","I had befriended some folks who were"],["826.8","already married. They were like 8 to 10"],["829.36","years older than me, the faucets and the"],["831.12","tailor. and uh they were already had"],["833.519","some families little ones and they were"],["834.959","serving in the church. So I watched what"],["837.04","they were doing in their life and I was"],["838.8","picking up pointers from them. So when I"],["841.6","decided well I think I want to get"],["843.04","married. I didn't call my single friends"],["845.92","from college. I didn't call Mark Lew."],["848.16","What did he know? He's down in college"],["850.399","flopping around. I don't know what he"],["851.6","was doing. I didn't call my high school"],["853.6","friends. I called my father. And I"],["855.92","called these older married guys. people"],["858.16","who already know how to do what you're"],["860.48","aiming at doing. That's probably the"],["862.48","person to get the counsel from. Like I"],["864.48","said two weeks ago, we should expand our"],["866.88","friend group to include people who can"],["868.959","mentor you and guide you. Hey, I want to"],["871.92","get married. I think I'd like to start a"],["873.6","family. What should I do? Don't go to"],["875.6","Tik Tok for advice on that. You want a"],["878.88","successful marriage, go to people who"],["882.24","are already been married for a while."],["883.76","Wayne and Sandy, how long you've been"],["885.04","married? 51 years. 51 years. Wayne"],["887.76","wasn't even sure. Look at Sandy. She was"],["889.68","right on that. You know, maybe talk to"],["892","Wayne and Sandy if you want to know how"],["894.079","to stay married. Good job. So proud of"],["896.8","you all. So Ruth is good at taking"],["899.959","advice."],["901.48","And she said to her mother-in-law, \"All"],["904.16","that you say for me to do, I will do.\""],["907.199","So let's read the action here. Verse"],["909.68","number six. Went down to the threshing"],["911.44","floor, did according to all their"],["913.12","mother-in-law instructed her. And Boaz"],["914.72","had eaten a drunk and his heart was"],["916.16","cheerful. He lied down at the end of a"],["918.959","heap of grain and she came softly"],["922.32","uncovered his"],["924.36","feets. So what does that mean? The book"],["928.32","of Ruth itself does not explain what the"],["930.639","act of uncovering Boaz feet symbol"],["933.199","symbolizes. So, as a good Bible student,"],["936.88","when you can't find the explanation in"],["938.56","the book that you're reading, then you"],["940.32","broaden and you look at where it's"],["942.959","spoken of in other passages. Where is"],["945.36","this type of action found in other"],["947.92","references? So, the phrase souls of the"],["950.56","feet appears in various contexts in the"],["952.8","Old Testament, always symbolizing"],["954.92","possession, dominion, divine presence."],["959.199","So Deuteronomy 11:4, God promised the"],["962.639","Israelites, \"Every place where the souls"],["964.72","of your feet tread will be yours.\" And"],["968.32","he said the same thing to Joshua, \"When"],["970.079","you enter the land, every place the"],["972","souls of your feet, all the land it"],["974.079","touches, that will be your"],["976.759","inheritance.\" Also Ezekiel chapter 43,"],["980.16","God declares, \"Son of man, this is the"],["983.12","place of my throne and the place where"],["985.279","the souls of my feet where I will dwell"],["988.639","among Israel forever.\" So in that"],["990.759","passage, it the phrase souls of the feet"],["993.12","is symbolizing God's abiding presence in"],["996.32","the"],["997.16","temple. Now we also see the act of"],["999.68","bowing and prostrating at someone's feet"],["1002.639","as a sign of what? Humility and"],["1005.759","reverence. Psalmist 110 verse number one"],["1009.12","it's written the Lord said to my Lord"],["1012.079","sit at my right hand and I will make"],["1014.56","your enemies a foottool for your feats."],["1018.399","So the verse is a messianic prophecy"],["1021.04","indicating victory over enemies. But"],["1024.799","there's also another level of symbolic"],["1026.64","meaning. Being barefoot in the Old"],["1028.959","Testament was also associated with"],["1031.4","humility, mourning, servitude or even"],["1034.799","reverence. You remember when Moses came"],["1037.039","upon the burning bush and what did God"],["1039.12","say to him out of the burning bush? Take"],["1041.439","off your shoes. That's that's holy"],["1044","ground. And the same thing was said to"],["1045.36","Joshua when the angel of the Lord showed"],["1046.88","up. Joshua came up and said, \"Who are"],["1048.559","you?\" He said, \"Take off your shoes."],["1050.24","This is holy ground.\" So, it's an act of"],["1052.88","respect and submission to God. In other"],["1054.96","books, we see that walking barefoot was"],["1057.84","uh was communicating grief and distress."],["1060","You know that they had the act of"],["1061.52","sackcloth and ashes also going naked or"],["1064.88","or a barefoot was showing grief and"],["1067.2","distress like when David had to flee"],["1070.24","Jerusalem because Abselum was taking"],["1072.32","over. He left uh barefooted walking out"],["1075.6","weeping. When the prophet Isaiah was"],["1078.4","instructed to go barefoot and naked for"],["1080.48","three years as a prophetic sign to the"],["1082.88","nations and then the prophet Micah said,"],["1085.12","\"I must go barefoot and naked.\""],["1087.12","emphasizing the sorrow for the impending"],["1089.919","judgment that was coming on the nation."],["1091.6","So throughout the Old Testament, bare"],["1093.44","feet was a powerful viseral"],["1095.36","representation of submission and"],["1097.88","suffering. Barefoot is communicating"],["1100.799","something's"],["1102.039","wrong. Something's wrong. By uncovering"],["1104.88","Boaz's feet, Ruth is drawing Boaz"],["1107.36","attention to the"],["1108.84","need. So practically speaking, when Boaz"],["1111.84","wakes up in the middle of the night,"],["1113.44","something feels off. His feet are cold,"],["1116.24","right? So, typically I don't struggle"],["1118.799","with cold feet, but"],["1120.76","often's cold feet wake me up. So, or"],["1124.4","keep me awake and I lay down and then"],["1126.48","she puts her feet right up on me and she"],["1128.64","drains the heat out of my body into her"],["1132.32","two little ice"],["1134.679","boxes that are on the end of her legs."],["1138.72","Boaz is awakened and he's startled to"],["1140.72","find someone at his feet. Now, I don't"],["1143.36","think we should really try to get hung"],["1144.64","up on the imagery being confused. What"],["1146.72","exactly does all that action communicate"],["1148.96","because the story has dialogue. Boaz"],["1152.48","gets the message cuz Ruth lays it out"],["1155.36","very plainly and women this is this is"],["1158.4","good to know this because guys can't"],["1160.72","read your mind. Just giving us straight"],["1162.48","facts really helps. So verse 8, it"],["1164.72","happened at midnight. The man was"],["1165.919","startled and he said saw a woman laying"],["1167.84","at his feet. Who are you? She said, I'm"],["1169.36","Ruth your maidervant. Take your maid"],["1172","servant under your wing for you are a"],["1175.12","close"],["1177","relative. You are the kinsman redeemer."],["1179.84","So there's no ambiguity here. Roose very"],["1182.88","straightforward. Why she crept up in the"],["1184.64","middle of the night? Why she uncovered"],["1186.32","his feet? I need covering. I need a go."],["1188.96","Oh, we studied, we discovered last week"],["1191.2","what the kinsman redeemer is. If you"],["1193.76","want to know the depth of that, go back."],["1195.679","I'll just summarize it now. The kinsman"],["1197.84","redeemer is a family member who can"],["1200.4","legally pay the family's debt, reclaim"],["1203.52","the property, the lost land, marry the"],["1206.16","widow Ruth, and raise up a child to"],["1208.88","carry on IMC's"],["1211.799","heritage. Now, there's this interesting"],["1214","Hebrew idiom here. Take me under your"],["1216.44","wing. The Hebrew word is kaf. Can be"],["1220.16","translated wing or it can also be"],["1222.44","translated corner of the skirt. Who has"],["1225.76","wing? Whose interpretation is wings?"],["1228","Which who has corner of the skirt? Some"],["1229.76","of you have corner of the skirt. Okay."],["1231.52","So, the imagery of being taken under"],["1233.679","God's wing that appears several times in"],["1235.84","scripture, doesn't it? Symbolizes"],["1237.679","protection and care like a mother hen"],["1241.44","gathering the chicks. This is what the"],["1243.6","imagery is communicating. And the psalm"],["1245.52","says, \"He will cover you under his"],["1247.6","feathers, under his wings, that you may"],["1249.919","have refuge. His faithfulness is a"],["1252.4","shield and a bull work.\" And then again,"],["1255.44","how precious is your loving kindness, oh"],["1257.12","Lord, and the children of men take"],["1259.44","refuge in the shadow of your wings. And"],["1262.08","Boaz even, remember, look at chapter 12,"],["1265.039","chapter 2, verse 12. Boaz even gave that"],["1267.44","blessing to Ruth. He said, \"May the"],["1269.2","Lord, the God of Israel, under whose"],["1271.36","wings you've come to take refuge reward"],["1274.12","you.\" So, this is already this imagery"],["1276.72","he's blessed her with. And now she's"],["1278.4","turning that back around. Now, some"],["1280.32","English translations say, \"Uh, spread"],["1282.559","your cloak over me.\" And this action"],["1284.64","likewise appears in the Old Testament as"],["1286.48","a symbolic gesture of protection,"],["1288.4","commitment, and even marriage. Ezekiel"],["1290.799","chapter 16 where God speaks"],["1293.12","metaphorically about the covenant that"],["1295.039","he has with Israel. He said, \"I spread"],["1297.36","my cloak over you, covering your"],["1299.44","nakedness. I pledged myself to you,"],["1302.159","entering into a covenant with you, and"],["1304.24","you became mine.\" So this illustrates"],["1307.039","God's care and commitment to his"],["1309.2","children, Israel. Either way you"],["1311.6","translate that word can wing or cloak,"],["1313.84","it still communicates the same"],["1315.799","action, covering. So by uncovering"],["1319.28","Boaz's feet communicates something's"],["1321.799","wrong. There's this shameful situation."],["1325.2","Ruth being at a position at his feet"],["1328.2","communicates a position of"],["1330.52","submission. So someone in the family has"],["1332.96","need. It's Ruth and Naomi. They're in a"],["1335.2","position of need of poverty. They're in"],["1337.2","a position of affliction. Boaz feet are"],["1339.919","exposed because he's now being asked to"],["1342.4","act as the kinsman redeemer and meet the"],["1346.039","need,"],["1347.64","shelter, cover"],["1350.52","them. Before we see Boaz response, let"],["1353.84","me ask you this"],["1355.08","question. Is anyone here in need?"],["1359.36","Does anyone feel"],["1360.76","like Ruth and Naomi, afflicted,"],["1363.679","struggling to survive, not at rest? If"],["1366.559","you are, I've got good news for you. The"],["1369.44","promises of God, my God shall supply all"],["1373.039","your needs. According to his riches in"],["1375.6","glory found in Christ Jesus. Jesus knew"],["1379.36","what we needed. God already showed in"],["1382.72","his law what was needed. The redemption"],["1386.48","of our sins, a sacrifice for sin. The"],["1389.44","spotless lamb was needed. And John the"],["1392.4","Baptist when Jesus came and started his"],["1394.24","ministry said behold the lamb of God who"],["1397.76","takes away the sins of the world. And"],["1399.919","Jesus gave his life and his death"],["1402.799","covered our debt. His payment of his"],["1405.76","blood covered our debt. This means that"],["1408.559","Jesus has got us covered. First John"],["1411.919","chapter 2. My little children, I'm"],["1414","writing these things for you that you"],["1415.679","may not sin. And if anyone sins, you got"],["1418.24","an advocate with the father, Jesus"],["1420.72","Christ the righteous. And if we confess"],["1422.88","our sins, he is faithful and just to"],["1426.08","forgive us our sins and to cleanse us"],["1428.64","from all unrighteousness. So by going to"],["1430.88","the feet of Jesus and asking for help,"],["1433.28","we're acting just like Ruth. Now, some"],["1436.559","people here don't think they're all that"],["1438.6","needy. And if Naomi said, you know, go"],["1442.48","lay at Boaz's feet and ask for help,"],["1444.72","you'd say, heck no. I ain't laying at no"],["1448.08","man's feet. He better come kiss my feet."],["1451.36","I ain't that"],["1454.279","desperate."],["1455.88","Remember remember Mary when she washed"],["1460.4","the feet of Jesus with her hair and she"],["1463.039","kissed his"],["1464.919","feet. Why did she do"],["1467.48","that? because she knew who he was. The"],["1471.72","Messiah, the son of God, royalty,"],["1475.72","divinity right there for her to touch."],["1479.679","And she worshiped and she sacrificed and"],["1481.6","she poured out that perfume worth a"],["1483.44","whole year's salary. This unique"],["1486.08","opportunity she had right before her to"],["1488","touch God. And so she embraced his"],["1491.72","feats. The kinsman redeemer for Ruth is"],["1494.88","Boaz. The kinsman redeemer for us is"],["1498","Jesus. Do you understand who he is? What"],["1502.08","he's done? What he is currently doing."],["1505.52","Remember what Jesus said to the church"],["1507.2","of Leodysia in the book of Revelation. I"],["1509.36","know that was a year ago, but you"],["1510.48","remember that, don't you? He said to"],["1512.48","that church, \"Because you say, I'm rich"],["1514.799","and I've become wealthy. I don't need"],["1517.12","anything. I don't need no man. I can"],["1518.72","kiss nobody's feet. Do you not know that"],["1521.039","you're wretched and miserable and poor"],["1522.48","and blind and naked? I counsel you to"],["1525.12","buy for me gold refined in the fire that"],["1527.279","you might be rich with white garments"],["1528.96","that you might be clothed. The shame of"],["1530.48","your nakedness may not be revealed."],["1532.4","Anoint your eyes with the eyes that you"],["1534.559","can"],["1535.4","see. People who think they are rich and"],["1537.84","wealthy and need nothing. They will"],["1539.679","disdain the notion of bowing down at the"],["1541.84","kinsbury dimmer's feet asking for the"],["1544.08","covering. Jesus offers us his covering"],["1547.76","for your sins, your debt. My father"],["1550.799","offered to tank up my car. I said,"],["1552.799","\"Thanks, Dad.\" My in-laws offered to"],["1556","take the kids to King's Dominion. I"],["1557.44","said, \"That's very kind. Thank"],["1559.48","you.\" Would it have been better for the"],["1561.679","sake of my pride to withhold that"],["1563.76","blessing from my children and spending"],["1565.84","time with their grandparents at that"],["1567.12","amusement park? Would it have been"],["1569.6","better for the sake of my pride to run"],["1571.679","out of gas on the 95, be stuck in Maine?"],["1575.279","You ever been to Maine? There's nothing"],["1577.039","there but moose and"],["1579.48","bugs. Sorry, Maine people."],["1582.48","When you need help and God offers you"],["1584.799","help, be gracious and thankful, not"],["1587.88","arrogant. After"],["1590.039","all, I had more than just me to think"],["1592.4","about, didn't I? That whole car full of"],["1596.08","wife and kids. Naomi, her mother-in-law,"],["1598.96","said, \"My daughter, shall I not seek"],["1600.48","security for you?\" That it'll be well"],["1602.88","with you. Some of you got to think about"],["1605.52","others that need that security. that"],["1608.159","it's not well just with you, but it's"],["1609.84","well for your wife, it's well for your"],["1611.36","kids. That was a good testimony, by the"],["1612.88","way. You could have that that covering,"],["1614.96","that blessing for your"],["1616.76","family. Do you want to be free from your"],["1619.279","debt load of sin? Do you want peace with"],["1621.44","God, protection, and blessing? Jesus"],["1623.6","says, \"I got you covered. I got you"],["1626","covered. Behold, I stand at the door and"],["1627.76","knock. If anyone will o hear my voice,"],["1630.159","open the door, I'll come in.\""],["1633.039","And just like Jesus will answer your"],["1635.6","request for help, Boaz likewise says to"],["1638.84","Ruth, \"Go away, crazy person. Stop"],["1641.6","touching my feet.\" No, that's not what"],["1643.44","he said. What'd he say? Verse number"],["1645.32","10. Blessing are blessed are you of the"],["1648.4","Lord, my daughter, for you have shown"],["1650.48","more kindness at the end than at the"],["1652.48","beginning. And that you did not go after"],["1654.559","young men, whether poor or rich. And"],["1656.64","now, my daughter, do not fear, for I"],["1658.799","will do for you all that you request."],["1661.76","And for all the people in my town, know"],["1663.679","that you are a virtuous"],["1666.919","woman. What does that mean? More"],["1669.44","kindness at the end than at the"],["1671.2","beginning. Thought about that for a"],["1673","minute. So, if you look at 12"],["1677.08","11, we remember when Ruth said, \"Why"],["1679.919","have I found favor in your eyes?\" As"],["1681.279","Boaz said, well, it's been reported to"],["1683.12","me all that you did for your"],["1684.559","mother-in-law since the death of your"],["1686.159","husband. You left your father and mother"],["1688.08","in the land of your birth to come to a"],["1690.08","people you did not know. The Lord repay"],["1692.72","your"],["1694.12","work. Boaz already praised Ruth for her"],["1696.96","loyalty to her mother-in-law. Now she"],["1699.36","shows even more kindness, he says. How"],["1701.6","so? How's this more"],["1703.96","kindness? Because Ruth is prepared to"],["1706.799","enter into this marital relationship"],["1708.559","with this older guy who's able to redeem"],["1711.2","the land, restore the family of IMC."],["1714.32","This is a gift to her mother-in-law"],["1717.24","Naomi. And he's honest with the fact"],["1719.36","that maybe due to his age, he's maybe"],["1722.6","not the ideal prince charming. You know,"],["1726.159","doesn't have the abs. He's got the dad"],["1728.88","bod,"],["1730.72","right?"],["1732.159","Maybe the hairline's receding on this"],["1734","guy."],["1736.72","He could have she could have went after"],["1738.08","a younger guy, more handsome guy. Sure,"],["1740.88","Boaz is rich. We know that. But younger"],["1742.799","guys with time can accumulate wealth. Or"],["1744.96","maybe some younger fellas already have"],["1746.559","some resources saved up. She could have"],["1748.159","went for those guys. Boaz is not the"],["1750.72","sexy pick. And I think many times people"],["1754.559","think that way about Jesus and"],["1757.44","Christianity because when you grow up in"],["1759.44","church your whole life, you know, went"],["1761.2","went to Sunday school. Yeah. I went to"],["1762.96","Wana, went to youth group. I've heard"],["1765.039","all of Pastor Rob's Canada stories. It's"],["1767.52","just, you know, kind of old hat now, you"],["1770.88","know, feels mid serving God."],["1774.12","Meanwhile, the world looks sexy and cool"],["1776.88","and I don't know, straight fire. Is that"],["1778.64","the term kids use nowadays? straight"],["1782.76","fire. You know, that's nothing new. That"],["1786.159","has always been the enemy's game plan."],["1789.039","The lust of the"],["1790.44","flesh, the lust of the eyes, the pride"],["1793.12","of life. That's what the world appeals"],["1795.6","to. The glam, the fame, the fortune. But"],["1798.08","in reality, it's just a bunch of"],["1799.679","Instagram filters. It's just a bunch of"],["1803.039","It's a catfish. That's what the world"],["1805.12","is. It's a catfish. What the world"],["1806.88","offers does not compare to what God"],["1808.72","offers. Now fortunately Ruth is a"],["1812.32","virtuous woman and the Hebrew word here"],["1814.96","is khalil. It means a lot of stuff. It"],["1817.84","means strength, might, ability, noble,"],["1820.559","brave, excellent. That's what khalil"],["1822.799","means. It's the word used in Proverbs 31"],["1827.039","where this when the where the uh Solomon"],["1829.919","says, \"Who can find a virtuous wife? Her"],["1834.159","worth is far more than rubies. The heart"],["1836.64","of her husband safely trust in her. She"],["1839.2","so that he will not lack of gain. He"],["1842.32","does not She does him good, not evil all"],["1845.44","the days of her life. She opens her"],["1848","mouth with wisdom. On her tongue is the"],["1850.72","law of kindness. She watches over the"],["1852.88","ways of the household. She does not eat"],["1854.48","the bread of idleness. Her children rise"],["1856.799","up and call her blessed. Her husband"],["1858.88","praises her. Many daughters have done"],["1860.96","well, but you excel over them all. Charm"],["1863.6","is deceitful and beauty is vain. But a"],["1866.24","woman who fears the Lord shall be"],["1869.6","praised. Boy, I think that'd be a great"],["1871.52","study, wouldn't it, for younger ladies"],["1872.96","in the church, how to be a calil woman,"],["1876.399","a virtuous woman. And that's who Ruth"],["1879.36","is. How did she become so"],["1881.64","virtuous when she took that first step"],["1883.919","of faith? Your people, my people, your"],["1888","God, my God. And then every step along"],["1891.279","the way looking for favor."],["1894.559","We learned that in ver chapter 2 working"],["1896.72","hard to serve others and even today"],["1899.44","listening to wisdom. All these acts"],["1902.48","showcase her virtue but above all else"],["1905.2","is what she's done here. The humility to"],["1908.88","come and ask for the covering and this"],["1912.32","is what we all need to do. The prophet"],["1915.679","Isaiah said, \"I delight greatly in the"],["1917.76","Lord my soul. Rejoice in my God for he"],["1920.24","has clothed me with the garments of"],["1922.559","salvation. He has a robed me in the"],["1925.12","robes of righteousness. All as a"],["1927.519","bridegroom adorned his head like a"],["1929.6","priest and as a bride adorns herself"],["1931.84","with jewels. God offers us all this"],["1936.12","covering garments of salvation, robes of"],["1939.919","righteousness. Jesus offers all this to"],["1942.399","us."],["1943.64","Why? Because he loves us."],["1946.96","Above all, love each other deeply."],["1949.12","Because love, what does it do?"],["1952.08","covers a multitude of sins. And the"],["1954.799","psalmist says, \"Blessed is the ones"],["1956.88","whose transgressions are forgiven, whose"],["1960.08","sins are what?"],["1963.24","Covered.\" I've been so blessed to have"],["1966.08","parents and in-laws who when we were"],["1968.159","struggling, they were all too happy to"],["1971.36","cover it, to cover us. You're here today"],["1975.2","with needs. Guess"],["1977.559","what? You have someone who wants to"],["1979.76","cover you."],["1981.279","In the laws of"],["1982.84","God, it was provided a kinsman redeemer"],["1986.24","for family to cover family in time of"],["1988.399","need. And God abides by his own word."],["1991.44","Jesus is our kinsman redeemer. And he"],["1994.24","offers to all of us today his"],["1997.96","covering. And all you got to"],["2000.279","do is ask for it. Let's bow. Every heart"],["2004.88","bowed, every eye closed. Someone here"],["2007.88","today, what is that need? What is that"],["2010.72","affliction? What are you struggling"],["2012.76","with? You don't have to. My God shall"],["2016.32","supply all your needs. The covering is"],["2018.88","there. If you'd like, Ruth will just get"],["2021.2","down in submission, in humility, and"],["2024.159","ask, \"Dear Lord Jesus, please forgive me"],["2027.039","of my sins. Please bring me in unto your"],["2031.2","protection. Bring me in under your"],["2033.76","covering. Put your blessings upon me.\""],["2037.279","He promises. he offers. It's our pride."],["2041.519","It's our stubbornness. It's our"],["2042.88","disobedience that keeps us out away from"],["2045.039","him. But if we draw near to God, he will"],["2049.04","draw near to us. Lord, I pray that"],["2051.119","someone today would with a humble heart"],["2053.839","pray for forgiveness. Play pray for"],["2058","repentance of sins and pray for the"],["2060.56","covered blessings that they can be"],["2062.639","restored and renewed. We pray all this"],["2064.56","in Jesus name. Amen."]]},{"id":"zSpuJR5641A","name":"2025-05-18  Do Yourself a Favor (Pastor Rob McNutt)","date":"2025-05-18","transcript":[["21.119","Well, last week we started in the book"],["22.88","of Ruth, chapter 1. We learned that IMC"],["26.72","and his wife moved from Israel to Moab"],["29.439","because of a famine. They had two sons."],["31.84","IMC died. The two sons got married to"],["34.239","Moabitete girls. Both sons died. Naomi"],["37.68","returns back to Israel. Ruth, one of her"],["40.879","daughter-in-laws, goes with her. Naomi"],["44.079","tells everyone God is afflicting her,"],["47.6","which was true. And if you want to know"],["49.96","why, you got to go watch last week's"],["52.399","sermon. So, we're in chapter 2 today."],["55.92","Some people here today are looking, oh,"],["58.879","I don't know, to graduate. Some"],["60.8","graduates here, some graduates, right?"],["63.039","And, uh, you know, find the what's the"],["65.119","next step? Is it career? Perhaps it's uh"],["68","another chapter of education. Uh looking"],["70.96","to be accepted into college or get some"],["72.799","scholarships. Some people are looking"],["74.72","for a new job or opportunity. Some"],["78.479","people are looking for friendship,"],["80.64","stronger relationships, even love. If"],["84.08","you're here today looking for any of"],["86.119","that, looking for a new opportunity or"],["89.439","successes or blessings, guess what? you"],["93.119","did yourself a big favor coming today"],["96.56","because if you listen carefully for the"],["98.4","next h 30 35 minutes I'm going to show"],["100.72","you what we ought to be looking for and"],["102.96","how to find it. So everybody do yourself"],["106.32","a big favor and open up to Ruth chap 2"],["110.079","and we're going to be in verses 1"],["111.88","through13. Ruth 2 1 through 13."],["117.36","There was a relative of Naomi's husband,"],["120.32","a man of great wealth of the family of"],["122.479","IMC. His name was Boaz. So Ruth the"],["127.36","Moabitis says to Naomi, \"Please let me"],["130.16","go to the field and glean heads of grain"],["133.36","after him whose sight I may find"],["138.44","favor.\" And she said, \"Go, my daughter.\""],["141.599","Then she left and went and gleaned in"],["143.92","the field of the reaper and the after"],["146.56","the reapers and she happened to come to"],["150.16","a part of the field that belonged to"],["151.36","Boaz who was of the family of the Imc."],["153.84","Now behold Boaz came from the Bethlehem"],["156.72","and said to the reapers, \"The Lord be"],["158.16","with you.\" And they said, \"The Lord"],["159.28","bless you.\" And Boaz said to his"],["161.68","servants, \"Who who was in charge of the"],["163.2","reapers, whose young woman's this?\" So"],["165.599","the reaper who was in charge of the"],["167.04","reapers answered, \"Well, it is the young"],["168.879","Moabitete woman who came back with Naomi"],["170.72","from the country of"],["172.599","Moab.\" And she said, \"Please let me"],["174.879","glean and gather after the reapers"],["177.2","amongst the sheavs.\" So she came and has"],["180.48","continued from morning until now, though"],["182.8","she rested a little while in the house."],["185.36","Then Boaz said to Ruth, \"You will"],["187.44","listen, my daughter, will you not? Do"],["190.08","not go to glean in another field, nor go"],["193.76","from here, but stay close to my young"],["196.64","women. Let your eyes be on the field"],["198.879","which they reap and go after them. Have"],["201.2","I not commanded the young men not to"],["203.12","touch you? And when you are thirsty, go"],["205.599","to the vessels and drink from what the"],["207.84","young men have drawn? So she went, she"],["211.04","fell on her face and bowed to the ground"],["212.799","and said to him, \"Why have I found favor"],["216.48","in your eyes that I should that you"],["218.64","should take notice of me since I am a"],["221.2","foreigner?\" And Boaz answered and said"],["224.159","to"],["225","her, \"It has been fully reported to me"],["228.48","all that you've done for your"],["230.08","mother-in-law since the death of your"],["231.68","husband, and how you left your father"],["234.159","and your mother and the land of your"],["235.92","birth, and have come to a people whom"],["237.439","you did not know before. The Lord repay"],["240.879","your work and a full reward be given by"],["244.319","given you by the Lord God of Israel"],["247.84","under whose wings you've come for"],["251.159","refuge. And she said, \"Let me find favor"],["253.599","in your sight, my lord, for you have"],["255.599","comforted me. You spoken kindly to your"],["258.72","maidservant, though I am not like one of"],["261.919","your maidervants.\""],["264.96","So we see here in verse two that Ruth"],["267.199","clearly states what she is setting out"],["269.52","to do. What is"],["272.04","it? She says, \"I want to go"],["277.72","find"],["279.32","favor.\" So find is the verb. It's the"],["283.44","action. The Hebrew is mad. It means to"],["286.479","secure, to acquire, to get something"],["289.919","which one was seeking. This word is"],["292.24","communicating some intentionality. An"],["294.479","item is lost or missing in the person's"],["297.52","life and they feel a need. When I wake"],["300.479","up in the morning, I will pick up my"],["303.199","phone off the nightstand. I I don't say,"],["305.84","\"Hey, I found my phone. I knew exactly"],["308.639","where it was. I I check my phone, you"],["310.8","know, see what the temperature is, what"],["312.4","time it is, all that.\" But say uh the"],["316.32","night before it had fallen down in"],["318.72","between the car seats of the car and I"],["320.96","hadn't realized that and maybe after"],["323.12","supper I noticed. Hey, let me check my"],["324.88","phone. Oh, wait. Where where where did I"],["326.8","put it? Did I leave it at work? Uh did"],["330.32","did I leave it on the counter when I"],["332.56","came in? Where did I last have it? Now I"],["337.12","want to find it because I'm feeling the"],["339.44","need to use it. Uh I'm feeling"],["341.919","inconvenience for not having it. Anna,"],["344.4","would you call my"],["346.039","phone? And then after spending 20"],["348.32","minutes of looking, I announce relief."],["350.96","Hey, good news. I found"],["355.4","it. Now I want to find it because I'm"],["359.28","feeling the need to use it. Depending on"],["362.44","how bad the need determines how"],["366.479","intentional someone is about finding"],["368.8","what they are missing. How much you feel"],["371.6","the need the missing of the missing item"],["374.479","will dictate how much effort you put in"],["376.88","to go find it. So this is something to"],["379.36","think about"],["380.6","parents and parents whose kids are"],["383.4","graduating. If you are wanting your"],["385.919","children to be independent, motivated,"],["388.24","competent individuals, at some point"],["390.56","you're going to have to let them"],["392.16","experience some needs. Because if you"],["395.6","give them everything, they will feel no"],["398","need to go find anything for themselves."],["401.12","You can say, \"Hey, you need to find a"],["402.8","job.\" But if you continue on meeting"],["404.479","their needs, then your words are not"],["406.4","true. They don't need to. There's no"],["409.96","need. You want them to. You feel the"],["413.44","need, but they're not going to go get"],["415.199","the job until they feel the need. So,"],["418.88","your job is to let"],["421.16","them feel it. Let them feel it. That"],["424.56","means stop paying for their stuff. Kick"],["427.599","them off your phone plan. Don't pay for"],["429.599","them eating out. Stop buying them"],["431.52","clothes. Whatever. Charge them some"],["433.84","rent. Take them off your insurance. I'm"],["435.44","not talking about junior high kids,"],["436.8","okay? Don't worry. Don't worry, Kaylin."],["438.96","You're not going to get booted out yet."],["440.639","two years you will be but not"],["443.16","yet but you know you get you know 18"],["445.84","plus you know some guys are 48 still"],["448.24","living at home in the basement you know"],["450.88","you you say you need to get your license"],["452.639","well not if you're driving them anywhere"],["454.72","if you're driving them everywhere they"],["456.24","don't have any need to get that so stop"],["458.4","taking them places I decided I wanted a"],["461.68","job when I was a kid why because I loved"],["464.16","working and I was just so industrious no"],["467.759","because I wanted stuff and my parents"],["469.68","didn't give me any money to buy the"],["471.12","things I wanted. Mom, can I have a"],["472.56","treat? No, you don't need a"],["475.479","treat. Kind of judging,"],["477.72","Mom. Well, I want a treat. Oh, you want"],["480.4","a treat? You got any money? No. Well,"],["482.72","there you go. You can't get one. Because"],["485.039","my parents didn't give me what I wanted."],["486.879","I figured out how to work so I could get"],["489.36","it for myself. And this also has"],["492.16","spiritual ramifications. Some people"],["495.28","find the Lord and some people do"],["498.199","not. You know who doesn't find the Lord"],["500.8","and why they don't find the"],["502.36","Lord? The people who aren't looking for"],["504.96","him don't find him. People will say,"],["508.16","\"I've never seen God. I've never heard"],["510.08","God speak to me.\" It's because they're"],["512.24","not looking and they're not listening."],["513.839","Matter of fact, maybe you're trying hard"],["516.64","to not hear from him. You remember those"],["519.68","two Chinese exchange students that live"],["521.839","with us last year? They went to Reichen."],["524","Remember them? Uh they had to come to"],["526.32","church with us every Sunday, but they"],["528.8","didn't want to. They didn't want to hear"],["531.76","anything about God. And they'd sit there"],["534.48","slouched and on their phones and trying"],["537.68","to sleep during the service. They just"],["540.88","didn't want to hear it. And then one"],["542.92","day, Alice had this Bible assignment"],["545.68","where she had to write a whole essay"],["547.279","about an apostle. And all of a sudden"],["550.24","she had a need and she wanted to talk to"],["552.88","us about the Bible. Grades were a big"],["555.519","deal for those kids and they needed the"],["557.519","grade. So now they wanted the help. You"],["561.6","know and I know that our kids need God."],["564.8","We know everyone needs God, but they"],["567.92","won't look for him until they feel the"],["571.12","need. So we have to be patient and wait"],["573.839","for people to feel it and then they'll"],["577.04","want to find God. Will that work? Will"],["579.839","they actually have that kind of need"],["581.839","that drives them there? Well, here's"],["584.48","what I know. One day you wake up and"],["586.959","life has just punched you right in the"],["588.68","throat. You can't breathe. The chaos is"],["591.519","smashing you. And that's when you will"],["593.68","start really looking for the help. When"],["595.839","you feel the consequences of sin and the"],["598.56","brokenness, when you feel the loss, you"],["600.959","will want to find the Lord. Saints,"],["604.16","that's why we got to keep praying and we"],["605.92","got to be faithful and patient to wait."],["609.04","Your loved ones will find their way back"],["611.76","once they"],["613.16","feel the"],["615.24","need. Ruth feels the need, so she goes"],["618.8","to the field. What's she looking for?"],["621.04","Naomi, please can I go to"],["624.44","find what is it? Favor. The the the"],["628.56","Hebrew word is it"],["630.92","means favor."],["634.72","means grace. This is Ruth's purpose"],["638.16","statement. What is on her vision board"],["641.04","or what the kids might say understanding"],["643.76","the assignment? The assignment is not"],["647.24","money. The assignment is not"],["650.2","food. What's Ruth's purpose"],["653.079","statement? Find favor. Two questions you"],["656.48","ought to ask and"],["658.68","answer. What's our business? And how's"],["662.68","business? So many people in life are"],["665.68","looking for something. They don't even"],["667.36","know what they're looking for. What's"],["669.279","our business? Ruth's very clear. She's"],["671.76","very intentional on what she's looking"],["673.68","for. It's favor. That's her business."],["676.24","Why? What's so important about"],["678.6","favor? When something's your favorite,"],["681.68","it's what you immediately look for. It's"],["684","what you always choose."],["686.48","My favorite Mexican restaurant is"],["690.519","salsas, right? When I go to salsas, I"],["693.36","get the same thing every time."],["696.279","Quesadilla, Texas. For the last 18"],["699.36","years, I don't even read the menu. Don't"],["701.04","even look at it. I don't care. No other"],["703.12","entree is ever going to get ordered. And"],["705.519","I don't want to go to any other Mexican"],["707.36","restaurant. You want to go to Plaza"],["709.56","Alzka? Nope. You want to go You want to"],["712.399","go to Plaza Tolteka? No. Eat a Plaza."],["715.279","don't want. I always choose"],["718.44","salsa. That's"],["720.76","favor. If you look at the people with"],["723.68","fame and fortune, you might think, \"Oh,"],["725.6","well, you know, they earned it because"],["727.2","they're just so"],["730.44","talented.\" There's millions of talented"],["733.8","people. There's millions of hardworking"],["736.72","people. Have you ever watched those"],["738.56","audition shows, you know, America's Got"],["740.959","Talent or The Voice or, you know,"],["743.36","American Idol? any of those shows."],["745.68","Here's a fun fact about Pastor Mark."],["749.2","Guess"],["750.839","what? He auditioned for American Idol."],["755.519","No way. Did he win? Yes. He's working at"],["760.079","Bay Bible Church. I mean, that's the"],["762","grand prize right"],["765.48","there. Hit the big time here, eh?"],["769.68","I've heard people on the radio and I"],["771.6","thought, eh, Ricky's better."],["774.8","The ones you think are talented, there's"],["777.279","always someone comparable. There's"],["779.12","always someone working just as hard. The"],["781.519","difference often is this person had an"],["784.639","opportunity, was given the shot because"],["786.399","someone said, \"Oo, that's my favorite of"],["789.76","all the people in American Idol.\" They"],["792.079","said, \"Mark's my favorite. Let's choose"],["795.88","him. I He's my"],["798.68","favorite.\" And that's what the game of"],["801.04","life is all about. finding favor. When I"],["804","applied here to Faith Bible Church, the"],["805.68","committee had 40 resumes, a stack, and"],["809.2","they said,"],["811.16","\"Well, Canadians are clearly better"],["813.68","people.\" So, you know, let's just get"],["815.519","rid of all these 39 Americans. Just get"],["817.92","them out of here. Think that's what"],["821","happened? Did you know that Faith Bible"],["823.279","Church had to pay thousands of dollars"],["826","extra to get my wife and family here"],["830","through the immigration process? That"],["832.399","wasn't better. That was a hassle. Why"],["834.72","did they decide to do that? Because Dick"],["836.959","Neville likes to spend money. Ha, you"],["839.279","know that's not"],["841.959","true. Somehow someway I had favor over"],["846.639","those other candidates. How How do you"],["850.24","get favor? That's the assignment. That's"],["854.399","our business. Finding favor. Let's see"],["856.72","if we can discover how Ruth finds favor."],["859.92","Okay. So, verses 1-3, we see here u Boaz"],["865.6","um who's of the family of IMC, he's very"],["868","wealthy. Ruth the Moabitete says to"],["870.079","Naomi, \"Let me go to the fields, glean"],["872.079","the heads of grain after him in whose"],["874.079","sight I might find favor.\" And so Naomi"],["876.639","said, \"Go, my daughter.\" And she left"],["878.16","and went and gleaned in the fields after"],["879.92","the reapers. And it happened to come to"],["882.8","the part of the field belonging to Boaz,"],["884.24","which was of the family of Immac. Okay."],["886","So, first thing in order to find favor"],["888.72","is you got to get up and go look for it."],["892.959","You got to get to work. Ruth starts with"],["895.76","something she can do, something she"],["898.24","knows how to"],["901.399","do. Just pick some stuff up, right? So,"],["904.88","here's a fun fact. You know, you teach"],["906.88","your little kids how to pick up their"],["908.56","toys and pick up their room. You're"],["910.32","actually giving them a life skill. You"],["911.76","can make money just knowing how to pick"],["914.639","stuff up. It's brilliant, right? Clean"],["917.199","your room, kid. You can make a living"],["920","cleaning other people's rooms, right?"],["921.36","Cleaning up after people. Hey, it's good"],["923.199","money in that. So, gleaning, she's she's"],["925.92","going out to glean. Gleaning is simply"],["928","going to a field that has been harvested"],["930","and picking up all the leftovers,"],["932.639","picking up what the harvesters missed."],["934.72","Anyone ever glean? Anyone ever did some"],["937.36","gleaning? Okay. when uh we would go to"],["941.92","the potato fields in New Brunswick and"],["943.6","Elelliana would glean. We learned to"],["945.76","glean. In the four years that we lived"],["947.519","in New Brunswick, uh there was some"],["949.759","things that I really did enjoy and one"],["951.759","of them was the abundance of fresh free"],["954.959","produce. We had a big backyard and we"],["958.16","had a space for a garden. and our"],["960.16","neighbor raised beef cattle and in the"],["962.399","spring he'd be out on his land with the"],["964.48","manure spreader flinging a whole"],["966.16","winter's worth of manure all over the"],["968.8","fields and I told him ohana would like a"],["971.12","garden he said and he came over this"],["973.6","manure spreader and just put it all over"],["976.24","the field in the backyard and uh you"],["979.92","know fertilized it up right some good e"],["983.519","so we planted a garden and uh had to"],["986.32","weed it but sure enough we had a bumper"],["989.279","crop crop in the fall and it didn't cost"],["991.839","us anything other than the simple pack"],["993.519","of seeds and we got all this produce."],["996","And the other thing I appreciated was"],["998.24","that the potato farmers were more than"],["1000.32","willing to let people in the community"],["1001.839","go into their fields and glean the"],["1003.839","fields, gathering up the potatoes that"],["1005.44","the harvester had missed. And you could"],["1007.12","pick buckets and buckets of potatoes if"],["1009.68","you wanted to go glean. All summer and"],["1013.12","fall there was always something to pick"],["1015.279","up. There was wild blueberries. There"],["1017.36","was wild raspberries early in the"],["1019.6","summer. You could go down and pick"],["1021.44","fiddleheads. Anybody know what a fiddle"],["1022.72","head is? Anybody from the north? Okay,"],["1025.199","Mark knows what a fiddle head is. It's a"],["1027.199","It's a green that grows uh right on the"],["1030.16","St. John River Valley just along the"],["1032.16","river. It's like a fern and then when it"],["1033.919","first pops up, it's all curled up like a"],["1037.039","fiddle head. That's what it looks like."],["1038.799","And you can pick them and just all just"],["1041.919","free. go down there, pick them all up,"],["1043.28","and they're like they're really good."],["1044.959","Um, in true English style, my mother, we"],["1049.2","would boil them and then add vinegar to"],["1051.36","them. Uh, I think, uh, probably if I was"],["1054.24","cooking them, she would, um, she'd pan"],["1056.16","fry them with some garlic and they'd be"],["1058","much better. I guarantee I would like"],["1059.76","them much better if they were a little"],["1060.96","crispier like that. So, I don't know"],["1063.84","where I am anymore. I'm now talking"],["1065.44","about"],["1067.64","food. And,"],["1069.72","uh, yeah. So, uh, there was there was"],["1073.6","there was the fiddle heads you could"],["1074.88","pick and then there was, uh, the garden"],["1077.36","would give us the fresh veggies all"],["1078.72","summer long. In the fall, there was the"],["1080","potatoes and then we would go to the"],["1081.6","apple orchard. So, you pick apple"],["1082.88","orchards and get all these apples and"],["1084.64","this abundance of food even for free if"],["1087.28","you were prepared to put a little bit of"],["1088.64","effort in and go gather it up. And there"],["1091.28","was all this opportunity for blessings"],["1094.16","that the land would produce. However, to"],["1096.32","get a really good harvest, you have to"],["1098.32","deal with"],["1099.24","some"],["1101","BS, some manure, and you got to be"],["1104.08","prepared to get your hands dirty. And"],["1105.76","everyone knows who comes to the DMV, the"],["1108.16","same thing's true down here. Whatever"],["1110","line of work you're in, whatever field"],["1111.44","you're in, you know that's true."],["1112.88","Inevitably, you're going to have to deal"],["1114.32","with some BS, some"],["1117.32","manure, but if you're willing to put the"],["1119.44","work in, there's a great amount of"],["1120.72","opportunities for blessings."],["1122.96","In case you didn't notice, I went from"],["1124.88","literal to metaphorical, right? Gleaning"],["1128","in Ruth is literal, but it also"],["1131.24","symbolizes work, industriousness, skills"],["1134.64","that you use to take to the marketplace"],["1137.28","of life. But let's just make sure that"],["1139.679","we climb the ladder of abstraction"],["1142.08","accurately and we don't affiliate"],["1144.16","gleaning with some action or activity"],["1145.919","that would not bring you"],["1147.799","favor. There's all kinds of ways to make"],["1150.08","money, but they ain't all good. Remember"],["1152.799","the assignment is not money, it's favor."],["1156.72","So something illegal, something immoral,"],["1159.76","something that brings shame. That's not"],["1161.6","what we want. We want respectable and"],["1164.799","lawful is what we're looking for. So at"],["1167.039","first glance, gleaning would appear to"],["1168.96","be not very respectable, right? It's"],["1171.44","it's like poor people do it. Is is it"],["1173.6","freeloading? Is it just begging? No."],["1176.32","Gleaning was something commanded under"],["1179.12","the law. We see it in Leviticus. When"],["1181.6","you, this is what Moses wrote to all the"],["1184.24","people when they get the land. When you"],["1185.919","reap your harvest of your land, you"],["1187.84","shall not wholly reap the corners of"],["1190.16","your fields, nor shall you gather the"],["1193","gleanings. You will not glean your"],["1195.36","vineyards. You shall not gather every"],["1197.76","grape. You'll leave them for the poor"],["1200.799","and the stranger. I'm the Lord your God."],["1202.88","And then again in 23, same thing. When"],["1205.36","you harvest your land, you don't wholly"],["1207.52","reap the corners. You don't gather"],["1209.76","gleaning from your harvest. You leave it"],["1212.44","for the poor and the stranger. I am the"],["1215.039","Lord your God. Isn't that interesting? I"],["1217.52","am the Lord your God. So you're not"],["1219.84","trusting"],["1221.48","in the harvest. You're trusting in the"],["1225.919","Lord your God. Something to remember."],["1228.32","Gleaning is a gift from God. Rich or"],["1230.48","poor, the lands provides for all. Boaz"],["1233.28","is rich because of the produce of the"],["1234.88","land. Ruth is poor, but the same produce"],["1237.6","of the land can meet her need as well."],["1240.08","And this is what God"],["1241.559","intended. Something we all respect is"],["1244.88","someone who earns an honest day's pay"],["1247.6","from a honest day's work. No matter what"],["1250.72","they're doing, whatever work it is, we"],["1254.08","respect that. And that's the first step"],["1256.4","to finding favor is hard work. Case in"],["1259.44","point, skip ahead. Ruth finds favor in"],["1261.52","Boaz's eyes. And we'll unpack all the"],["1263.2","details, but just skip down to verse"],["1264.88","number 10, cuz she asked, \"Why did I"],["1267.039","find favor in your eyes?\" And his answer"],["1270.919","was, \"It's been fully reported to me all"],["1273.6","that you've done.\" Verse 11, \"For your"],["1275.039","mother-in-law since the death of your"],["1276.32","husband, and how you left your father"],["1278.159","and your mother in the land of your"],["1279.44","birth and come to a people whom you did"],["1281.84","not know before.\" Verse 12, the Lord"],["1284.08","repay your"],["1286.039","what? Your work."],["1288.96","In order to find favor, you have to get"],["1290.96","up and go look and put in the work. I"],["1293.2","wonder what kind of crop Roose gleaning."],["1295.2","Is this"],["1296.039","potato? What is this? You remember from"],["1298.559","chapter 1 verse 22? What did it say? It"],["1302.96","was the beginning of the barley"],["1305.96","harvest. That's this time of year."],["1308.96","Barley harvest is April, May, one of the"],["1312","first crops of the year for the"],["1314.64","Israelites. And that's important. And"],["1316","here's why. If you've ever been around"],["1318.08","any farming, you understand that you"],["1319.919","make your money after you've harvested"],["1322","your crops and then you sold them. Not"],["1323.679","all of them. Some of them you keep for"],["1325.44","seed for the next year. Some of them you"],["1327.52","keep for your own personal use, but the"],["1329.76","rest you sold. And that pile of money"],["1332.48","would have to take you through to your"],["1334.159","next cash crop, till your next crop is"],["1337.12","ready. Barley harvest is in the spring,"],["1340.72","which means what? They just came through"],["1343.32","the winter and there's nothing being"],["1346.32","harvested. There's no cash crop. So"],["1348.24","probably your food supplies are running"],["1350.48","out. Your savings are running out."],["1353.36","Barley harvest is the first crop of the"],["1355.36","year. It is giving the economy a much"],["1358.32","needed boost. It's restocking the bank"],["1360.799","account. It's restocking the pantry. And"],["1362.96","a good harvest, people would now be"],["1365.36","willing to spend some money because now,"],["1367.2","hey, we got something to get out there"],["1368.96","and boost the economy. So the barley and"],["1371.28","the wheat harvest was even part of the"],["1374.08","religious life of the people. The spring"],["1376.24","feast of Israel, people would bring the"],["1378.88","first fruits of their harvest to the"],["1381.28","temple and give it to the Lord as an"],["1383.679","offering, acting in obedience and giving"],["1386.32","their tithe, thus fulfilling the laws of"],["1388.72","God, assuring that God would continue to"],["1390.96","bless them and prosper them through the"],["1392.88","rest of the year. And barley was used"],["1395.919","for bread, was also used for feeding"],["1399.039","their livestock. So they're getting fed,"],["1401.44","their livestock are getting fed, and"],["1403.36","that is also part of the wealth of the"],["1406.32","people is their livestock. And you know,"],["1408.799","they also use barley"],["1410.679","for beer, right? So a good harvest was a"],["1414.159","reason to celebrate and also provided"],["1415.84","you a means to celebrate. And Ruth is"],["1418.48","going to glean during a fruitful"],["1421.2","harvest. The point is is that God has"],["1423.36","provided the laws that gave Ruth the"],["1425.36","permission and the protection to glean"],["1427.6","and God has provided a bountiful harvest"],["1429.919","for Ruth to participate in. Ruth's just"],["1432.32","got to go join in and do the things that"],["1436.36","God blesses. Have you heard that"],["1439.88","before? She finds herself gleaning in"],["1443.2","Boaz's field. Now, we hear in verse one"],["1446.159","that Boaz is a man of great wealth."],["1450.72","Let's pivot over to Boaz for a minute."],["1453.039","Right away, the author communicates that"],["1455.679","Boaz has found favor because he has"],["1459.88","what? Great"],["1463.24","wealth. As we learned last week, God"],["1465.76","promised to bless those that keep his"],["1468.08","commandments, but he will also afflict"],["1470.799","those who disobey. And IMC and Naomi"],["1473.919","were on the receiving end of affliction."],["1476.559","Meanwhile, Boaz and the same lifespan"],["1479.44","has been on the receiving end of"],["1481.6","promised blessings. Verse number three,"],["1485.76","it says at the end there that the field"],["1489.52","belonged to Boaz who was of the family"],["1492","of Alimc. And uh that's Naomi's deceased"],["1496.48","husband. And that'll be important later"],["1497.919","on. So Ruth finds herself in Boaz's"],["1500.08","fields. Boaz comes out to inspect the"],["1502.159","work. Verse number four. Now behold,"],["1504.159","Boaz came from Bethlehem and said to the"],["1505.84","reapers, \"The Lord be with you.\" And the"],["1507.279","Lord then they said, \"The Lord bless"],["1509.559","you.\" And um he's looking and inspecting"],["1513.2","the servants. And then he sees this"],["1514.88","young gal. So anytime a farmer hired me"],["1517.52","uh to work a harvest, the owner who was"],["1519.6","the farmer would always be out there"],["1522.159","working right alongside with us. And one"],["1524","of my favorite harvest experiences was I"],["1526.88","worked for a Dutch family in Nova"],["1528.96","Scotia, Krad and Mini Mustard."],["1532.799","Conrad had two sons and they were part"],["1535.84","owners in the farm with their folks and"],["1537.44","worked along with him. And I was the age"],["1539.6","of Conrad's youngest son, Derek. And"],["1542.88","Conrad worked us hard during hay season."],["1546.08","12 14-hour days from the time the dew"],["1549.44","burned off well after sun went down and"],["1552.159","we were still unloading trailers into"],["1554.24","the"],["1555.08","barns. We worked hard, but he didn't sit"],["1557.679","in the house all while we young fellas"],["1559.76","were out there doing the work. He was"],["1561.52","probably in his 60s, but he was right"],["1563.44","out in the field working with us the"],["1565.84","entire time. And at the end of the day,"],["1568.24","Conrad would always say, \"Oh, boys, you"],["1570.32","worked really hard. Thank you, boys."],["1572.64","Thank you.\" But the really special part"],["1576.159","of the day was Conrad's wife, Minnie,"],["1578.72","and her daughter-in-laws would make"],["1580.88","supper for the whole crew. And at 5:30,"],["1584.48","we would break for supper. Minnie said,"],["1586","\"It's supper time. bring the boys"],["1588.88","in.\" And so then we'd all come in and"],["1590.559","we'd sit on the picnic tables outside"],["1592.24","cuz we stunk and she didn't want us in"],["1593.84","the house. But we'd sit out there on the"],["1595.2","picnic tables and uh Conrad would lead"],["1598","us in blessing the food and then we"],["1600.799","would have a big farm fresh homemade"],["1603.919","dinner, roast beef, potatoes, corn on"],["1607.52","the cob, homemade rules, preserves"],["1610.32","because northern people preserve"],["1612.32","everything and all these preservatives."],["1614.4","And then of course dessert because they"],["1617.039","bake lots of great"],["1619.48","food. In everything Conrad did, he set"],["1623.2","an example for us. The work, the hard"],["1626.2","work, the being gracious and generous."],["1629.84","He didn't have he didn't have to have"],["1631.36","his wife and his daughter-in-laws make a"],["1633.2","supper. They just did that to be"],["1635.36","generous with us. And above all, he"],["1638.72","showed us how to honor the Lord by"],["1641.2","giving"],["1642.279","thanks. While studying Boaz, I was"],["1644.88","remembering Conrad. And this is him and"],["1647.76","Minnie when they got married in"],["1650.279","1963. They got married. And this is him"],["1653.52","and Minnie at their granddaughter's"],["1655.52","wedding 60 years later with"],["1659.64","grandchildren and great grandchildren,"],["1662.48","still living on that"],["1664.279","farm. That man found favor."],["1668","You know what Conrad would say to me"],["1669.76","every Sunday after I preached at the"],["1672.32","people's church and he'd come out and"],["1674","he'd stand right at the door going out"],["1675.44","of the sanctuary. He'd come out and he'd"],["1677.44","bang on my shoulder with his big Dutch"],["1679.36","farm hand and he'd say, \"You did a great"],["1681.84","job, boy, but don't let it go to your"],["1684.12","head.\" Every Sunday the same thing. Oh,"],["1686.559","you did a great job, boy. Don't let it"],["1688.48","go to your head. And I needed that. I"],["1691.76","need both of those statements. I needed"],["1694","the encouragement and I needed the"],["1697.64","admonition. We need the Conrads, the"],["1700.159","Boazes, the father figures, the"],["1702.08","grandfathers setting the godly example,"],["1704.64","ready to keep you in line, keeping you"],["1706.88","humble, straightening you"],["1709","out. So if you want to find"],["1711.88","favor, find some good examples. Go be"],["1715.919","around people who have already found"],["1718","favor and pay attention to them. When"],["1721.44","they encourage you, great job. Ah, keep"],["1725.039","doing that. All right, Conrad said,"],["1726.88","\"That's a great job. I I work at that.\""],["1729.279","And if they admonish you, don't get"],["1731.48","offended. Take it. Learn from it. One of"],["1735.6","the mistakes young people often make is"],["1737.6","they want to be exclusively around"],["1739.279","people their own age. They do this"],["1741.52","because they feel safer. They they feel"],["1743.52","understood. They feel like I can connect"],["1745.279","better with these people because they"],["1746.88","get me. These people get me."],["1751.88","Hm. What if you're not really sure what"],["1755.2","you're doing and all the people you're"],["1757.039","hanging around with are just like you?"],["1759.919","They get you, but can they help you?"],["1764.159","Maybe they're more confused than you"],["1766","are. How's that helping"],["1769.24","you? I'm not saying stop being friends."],["1772.799","What I'm recommending is expand your"],["1776","circle. Find people who will challenge"],["1778.72","you, mentor you, help you. You don't"],["1782","need everyone to get you. You need"],["1784.799","people who can help grow you. You need"],["1788","that, too. And like I said"],["1791.159","earlier, fertilizer is a great way to"],["1794.24","make things grow. And sometimes you need"],["1796.88","a kick in the pants. Sometimes you need"],["1799.36","someone to crap on you so you can grow."],["1804.799","And I'll be in trouble for that, but"],["1806.159","that's"],["1807.96","okay. Verse five, Boaz said to his"],["1811.6","servant who was in charge of the"],["1812.88","reapers, whose young woman is this? So"],["1814.799","the servants in charge of the reaper"],["1816.32","said, \"Well, it's this young Moabitete"],["1818","woman.\" And she came back with Naomi"],["1820","from the country of Moab. And she showed"],["1822","up here and said, \"Can I glean and"],["1823.52","gather with the reapers amongst the"],["1824.799","sheav?\" So she came as continued from"],["1827.44","morning until now, though she rested a"],["1829.76","little while in the house. And Boaz said"],["1831.039","to Ruth, \"You will listen to me, my"],["1832.399","daughter, will you not? Do not go glean"],["1835.36","in another field, nor go from here, but"],["1837.44","stay close to my young women. Let your"],["1839.76","eyes be on the field which they reap,"],["1841.679","and go after them. Have I not commanded"],["1843.84","the young men to not touch you? And when"],["1846.32","you are thirsty, go to the vessel and"],["1847.919","drink from what the young men have"],["1850.52","drawn?\" Boaz is, I see here, keeping a"],["1853.919","firm hand on things. The young men, are"],["1857.44","they going to do what Boaz tells them?"],["1859.679","you leave that girl alone. What did they"],["1861.399","say?"],["1863","Yep. Yep. But he's also generous and"],["1866.84","kind with Ruth. And when Ruth realizes,"],["1870.799","this guy's favoring me, she she asks,"],["1875.12","\"Why?\" She falls in her face. Verse 10,"],["1876.799","bows to the ground and says, \"Why have I"],["1879.52","found there it is favor in your eyes?"],["1882.96","You should notice me since I'm a"],["1884.159","foreigner.\""],["1885.2","And we"],["1886.44","learn why Boaz favors her. Boaz, a man"],["1890.559","who found favor, receives great blessing"],["1893.279","from the Lord. He knows what God"],["1895.36","blesses. He does the things that God"],["1897.279","blesses. So the answer to our question,"],["1899.679","how to find favor is about to be"],["1902.48","answered. You ready? Verse 11. Boaz"],["1906","answered and said, \"It was fully"],["1908.159","reported to me all that you've done for"],["1910.08","your mother since mother-in-law since"],["1911.76","the death of your husband and how you"],["1913.6","left your father and your mother in the"],["1915.12","land of your birth and have come to a"],["1916.48","people who you did not know before. The"],["1918.48","Lord repay your work and a full reward"],["1921.279","be given to you by the Lord God of"],["1923.84","Israel under whose wings you've come for"],["1927.919","refuge.\""],["1930","So Boaz of the tribe of Benjamin when"],["1933.159","IMC's widow Naomi returns back home."],["1936.96","Remember last week all the women were"],["1938.64","excited to welcome her back. But then"],["1940.559","they learned the sad news that her"],["1942.08","husband had died and her sons had died"],["1944.159","and she had only this one"],["1946.399","daughter-in-law who was loyal and that's"],["1949.039","all she had in the world. And Boaz says"],["1951.6","in verse 11, it's been fully reported to"],["1954.519","me. He knows everything going on in his"],["1957.12","community. He knows everything going on"],["1958.64","with his family. It was bad news to hear"],["1960.72","what had happened to IMC and the boys."],["1962.48","It was sad to hear about Naomi's loss"],["1965.039","and pain. There wasn't anything Boaz"],["1966.799","could have done to prevent any of that."],["1969.12","But for this young girl who is showing"],["1971.279","herself to be hardworking and loyal to"],["1974.159","family. He respects her. He admires"],["1976.64","those qualities and he wants to help"],["1978.48","her. He wants to do her a"],["1983.08","favor. Now, we can't fix every problem"],["1985.6","in the world. We can't lift every"],["1987.6","burden. We can't overturn every"],["1989.76","injustice. Bad things happen. But what"],["1992.48","we can do when it is within our power,"],["1995.12","within our means, we can help someone."],["1998.24","And Boaz goes out of his way here to"],["2000.88","help this gal, knowing everything. Who"],["2003.44","is this gal? That's the Moabitete. Oh, I"],["2005.36","know what that girl's all about. And he"],["2007.039","says to the says to the pe the the the"],["2009.84","guys gleaning, you know, let her glean."],["2012.96","And then we're going to see later on he"],["2014.559","says leave some extra for her. Now he"],["2017.44","didn't say hand it to"],["2019.559","her. Said leave some extra. She'll pick"],["2022.08","it up. It'll be good for her. Let her"],["2024.08","let her get it. But it's there's extra"],["2026.159","going to be there. And then she he"],["2027.679","invites her. You know, if you need"],["2028.96","water, here's some water. And then he"],["2030.48","invites her come sit down and have some"],["2032","bread. And so he's he's pouring out this"],["2034.72","favor upon her and blessing"],["2037.799","her."],["2040.279","And that's what we want to continue to"],["2043.519","practice. Faith Bible Church, a"],["2046.08","willingness to help and bless people who"],["2049.119","are trying and making an effort. If"],["2051.919","you're new to Faith Bible Church,"],["2053.839","something you're going to see and um"],["2056.639","something we're going to challenge you"],["2058.24","to join in and do with us is lending a"],["2061.48","hand, helping and serving and"],["2063.96","supporting. So, at our last sunrise"],["2066.639","service, we uh sent the email out asking"],["2069.2","folks if they would help Joe come help"],["2071.119","Joe set up some chairs. And of course, I"],["2073.44","knew people would show up, but it was so"],["2074.96","exciting because there were some people"],["2076.72","who showed up that it would have been"],["2078.48","their first sunrise service. They're"],["2080.56","just kind of getting here and they'd"],["2082.48","never been there and they showed up"],["2083.52","early to help. And I was like, that's"],["2084.96","what's up. They're already figuring out"],["2088.079","who we are and what it's like to be part"],["2090.56","of Faith Bible Church is you show up to"],["2092.96","help. And this summer, Pastor Mark is"],["2095.359","going to be leading us in a new"],["2097.28","community service project. So, I want"],["2099.04","everyone to be on the lookout for this"],["2100.96","new idea. He's launching a way to show"],["2103.76","our community that Faith Bible Church"],["2106.16","cares. That's all I'm going to give you."],["2107.839","Just planting a"],["2109.4","seed. Somebody else fertilize it."],["2113.72","And so, listen carefully. Understand"],["2116.16","this. When you jump in to lend a hand to"],["2119.44","serve and to minister, yes, you do it"],["2121.359","for the benefit of the body, but you"],["2123.2","also do it for your own benefit because"],["2125.52","now you are actively building the kind"],["2127.359","of community that you'd like to be a"],["2128.88","part of. The kind of community that"],["2130.32","you'd like to raise your family in"],["2132.56","because you show up to help others in"],["2134.16","their time of need. Guess what? The"],["2135.44","community is going to show up and help"],["2137.68","you in your time of need. Boas says to"],["2139.839","Ruth, \"It's been fully reported to me"],["2141.52","all that you've done for your"],["2142.92","mother-in-law. That's why you found"],["2144.96","favor. May the Lord repay you for your"],["2148.24","work. And that is the big thing you got"],["2151.44","to understand. Sure, Boaz gave Ruth some"],["2154.56","extra barley, gave her some water, some"],["2156.8","protection. He did her a favor. But then"],["2160.8","he said, \"The Lord repay you for your"],["2164.16","work.\" And that right dear, that right"],["2165.92","there, dear friends, is a whole other"],["2167.76","level of blessing. It's nice to be get"],["2171.359","favors from people, to be connected to"],["2173.92","rich people, to people who have"],["2175.28","influence. But Ruth just heard someone"],["2178.4","say, \"May God's blessing, may you be"],["2183.68","God's"],["2185.48","favorite.\" Did you know that God has"],["2187.68","favorites?"],["2189.52","1 Corinthians chapter 16, the eyes of"],["2191.92","the Lord run to and fro over the whole"],["2195.04","earth to show himself strong on behalf"],["2197.68","of those whose heart is loyal to him."],["2200.96","He's literally looking for people to"],["2203.72","choose to"],["2206.359","favor. Boaz was one of them. You know"],["2208.64","who was another one? You ever heard of"],["2209.76","King Solomon? That was the wealthiest,"],["2212.24","smartest, most favored person who ever"],["2214.64","walked the face of the earth. And he"],["2216.56","tells us"],["2217.56","exactly what to do to find God's favor."],["2220.72","He wrote it down so we could know. My"],["2223.68","son, don't forget my law. Write the let"],["2226.64","your heart keep my commandments for"],["2228.48","length of days and long life. Peace is"],["2230.72","going to add to you. Let not mercy and"],["2232.64","truth forsake you. Bind them around"],["2234.8","their neck. Write them on the tablet of"],["2236.72","your heart. So you will find what? Favor"],["2241.28","and high esteem in the sight of God and"],["2243.76","of men. What did Solomon just say? How"],["2246.48","you will find favor esteemed in the"],["2248.96","sight of men, in the sight of God. These"],["2251.68","are the things that God blesses. The"],["2253.68","people he favors are the people who show"],["2255.839","up and do the work, who serve others,"],["2258.24","who care for others. This is what he"],["2260.32","commanded. Jesus said, \"All the commands"],["2262.48","of the Old Testament, all the laws can"],["2263.92","be wrapped up in these two things. Love"],["2265.839","God and love your neighbor. Love God,"],["2269.52","love people.\" Ruth loved her"],["2272","mother-in-law, served her mother-in-law."],["2274.32","Boaz affirmed that that is honorable and"],["2276.48","that's worthy of blessing and said, \"The"],["2278.48","Lord bless you.\" See what I mean when I"],["2281.92","said when you serve others, you're doing"],["2283.839","yourself a big favor. By loving others"],["2286.48","and by supporting the ministry, by"],["2288.079","obeying and doing the things that God"],["2289.92","blesses, he's going to see you and he's"],["2292.4","going to favor you."],["2295.119","If you're here today trying to figure"],["2297.359","out your life and what you want to do"],["2299.2","and what you want to be, you don't even"],["2300.64","understand the assignment. It's fine."],["2302.92","Favor with men and with God. And Ruth"],["2306.4","shows us"],["2307.96","how. So now you got the"],["2310.52","information. Why don't you do yourself a"],["2313.04","big favor and try it? Go looking for God"],["2318.88","and his favor. I love this verse 12."],["2323.119","Capture this."],["2325.119","The Lord repay your work and a full"],["2327.92","reward be given to you by the Lord God"],["2330.24","of Israel. Boa's only got so much, but"],["2332.079","the Lord God of Israel's got what's he"],["2334.92","got? Everything. And he says, \"Lay he"],["2338.48","give you a"],["2340.359","reward. The Lord God of Israel under"],["2342.88","whose wings you've taken refuge.\" So"],["2346","Ruth came to the land of the Lord God of"],["2348.4","Israel. She needs refuge and God is"],["2352","taking her under his wing. She found"],["2356.2","him. David said, \"I sought the Lord and"],["2359.359","he heard me and he delivered me from all"],["2361.839","my fears.\" Jesus says, \"Ask and it will"],["2366.64","be given you. Seek and you will. Knock"],["2369.52","and it will be open. Everyone who asks"],["2373.52","receives. Everyone who seeks will find."],["2375.52","And everyone who knocks the door will be"],["2377.2","open.\" What man among you, if his son"],["2378.88","asks for bread, he'd give him a stone?"],["2380.64","And what man, if he asks him for a fish,"],["2382.079","is going to give him a serpent? If you,"],["2383.839","being evil, know how to give good gifts"],["2385.68","to your children, how much more your"],["2388","father who's in heaven will give good to"],["2391.2","those who"],["2393.16","ask. You got to"],["2395.32","ask, got to go looking."],["2400.4","Depending on how bad the need determines"],["2404.24","how intentional someone will be, someone"],["2406.64","will be about finding whatever it is"],["2408.96","they're"],["2410.04","missing. You need"],["2412.359","God. Do yourself a favor and ask to find"],["2417.64","him. Every head bowed, every eye closed."],["2420.24","We're going to pray"],["2421.96","now. God has so much so much to give us"],["2426.16","in this life and in the next. It's all"],["2429.2","there for you. All you have to do is ask"],["2431.52","him. Dear Lord Jesus, help me find you."],["2436.72","Help me"],["2438.599","believe. Lord, bless"],["2441.24","me. Show me the"],["2444.52","way. And Lord, help us to be obedient to"],["2447.359","the things that are very clear and very"],["2449.2","simple. Lay it out. Love the Lord your"],["2451.44","God with all your heart, soul, mind, and"],["2453.2","strength. And love your neighbor as"],["2454.4","yourself. And may we practice these"],["2456.56","things. Lord, we just pray that you"],["2459.04","would bless everyone who calls upon your"],["2462.119","name. You will fulfill your word and"],["2464.48","your promise. You will they will receive"],["2468.079","abundantly from you the reward. And"],["2471.359","Lord, we know that sometime in this"],["2472.88","life, there's going to be sorrow and"],["2474.079","there's going to be tribulations and"],["2475.28","we're not going to get everything we"],["2476.48","want. But we also know that at the end"],["2478.96","of this as the psalmist says, \"Surely"],["2482.4","goodness and mercy will follow me all"],["2484","the days of my life and I will dwell in"],["2486.16","the house of the Lord forever.\" And one"],["2488.24","day that is where we get our great"],["2490.56","reward for all the work and all the toil"],["2493.04","and all the sickness and all the pain."],["2494.96","One day we go to heaven and we receive"],["2497.359","it all and we're part of the family of"],["2499.72","God."],["2501.48","We're redeemed and brought in as we're"],["2504.16","going to learn through Ruth what that"],["2505.52","means. So Lord, help us to aspire to"],["2507.839","these things and be part of your family."],["2510.8","Praying in Jesus name. Amen."]]}]