[{"id":"jaEfVlGwwAo","name":"2025-05-11  Why Does God Afflict Us? (Pastor Rob McNutt)","date":"2025-05-11","transcript":[["22","20 years"],["23.64","ago, I could not provide for my wife and"],["29.359","mother of my three children. I was"],["32.079","living with my in-laws."],["36.16","Summer of 2005, I had finished my first"],["39.44","year of seminary. I couldn't go back to"],["41.68","Canada since there was no job there for"],["43.52","me in the summer. I couldn't get a"],["44.96","full-time job in the States or afford"],["47.12","any housing here. My in-laws graciously"],["50.239","offered to house us while I was"],["52.239","studying. So, I had to be content being"],["55.6","a foreigner on a student visa, making do"],["58.8","with the odd jobs friends from church"],["61.44","offered me. So, I found some jobs that"],["64.32","paid cash, working for a moving company"],["67.76","and doing some"],["69.24","construction. 10 years earlier, when I"],["71.439","married, I had a job. I could provide"],["73.84","for my family, but I decided to give all"],["75.84","that up, leave Canada, and go back to"],["77.759","school. For all of my childhood, school"],["80.96","felt like an affliction. Can I get an"],["83.68","amen from anybody? School, right? Even"],["86.96","after I graduated college like Garrett"],["89.28","did, I was just like, \"Woo! Glad that's"],["93.119","over. I don't ever want to go back to"],["95.6","school.\" But 10 years later, I was back"],["97.28","in school feeling very poor and"],["100","afflicted working on moving trucks in"],["102.96","the summer here in the DMV and that 100"],["105.439","90 degree like wet blanket wrapped"],["108.64","around you humidity felt like an"],["110.96","affliction."],["112.64","There are times when we all feel like we"],["115.92","are suffering some level of affliction."],["117.6","Whether that's some educational pain or"],["119.68","some financial pain or maybe broken"],["122.56","relationships with family and with"],["124.68","friends, sickness. We've had requests"],["127.92","for people dealing with sickness."],["130","Sometimes even when we're trying to"],["132.319","serve the"],["134.12","Lord, we are in the middle of a crisis"],["136.64","in ministry. For me, it was ministry"],["138.959","related crisis in 2004 that pushed me to"],["142.64","resign from my church in Canada and come"],["145.28","back to seminary which resulted in the"],["147.76","financial affliction that I was feeling"],["150.239","in 2005. One affliction just led to"],["153.44","another affliction. I was trying to"],["155.04","serve God. Why was my life so hard?"],["158.08","Well, many people here today, you're"],["160.239","feeling afflicted and you're wondering"],["162.16","why God, why are you allowing this"],["166","affliction?"],["167.519","Today, as Pastor Mark said, we begin a"],["169.92","new series in the book of Ruth. I invite"],["172.48","you to take your copy of the word of God"],["174.16","and turn to Ruth chapter 1. Let's read"],["177.28","the whole chapter and then we will make"],["179.92","some observations, interpretations, and"],["182.2","applications for ourselves today. Ruth"],["185.28","chapter 1 verse one. Now it came to pass"],["187.28","in the days when the judges ruled, there"],["189.2","was a famine in the land. A certain man"],["191.84","of Bethlehem Judah went to dwell in the"],["194.239","country of Moab. He and his wife and his"],["196.48","two sons. The name of the man was IMC."],["199.2","The name of the wife, his wife, was"],["200.8","Naomi. And the name of the two sons,"],["202.959","Malon and Chilon, Ephraimites of"],["205.76","Bethlehem of Judah, and they went to the"],["208.239","country of Moab, and remained there."],["210.72","Then Almc Naomi's husband, died. She was"],["213.84","left with her two sons. Now they took"],["216.159","wives of the women of Moab and the name"],["218.48","of one was"],["220.04","Oprah and the other was Ruth and they"],["224.319","dwelt there 10 years and then both Malon"],["227.12","and Chilion also died. So the woman"],["229.68","survived her two sons and her husband."],["233.28","Then she arose with her daughter-in-laws"],["235.519","and that she might return from the"],["237.2","country of Moab. For she had heard in"],["239.92","the country of Moab that the Lord had"],["241.599","visited his people and given them bread."],["243.2","Therefore, she went out from the place"],["245.2","where she was, and her two"],["246.879","daughter-in-laws with her, and they went"],["248.56","on their way to return to the land of"],["250.439","Judah. Naomi said to her two"],["252.56","daughter-in-laws, \"Go return each to her"],["256.56","mother's house. The Lord deal kindly"],["259.199","with you as you have dealt with the dead"],["261.6","and with me. The Lord grant that you"],["263.759","will find rest each in the house of her"],["266.08","husband.\" So he she kissed them and they"],["269.759","lifted up their voices and wept. And"],["271.84","they said to her, \"Surely we'll return"],["273.84","with you to your people.\" But Naomi"],["276.16","said, \"Turn back, my daughters. Why will"],["279.44","you go with me? Are there still sons in"],["282","my womb that they may bring you"],["284.639","husbands?\" \"Turn back, my daughters. Go,"],["287.28","for I am too old to have a husband. If I"],["290.08","should say I have hope, if I should have"],["292.4","a husband tonight and should also bear"],["294.479","sons, would you wait for them till they"],["296.56","are grown? Would you restrain yourselves"],["298.88","from having husbands? No, my daughters,"],["301.6","for it grieves me very much for your"],["303.759","sakes that the hand of the Lord has gone"],["306.56","out against"],["307.96","me. Then they lifted up their voices and"],["310.4","they wept again. And Oprah"],["313.24","kissed her mother-in-law, but Ruth clung"],["316.56","to her. And she said, \"Look, your"],["319.919","sister-in-law is gone back to her people"],["322.08","and to her gods. Return after your"],["324.16","sister-in-law.\" But Ruth said, \"Entreat"],["326.56","me not to leave you or to turn back from"],["330.08","following after you. For wherever you"],["332.88","go, I will go, and wherever you lodge, I"],["336.08","will lodge. Your people shall be my"],["338.639","people and your God my God. When you"],["341.84","die, I die. And there I will be me be"],["345.199","there I will be buried.\" the Lord do so"],["348.639","to me and more also if anything but"],["352","death parts you and"],["354.28","me. When she saw that she had determined"],["356.96","to go with her, she stopped speaking to"],["358.88","her. Now the two of them went until they"],["361.68","came to Bethlehem and it happened when"],["364.4","they had come to Bethlehem and all the"],["367.36","city was excited because of them. And"],["369.12","the woman said, \"Is this not Naomi?\" But"],["371.52","she said to them, \"Don't call me Naomi."],["373.6","Call me Mara. For the Almighty has dealt"],["376.88","very bitterly with me. I went out full"],["380.08","and the Lord has brought me home again"],["381.68","empty. Why do you call me Naomi since"],["383.84","the Lord has testified against me and"],["385.919","the Almighty has afflicted me? So Naomi"],["390.24","returned and Ruth the Moabitis her"],["392.16","daughter-in-law with her who returned to"],["394.8","the country of Moab returned from the"],["397.6","country of Moab. Now, they came to"],["400.08","Bethlehem at the beginning of the barley"],["404.36","harvest. Chapter 1, it starts out with"],["407.84","Naomi feeling like the hand of the"],["410","Almighty has been against her, that she"],["412.08","has been afflicted by God. She says in"],["414.72","verse 21, \"Don't call me Naomi, call me"],["419.28","Mara,\" which means bitter, \"ince the"],["421.44","Lord has testified against me and the"],["423.199","Almighty has afflicted me.\""],["427.28","She feels this way"],["429.24","because she was being afflicted by God."],["434","And it will do us no good for me to deny"],["437.72","that. Many preachers do not want you to"],["441.12","have any negative emotions about the"],["444.24","topic of God or church. Many people"],["447.919","think that all your experiences here in"],["450.08","church, they they need to be warm and"],["452.639","and pleasant so that you'll feel safe"],["456.16","around"],["457.56","God. I have"],["460.12","not,"],["461.72","cannot, will not offer you a safe God. I"],["466.72","can show you a powerful God who has a"],["469.759","great plan to save you and bless you."],["472.479","But the way he leads all of us is not"],["475.599","around affliction, but through it. Ruth"],["479.919","is a beautiful story. It is a prequel to"],["483.36","God's great plan for the redemption and"],["485.84","the glorification of humanity. It does"],["488.56","have a happy ending, but it starts with"],["490.879","the cold, hard truth that Naomi needs to"],["494.479","be saved from something. We cannot"],["497.28","ignore the state of debt, poverty,"],["499.84","sickness, and desperation that all of"],["502.56","humanity needs to be redeemed from. The"],["506.72","pain, the affliction is making everyone"],["509.84","aware of the problem. When you break a"],["512.88","bone, you feel pain, right? The pain"],["516.479","tells you, \"Hey, something's wrong."],["518.159","Something's broke here.\" Without it,"],["519.68","you'd be unaware of your broken state."],["521.519","The pain is not the problem. The problem"],["523.599","is the is the broken bone. But the pain"],["526.72","makes you stop what you're doing and"],["528.72","attend to the problem. So Naomi is"],["530.959","feeling the pain affliction from God."],["533.68","Let's see if we can find what the root"],["535.36","of the problem is. Actually, it's not"],["537.519","very hard to figure out. It's right"],["538.959","there in the opening statement. Did you"],["540.399","catch it? Ruth chapter 1 verse number"],["543.12","one. It tells you right up front, in the"],["546.399","days when the judges ruled, there was a"],["549.839","famine in the"],["551.56","land. See? Makes sense, right? This is"],["556","not a random tale. This is not a"],["558.16","historic w with no historical or"],["560","theological"],["561.32","context. There is all that is being"],["563.68","communicated in that opening statement."],["565.519","You just got to know what was going on"],["567.12","before you get to Ruth. So, let me catch"],["569.6","us up. Let me give us the context."],["572.08","Little history lesson. I'll tell you"],["574.399","what this means. The days of the judges,"],["577.44","when was that? What was going on? So"],["579.519","around 2000 BC, God called Abraham and"],["584.08","he said, \"Leave your father's land."],["586.72","Follow me to a land that I will give"],["588.8","your descendants as an inheritance. And"],["590.64","I will make of you a great nation, and I"],["592.56","will bless you, and I will bless those"],["594.56","that bless you, and I will curse those"],["596.24","that curse you, and through your seed,"],["598.24","through your family line, all the"],["600.56","nations of the world will be blessed.\""],["602.399","Abraham by faith believed God, and he"],["605.6","obeyed. God made an unconditional"],["608","covenant with Abraham. God was going to"],["610.16","fulfill these promises. God was going to"],["612.24","keep his word. So Abraham had a son,"],["614.64","Isaac, and that covenant was passed on"],["616.72","to Isaac. And Isaac had a son, Jacob,"],["619.44","and that covenant was passed to Jacob."],["621.76","Jacob's name was changed to Israel. And"],["625.279","Israel had 12 sons. And the covenant was"],["629.44","passed to the 12 tribes of Israel. The"],["632.399","covenant of God went down to the"],["634","children of Israel there. That's the"],["635.36","whole book of Genesis. Just finish that."],["637.519","Just like that. At the conclusion of"],["640","Genesis, we see that Israel and his 12"],["642.72","sons, all their families moved to Egypt"],["646.48","where they were blessed for a time. They"],["648.64","grew into a nation, but then they were"],["651.88","enslaved and they were enslaved for 400"],["656.079","years. But the Lord sent Moses to lead"],["659.76","them out of slavery to the promised land"],["662.56","around 1500 BC. there. The book of"],["665.04","Exodus just took care of that. On the"],["667.44","way, Moses received the laws of God and"],["670.64","wrote them down."],["671.88","Leviticus, Numbers, and Deuteronomy. God"],["675.76","said he's going to give the people the"],["677.68","land he's promised them that he promised"],["680.16","to Abraham, and he will greatly bless"],["682.16","them and prosper them if they obey the"],["685.279","laws and don't worship any other gods."],["687.44","However, if they do not obey the laws of"],["689.839","God and they worship other gods, he"],["692.32","would curse them. And this is called a"],["695.519","conditional covenant. Slightly different"],["697.36","from the unconditional covenant that God"],["699.36","made with Abraham. Those promises do not"],["701.519","change. The conditional covenant is obey"],["703.76","the laws and be blessed. Disobey the"],["706","laws and be cursed. And this was to"],["709.2","teach the people about justice,"],["712.2","righteousness, sacrifice, and"],["715.04","redemption."],["716.72","The laws were so very hard for the"],["718.48","people to keep. People sinned and they"],["720.48","fell short of living right. However, God"],["723.04","had instituted the animal sacrificial"],["726.079","system to atone for their sins. So, as"],["729.12","long as the nation followed the laws and"],["731.6","practiced the sacrifices to atone for"],["733.76","sin, worshiped the God of Abraham only,"],["736.48","they were going to be blessed. After"],["739.44","Moses died, Joshua led the people in"],["742.24","conquest of the promised land. That's"],["744.48","now the book of Joshua. They divided the"],["746.8","land up. They won the land and they"],["748.32","divided it from between the 12 tribes"],["750.92","around 1400 BC through that time period."],["755.44","Near the end of his life, Joshua"],["757.2","implored the people, be faithful, serve"],["760","the Lord. And actually, Pastor Mark did"],["761.68","that song for us. As for me and my"],["764.32","house, we will serve. That was Joshua."],["767.2","Serve the Lord our God. The people"],["769.6","pledged that they would do it. and all"],["771.519","the elders of the tribe of Israel"],["773.2","fulfilled that pledge even after Joshua"],["775.68","died. The whole generation was faithful."],["778.16","But then we get to the book of Judges."],["781.12","Turn to Judges chapter"],["783.72","2. Oh, why did it take us a whole year"],["785.839","to do Revelation? Look, I've just done"],["787.92","six books of the Bible. It's like"],["790.44","that"],["791.959","ridiculous. Chapter 2, verse number"],["795.16","7. Judges 2:7. So the people served the"],["798.32","Lord all the days of Joshua, all the"],["800.48","days of the elders who outlived Joshua,"],["802.16","who had seen the great works of the"],["803.519","Lord, which he' done for Israel. Now"],["805.92","Joshua, the son of Nun, the servant of"],["808","the Lord, died, and he was 110 years"],["810.16","old, and they buried him at the border"],["811.6","of his"],["812.519","inheritance, went verse number 10, when"],["815.12","all the generation had been gathered to"],["817.279","their fathers, what does that mean? What"],["818.8","does that idiom mean? They were gathered"],["820.32","to their fathers. Means that that whole"],["822.32","generation passed away. They died."],["825.279","Another generation arose after them who"],["828.24","did not know the Lord nor the works that"],["830.48","he had done for"],["833.88","Israel. So all the people, the children"],["836.48","who remember Joshua faithful, the next"],["838.399","generation, verse number 11, the"],["839.839","children of Israel did evil in the sight"],["841.519","of the Lord and served the baales. They"],["844.88","forsook the Lord God of their fathers"],["847.04","who had brought them into the out of the"],["848.56","land of Egypt, followed other gods from"],["850.32","among the gods of the people who were"],["851.68","around them. And they bowed down to them"],["853.68","and they provoked the Lord to anger."],["856.32","They forsook the Lord. They served the"],["857.92","bales and the asteros. And the anger of"],["860.639","the Lord was hot against Israel. So he"],["862.56","delivered them into the hands of"],["864.32","plunderers who desoiled them and he sold"],["866.72","them into the hands of the enemies all"],["868.16","around. So they could no longer stand"],["870.48","before their enemies. Wherever they went"],["873.199","out, the hand of the Lord was against"],["874.56","them for calamity. As the Lord said, and"],["876.48","as the Lord had sworn to them, they were"],["878.32","greatly distressed. Nevertheless, the"],["880.48","Lord raised up judges who delivered them"],["882.32","out of the hands of those who plundered"],["883.76","them. Yet they would not listen to their"],["885.519","judges, but they played the harlots with"],["887.44","the other gods, bowed down to them,"],["889.44","turned quickly from the way which their"],["890.959","fathers walked in, and obeying the"],["892.16","commandments of the Lord. They did not"],["894.079","do"],["895.079","so. So that right there is a summary of"],["897.44","what happens for the next 300"],["901","years. From the time of Joshua for about"],["904.32","300 years, the people rebel, worship"],["907.12","false gods. God withholds protection and"],["909.12","blessing off the nation. Famine strikes."],["912.16","Foreign invad nations invade because of"],["914.959","the affliction. The people repent and"],["918.24","they call out to the Lord for help. And"],["920","then God raises up a judge to deliver"],["922.24","the nation. And then the people"],["924.56","experience peace and blessing. But then"],["926.399","that generation passes away and the next"],["928.399","generation does the same thing, disobys"],["930.32","and repeats the cycle. So the story of"],["933.279","Ruth is in the time of the"],["936.44","judges. And since there is famine in the"],["939.44","land, this tells us that during the time"],["941.68","of Naomi and her husband IMC, the nation"],["944.399","is in a period of rebellion. How do I"],["948.32","know that? Deuteronomy 28, turn to"],["951.199","Deuteronomy 28, listed very clearly in"],["954.48","the laws of Moses. Deuteronomy 28:1. Now"],["958.24","it shall come to pass, if you diligently"],["960.8","obey the voice of the Lord your God, to"],["963.199","observe carefully all his commands,"],["964.88","which I command you today, that the Lord"],["966.88","your God will set you high above the"],["968.72","nations of the earth. And all these"],["970.24","blessings shall come to you, overtake"],["972.079","you, because you obey the voice of the"],["974","Lord your God. Blessed shall you be in"],["976.56","the city. Blessed shall you be in the"],["978.72","country. Blessed shall be the f fruit of"],["981.12","your body. What does that mean? The"],["982.399","fruit of your body."],["984.48","Your wombs will be open. You will have"],["985.839","children, right? Happy Mother's Day."],["988.24","They get the kids. Blessed shall you be"],["990.8","the produce of the ground in the"],["992.639","increase of your herds, the increase of"],["994","your cattle, the offspring of your"],["995.44","flocks. Verse 5. Bless shall be the"],["997.44","basket and your kneading bowl. Blessed"],["1000","you will be when you come in and blessed"],["1001.44","you will be when you go out. The Lord"],["1002.959","will cause your enemies to rise against"],["1004.48","you and to be defeated before your face."],["1006.399","They shall come out against you one way"],["1008.24","and flee before you seven ways. The Lord"],["1012.24","will command the blessing on you in your"],["1013.959","storehouses and all which you set your"],["1016.48","hands, he will bless you in the land"],["1018.959","which the Lord your God is giving"],["1021.16","you. Go down to verse"],["1023.4","15. But it shall come to pass if you do"],["1026.48","not obey the voice of the Lord your God"],["1028.72","to observe carefully all his commands"],["1030.799","and his statutes which I command to you"],["1032.559","today that all these curses will come"],["1034.959","upon you and overtake you. Here we go."],["1038","Cursed you'll be in the city and cursed"],["1039.439","you'll be in the country. Curse shall be"],["1040.799","your basket in your kneading bowl."],["1042.319","Cursed shall be the fruit of your body"],["1044.079","and the produce of the land and the"],["1045.76","increase of your cattle and offspring"],["1047.28","and your flocks. Curse shall you be when"],["1049.52","you go in and curse will be when you go"],["1051.6","out. The Lord will send his cursings,"],["1054.72","confusion and rebuke in all that you set"],["1057.52","your hand to do until you are destroyed"],["1060.24","until you perish quickly because the"],["1062.08","wickedness of your doings in which you"],["1063.76","have forsaken me. The Lord will make"],["1066.16","these plagues cling to you until he's"],["1069.52","consumed you from the land which you're"],["1071.6","going to"],["1072.36","possess. So we look at Ruth and there's"],["1075.28","a famine in the land. That's a curse on"],["1078","the produce. The famine is an affliction"],["1081.76","sent by God because his people were"],["1084.48","being unfaithful to his laws. Was Alimc"],["1088.48","himself worshiping false gods? I don't"],["1091.039","know. It doesn't say that in Ruth. Maybe"],["1093.2","he was. Maybe he wasn't. Sometimes we're"],["1096.799","experiencing afflictions through no"],["1098.88","fault of our own simply because we are"],["1101.36","living in a fallen and cursed world."],["1104.16","We're suffering hardships because of the"],["1107.2","leadership of our nation and what"],["1109.679","they're doing is having some impact on"],["1111.84","our lives. For example, we're wondering"],["1115.36","why can't I afford a home in"],["1117.559","2025? Well, maybe because back in 2008"],["1120.72","when the housing market crashed in order"],["1122.48","to save the banks, the federal"],["1123.919","government gave all this taxpayer money"],["1125.52","to BlackRock and they bought up all the"],["1128","foreclosures to bail out the banks."],["1129.76","Black Rockck gobbled up all this cheap"],["1131.679","houses, turned them into rentals. Now,"],["1133.919","in 2025, there's a shortage of houses."],["1136.559","Supply and demand has driven up the"],["1138.32","prices. Black Rockck's now sitting on a"],["1140","gold mine of real estate. They're a"],["1141.44","multi-billion dollar company while the"],["1143.039","taxpayers are $37 trillion in debt and"],["1145.44","you can't afford a house. Thanks a lot,"],["1147.84","federal"],["1148.679","government."],["1150.2","Famine, you're afflicted through no"],["1153.36","fault of your own. The famine is hurting"],["1155.76","the whole nation. Those who worship the"],["1157.76","false gods and those who did not worship"],["1159.919","the false god. Well, that's not fair."],["1162.4","Shouldn't the famine only hit the"],["1163.919","sinners?"],["1167.6","Well, it is. And that's a theological"],["1170.4","theme running all throughout the entire"],["1172.48","scripture. There is none righteous. know"],["1176.4","not one. Isaiah 64. But we are all as an"],["1181.44","unclean thing, and all of our"],["1183.2","righteousness is filthy rags. We all do"],["1186.559","fade as a leaf, and our iniquities like"],["1188.4","the wind has taken us away. So even"],["1191.44","though we would claim to be innocent,"],["1193.76","that we've done nothing to deserve"],["1195.88","affliction, that's intellectually"],["1198.2","dishonest. All have sinned and fallen"],["1201.76","short of the glory of God. We all"],["1204.24","deserve wrath."],["1206.08","If you sit here today and you say, \"What"],["1209.44","sin have I committed? I I I deserve no"],["1212.84","affliction. This is"],["1215.799","unfair.\" Maybe your sin is"],["1219.24","pride, your ignorance to your plight,"],["1222.88","and too arrogant to own"],["1226.2","it. Here's another biblical answer for"],["1229.52","your affliction. Your faith is being"],["1232.159","tested like Job to see if you can praise"],["1235.679","God in all"],["1237.64","circumstances. As James tells us, \"Count"],["1241.6","it all joy, my brothers, when you fall"],["1243.44","into various trials.\" Paul says, \"Not"],["1245.84","only that, but we rejoice in our"],["1248.24","sufferings, knowing that their suffering"],["1250.08","is going to produce"],["1252.44","endurance.\" Because here's the honest"],["1254.24","truth, folks. Chaos and affliction is"],["1257.52","coming for all of us. You cannot avoid"],["1260.799","it in this lifetime. Joshua, he was a"],["1264.24","godly, faithful leader who led Israel to"],["1267.76","conquer the land. What happened to him"],["1269.52","at the end of the book?"],["1271.96","Joshua, he dies. He dies. All the"],["1275.6","wonderful godly servants, all the"],["1277.28","prophets, they all they all die because"],["1280.4","we're all afflicted with this curse of"],["1282.799","death. Scripture says death passed to"],["1285.44","all men because all have sinned. But one"],["1289.52","day the curse will be lifted. Sin and"],["1293.039","death will be defeated. This is the"],["1296.24","message of the gospel. And Ruth is going"],["1299.2","to teach us how we're going to get"],["1302.84","there. But we have to understand that"],["1305.76","affliction is part of being in this"],["1307.84","world whether we feel it is or is not"],["1310.64","justified."],["1312.64","But to show you that everyone is a"],["1314.159","sinner and to prove the point that"],["1315.84","Israel in this time is being"],["1317.36","disobedient, even"],["1318.84","IMC, we see IMC disobey the laws of God"],["1323.36","by what do you do? He leaves the land of"],["1326.96","promise and he moves to Moab. That was a"],["1330.08","disobedience to God. And then the second"],["1331.679","thing he does is disobedience is what?"],["1334.799","They lets the boys marry the Moabitete"],["1338.4","women. Now, sure, Alimc, he can justify"],["1341.12","his disobedience. We got We got no food"],["1343.28","here. We got to move. Bethlehem means"],["1345.919","house of bread. There's no bread here."],["1350.4","The bread, the blessing is in Moab. I"],["1353.12","got to feed my"],["1354.6","family. Often we fall prey to"],["1357.12","situational ethics because someone else"],["1360","is dishonest or the system's corrupt or"],["1362.88","that person's talking bad about me. This"],["1365.2","gives me the right to"],["1368.6","retaliate and do bad behavior. God says,"],["1372.159","\"Don't let your sons marry the foreign"],["1373.76","women.\" Well, we're here in Moab. I I"],["1377.12","don't see any other women. How are we"],["1379.76","going to have a lineage if they don't"],["1381.52","marry some foreign women? Doesn't matter"],["1384.32","what God said. It's what makes sense to"],["1386.6","us. What's rational at the moment? So,"],["1390.72","this is how our faith is tested. Will we"],["1394.08","do things God's way when it's hard, when"],["1398.159","it's hurting us,? When we're not getting"],["1400.72","what we want? Will we be patiently"],["1404.32","obedient and endure affliction? Or will"],["1407.2","we rush out to find a solution in our"],["1409.36","own"],["1411.32","strength? So, when we make decisions out"],["1414.24","of anger or fear, generally they are"],["1416.799","unwise decisions. Have you noticed that?"],["1419.6","One of the reoccurring messages of"],["1421.76","scripture is wait on the"],["1424.84","Lord. Everybody remember this one. They"],["1428.08","that wait upon the Lord shall renew"],["1432.72","their strength. They will mount up with"],["1436.32","wings. You can do a solo. Come on."],["1438.159","Somebody knows the song. As he goes,"],["1441.12","I'll do it. They will run and not grow"],["1444.08","weary. They will walk and not faint."],["1447.76","Teach me Lord. Teach me Lord to wait."],["1451.76","Thank you Wayne and Sandy for helping me"],["1453.36","out. Appreciate"],["1455","that. Wait on the"],["1457.24","Lord. Galatians Paul says, \"Let us not"],["1460.08","grow weary while doing good, for in due"],["1462.159","season we'll reap if we do not lose"],["1464.48","heart. Cast all your cares upon him and"],["1468.4","then wait for his deliverance.\" in in"],["1472.4","2004 2005 we're living with the"],["1475.799","in-laws but in"],["1477.88","2005 God had a place for us and that"],["1481.44","door opened up and we got to move there"],["1483.2","and we just had to wait and then in 2007"],["1486.4","God had another place for us and we got"],["1487.919","to move down here to St. Mary's County"],["1489.84","and uh here we are and uh it took three"],["1493.279","years but God had a plan. Sometimes the"],["1495.36","best move is"],["1496.76","just don't move. Wait for the answer."],["1501.52","But like Alimc people are quick to jump"],["1503.76","up and do something disobedient thinking"],["1506.24","it's going to solve the problem. Leaving"],["1508.08","the promised land was Alimc trying to"],["1510.24","get away from the affliction but all it"],["1512.08","does is make matters worse. Trying to"],["1514.24","get the quick fix to stop the pain."],["1516.159","getting out from under the affliction,"],["1517.52","the chastening of the Lord. That didn't"],["1519.039","make IMC's family's life better. It just"],["1521.279","resulted in"],["1522.44","everyone"],["1524.36","dying. Look at"],["1526.279","this verse number"],["1528.84","three. It"],["1531.64","says, I got to find it. There's an"],["1534.64","affliction. I can't read scripture."],["1536.72","Elimc Naomi's husband died and she was"],["1539.2","left with her two sons. And they took"],["1540.64","wives of the Moabites, one Oprah and the"],["1542.559","other Ruth, and they dwelt 10 years. And"],["1545.6","then both those sons"],["1549.32","died. Now IMC's sons disobeyed God's"],["1552.159","laws by marrying the Moabitete girls."],["1554.32","That did not grow the family. It just"],["1556","resulted in their deaths. And you notice"],["1558.96","that they were married for 10 years and"],["1561.36","they died and they had no grandchildren."],["1563.84","What was the promises that were made in"],["1565.96","Deuteronomy? Blessed will be your your"],["1569.039","your the fruit of your womb. These girls"],["1572.559","did not have any children in the whole"],["1574.799","time they were in Moab. There was no"],["1576.72","blessings and they all"],["1580.679","died. Folks were like, \"Wow, it' be so"],["1583.039","nice to get out of Revelation and study"],["1584.88","something kinder and"],["1587","happier.\" Like what, Ruth? Oh, Ruth"],["1589.679","sounds nice. How you liking it so far?"],["1593.039","The husband and the two sons are dead."],["1595.12","Happy Mother's Day."],["1598.08","Naomi is afflicted by God. And she felt"],["1601.52","that way"],["1602.6","because she was afflicted by God. And it"],["1605.6","does us no good to deny that. If we"],["1608.08","don't learn why God afflicts us, we will"],["1610.559","always just be shocked and confused"],["1613.52","about why we're being"],["1615.08","afflicted. We will never learn the"],["1617.44","lessons. And thus, we'll be destined to"],["1619.679","repeat the same mistakes over and over"],["1622.72","and over. But if we can learn why God"],["1625.2","afflicts us and how we ought to respond"],["1627.84","to his chastening, then we can learn and"],["1630.559","we can grow and we can discover the good"],["1632.96","on the other side. And that is the hope"],["1635.919","in the story of"],["1637.32","Ruth,"],["1638.84","redemption. But first we have to deal"],["1641.039","with the debt, the sin and the reason"],["1643.52","for the affliction. So yes, you are"],["1646.48","being or you will experience affliction."],["1650","And this is done often to"],["1652.679","purify, to refine our faith. Prophet"],["1656.32","Zachchariah says, \"I will put a third of"],["1658.72","you into the fire and refine them as one"],["1661.679","refined silver and test them as gold is"],["1664.559","tested. They will call on my name and I"],["1666.96","will answer them and they will say, I"],["1668.88","will say to them, they are my people.\""],["1671.36","And they will say, \"The Lord is my God.\""],["1674.24","You go into the fire, you call on his"],["1676.48","name, and he says, \"Those are my"],["1679.64","people.\" Peter says, \"So that the tested"],["1683.2","genuiness of your faith being more"],["1685.039","precious than gold that perishes, though"],["1687.84","tested by fire, may be found to result"],["1690.24","in praise and glory and honor at the"],["1692.32","revelation of Jesus.\" And then Job tells"],["1694.72","us, \"But he knows the way that I take,"],["1697.279","and when he's tried me, I'll come out as"],["1700.559","gold.\""],["1702.08","So, you're here today. You're going"],["1703.84","through the fire, dealing with the"],["1705.96","affliction. Understand God is using this"],["1709.76","to refine your faith. Don't reject him."],["1712.96","Don't respond like a Limc with more"],["1715.279","disobedience. Don't try to get out of"],["1717.039","the affliction. Trust him to get you"],["1719.039","through it. Trust that he has a plan and"],["1722.559","a"],["1723.559","purpose. Verse number six."],["1726.88","So Naomi arose with her god"],["1729.24","daughter-in-laws that she might return"],["1731.36","from the country of Moab. For she had"],["1733.12","heard in the country of Moab that the"],["1734.96","Lord had visited his people and given"],["1736.24","them bread. Therefore, she went out from"],["1738.559","that place where she was with her two"],["1740.08","daughter-in-laws with her and they went"],["1742.24","to return to the land of Judah. So Naomi"],["1745.6","shows us the first step that we need to"],["1748.32","take. She returns to the land of"],["1751.2","blessing. She returns to the Lord."],["1754.399","Repentance is going in one direction and"],["1758.039","then turning around and going in the"],["1761.679","right direction. You're going one way,"],["1763.76","you realize this is wrong, and you turn"],["1765.84","around and you go the other way. IMC"],["1768.399","went to Moab to find the bread. Naomi"],["1771.44","comes to the conclusion this is a bad"],["1773.279","idea. Everyone's dead here. I need to"],["1776.64","turn around and go back to the land of"],["1780.24","the Lord. Some people would say, \"Well,"],["1783.679","this is what my husband decided. I got"],["1786.08","to respect his"],["1787.96","wishes. This is what my family does. I"],["1791.36","got to be loyal. This is what my church"],["1794.72","denomination taught me to adhere to."],["1797.76","This is what my culture, my upbringing,"],["1800.64","this is what to do. I can't change.\" No."],["1804.48","What we all have to do is put the Lord"],["1808.679","first and follow him and do not let the"],["1812.48","failures of the past, culture, society,"],["1815.84","even your family trap you in sin. Repent"],["1819.919","and turn to the Lord. Take a step of"],["1823.12","faith regardless of what everyone else"],["1825.12","is doing. Yes. Verse number"],["1829.559","eight. Naomi said to her two dear"],["1832.84","daughter-in-laws, \"Go return each to her"],["1835.36","mother's house. The Lord deal kindly"],["1837.2","with you as you've dealt with the dead"],["1838.96","and with me. The Lord grant that you"],["1841.2","will find rest in each of the house of"],["1842.96","her husband. So go get another husband.\""],["1845.279","She kissed them and they lifted up their"],["1847.279","voices and wept. And they said, \"Surely"],["1849.36","we'll return with you to your people.\""],["1851.2","But Naomi said, \"Turn back, my"],["1852.64","daughters. Why will you go with me? Are"],["1856.72","there still sons in my womb that they"],["1859.12","may be your husbands? Turn back, my"],["1860.799","daughters. No, for I am too old to have"],["1863.2","a husband. If I should say, I have hope."],["1866.08","And if I should have a husband tonight"],["1867.76","and bear sons, would you wait till"],["1869.919","they're grown up? Would you restrain"],["1871.52","yourself from h having husbands? No, my"],["1874","daughters, for it grees me very much for"],["1876.32","the sake that for your sake that the"],["1878.64","hand of the Lord has been against me."],["1882.96","So you got to remember that during this"],["1884.559","period of time, your life insurance"],["1887.44","policy, your welfare system, your social"],["1890.64","security, your Medicare, your Medicaid"],["1892.64","was all bundled in your family. You"],["1897.039","needed your family. And this is why sons"],["1900.64","finding wives and continuing the lineage"],["1903.519","was so vital to IMC. He and Naomi"],["1906.48","provided for the sons and in the future"],["1909.36","the sons would provide for them. But"],["1912.32","when they died and there is no"],["1914.279","grandchildren, these three women are in"],["1917.679","a desperate"],["1919.08","situation. It is obvious that Naomi"],["1921.679","loves these"],["1922.679","girls. And she could have banked on that"],["1925.279","that these girls love her, right? She"],["1927.76","could have said, \"Well, these girls are"],["1928.799","very loyal, so they'll take care of me."],["1931.12","They're young. They're beautiful."],["1932.32","They'll remarry and then I'll have a"],["1934.159","family. I'll be okay.\" Now, in Israel,"],["1936.48","the laws of Moses would dictate that the"],["1938.399","family would provide for Naomi. She"],["1940.88","could have expected that in Israel, but"],["1943.84","would that happen in"],["1945.559","Moab? We don't know if that would be the"],["1947.76","case in Moab. If the girls marry"],["1949.679","Moabitete men, perhaps they have no"],["1952.159","interest in providing for the former"],["1954.559","dead husband's"],["1956.76","mother. That's a financial burden. I"],["1959.919","mean, you get your own mother-in-law."],["1961.12","Can you imagine this dead guy's mother,"],["1963.76","too? That's double the mother-in-law."],["1967.519","Naomi's presence would have been a"],["1969.88","deterrent for these girls to find"],["1973","husbands. And these girls on their own,"],["1975.279","they can't provide for her. So out of"],["1976.88","love, Naomi does what's best for them."],["1979.519","So she thinks and she releases them."],["1981.76","Return to your families. Go find"],["1983.2","husbands. You got to move on with your"],["1985.2","lives. You can't stay here with me. That"],["1988.64","was a huge step of faith because Naomi"],["1990.96","is not young and the chances of her"],["1992.399","getting a husband, she already said, is"],["1993.76","like slim to none."],["1996.399","these young girls, the relationship that"],["1998.799","Naomi has with them is really all that"],["2003.039","all that she has of value. Those that"],["2006.24","family right there, those two girls is"],["2007.919","all that she has and she gives it up"],["2010.88","because that would be what's best for"],["2012.24","those girls. So Orpha makes the rational"],["2016.32","decision and she leaves her"],["2017.679","mother-in-law and she returns to her"],["2018.96","family. But it says, \"What does Ruth"],["2020.72","do?\" Verse 14, Ruth clung to"],["2026.2","her and she said, \"Look, your your"],["2029.679","sister-in-law is going back to her"],["2031.039","people and to her gods. Return after"],["2033.84","your"],["2034.919","sister-in-law.\" But Ruth said, \"Entreat"],["2038.159","me not to leave you or go back from"],["2040.159","following after you. For wherever you"],["2042.039","go, I will go. And wherever you lodge, I"],["2045.919","will lodge. And your people will be my"],["2048.72","people. And your God will be my God. And"],["2052","where you die, I will die. And there"],["2054.72","I'll be married. So the Lord do so to"],["2057.52","me. And more also, if anything but death"],["2060.639","parts you and"],["2064.2","me. And that right there is when the"],["2067.28","story turns about being about the sin of"],["2070.839","IMC to being about the faith of"],["2074.679","Ruth. One of the most beautiful"],["2076.8","utterances in all of"],["2078.599","literature. If you need some passages of"],["2080.8","scripture to commit to memory, get that"],["2083.2","one. Where you go, I will go. And where"],["2087.04","you lodge, I will lodge. You can put"],["2088.48","that one right in your wedding, right?"],["2091.119","Your people, my people. Your God, my"],["2093.839","God."],["2095.44","This is Ruth's step of"],["2098.68","faith. Just as Abraham left his father's"],["2102.32","house to go to a land he did not know in"],["2104.96","obedience to"],["2106.2","God. Just as Moses stepped up to Pharaoh"],["2110.16","and declares, \"Thus sayaeth the Lord,"],["2112.32","let my people go.\""],["2115.359","As David confronted the giant and said,"],["2117.68","\"You come against me with sword and"],["2119.599","spear and javelin, but I come against"],["2121.44","you in the name of the Lord Almighty,"],["2124.16","the God of the armies of Israel, whom"],["2126.32","you have defied. And this day the Lord"],["2129.44","will deliver you into our hands. and"],["2132","I'll strike your head off and we will"],["2134.64","cut down your armies and I'll give your"],["2137.76","carcasses to the birds of the of the sky"],["2140.72","and the wild beasts and the whole world"],["2142.4","will know that there's a God in Israel"],["2144.56","and all who gather here will know it is"],["2146.56","not by sword or by spear that the Lord"],["2149.28","saves. The battle is the Lord's and he"],["2152.079","gives you into our hands. As David and"],["2156.72","his friends Shadrach, Meshach, and"],["2158.079","Abedneo replied to King Nebuchadnezzar,"],["2161.359","\"We do not need to defend ourselves"],["2164","before you in this matter. If we are"],["2166.88","thrown into the blazing furnace, the God"],["2169.28","who we serve is able to deliver us from"],["2172.16","it, and he will deliver us from your"],["2175.119","majesty's hand. But even if he does not,"],["2178.56","let it be known, your majesty, we will"],["2181.28","not serve your gods or worship your"],["2184","golden image."],["2186","There comes a time when we have to"],["2188.48","decide will we or will we not take a"],["2192.16","step of"],["2193.8","faith. Will we believe in God and follow"],["2196.56","him even if his way seems like it's"],["2199.2","going to destroy us, ruin us? Will we"],["2203.04","trust him and take a step of faith? Ruth"],["2204.96","was leaving the safety and the"],["2206.88","protection of her people and her nation"],["2209.599","to go with Naomi to a foreign land to an"],["2212.48","uncertain situation. It was only"],["2214.4","offering"],["2215.64","poverty. I can only speculate as to why,"],["2219.599","but it has something to do with what she"],["2222.16","believed about the Lord. Did you catch"],["2226.32","that? In verse number"],["2228.599","17, she in her pledge, she says, \"Your"],["2231.28","people, my people, your God, my God,"],["2234.079","where you die, I will die. I'll be"],["2235.839","buried.\" And then she says, \"The"],["2239.56","Lord,\" what do you observe about that?"],["2243.44","What do you observe about that right"],["2246.44","there? Look at"],["2248.359","it. What's the"],["2251.64","Lord? Somebody sees it, right? It's all"],["2255.2","capitalized. Every letter is"],["2256.8","capitalized. What does that tell"],["2258.92","you? That is the formal name. What?"],["2262.72","Yahweh. Yahweh. That is the name of the"],["2265.839","God of"],["2267.079","Israel. Naomi said, \"Go back to your"],["2269.599","gods. Go back to your gods at Moab.\" and"],["2271.599","she says"],["2273.8","Yahweh the"],["2275.8","Lord. She wasn't going back to the gods"],["2278.8","of Egypt. She wasn't trusting in the"],["2280.72","gods of Canaanite. She was turning to"],["2283.28","Yahweh. And that ought not be overlooked"],["2285.839","because this story is not about learning"],["2288.32","how to have love and loyalty like Ruth."],["2292.4","It's not about being good and good"],["2294.8","things will come to you. Karma and the"],["2297.2","universe will repay you."],["2300.76","vibes. Good vibes. This is specifically"],["2304.8","about our relationship with Yahweh, the"],["2308.079","Lord God of Abraham, Isaac, and Jacob,"],["2312.079","the great I am who was and is and is to"],["2316.8","come. And the reason why we study this"],["2320.2","book because it is the special"],["2322.8","revelation of the one true God, the"],["2326.24","things that he has done and doing and"],["2328.8","wants us to know. And ignoring him and"],["2331.52","rejecting him has brought Israel"],["2334.599","affliction. But trusting him and seeking"],["2337.44","him likewise has ramifications. So let's"],["2341.52","be clear on the theological message of"],["2343.52","the story. It's not be good to your"],["2346.2","mother-in-law even though that would be"],["2348.52","nice and she would think that was"],["2351.8","lovely. Pastor Rob, this was such a easy"],["2355.68","softball that was lobbed up to you. Why"],["2358.16","didn't you just do a nice Mother's Day"],["2360.88","message that we could just say love your"],["2363.119","mothers and your mother-in-laws? Because"],["2364.96","that's not what Ruth is about. It's"],["2367.28","about a step of faith honoring the Lord,"],["2369.92","not moms. Naomi was being afflicted by"],["2373.599","God and she returned to him. And Ruth"],["2376.16","takes a step of faith to follow and"],["2378","trust in"],["2379.56","Yahweh. And then Naomi does a very wise"],["2383.2","thing. She realizes that this was not"],["2386.32","about what she thought was best for"],["2389.56","Ruth. She had already given her wisdom"],["2391.839","and shared her opinion. You know, go"],["2393.599","with your sister. Go back to your family"],["2395.52","and your gods. But after she hears"],["2398.64","Ruth's declaration, Naomi is wise enough"],["2402.8","to shut her mouth and let Ruth come with"],["2406.48","her to the land of Yahweh. Verse 18. And"],["2410.8","when she saw that she was determined to"],["2412.72","go with her, she stopped speaking to"],["2416.76","her. There is a time to talk to stop"],["2420.8","speaking and let people follow the Lord"],["2423.599","as the Holy Spirit is leading them."],["2426.8","us older"],["2429","people speaking to the"],["2431.4","parents, the"],["2434.119","grandparents, all the people that got"],["2436.48","all these opinions about what the young"],["2439.68","people are doing and how they're"],["2441.68","parenting their children and how they're"],["2443.599","organizing their"],["2445.16","lives. We have all these opinions about"],["2448","what they should be doing. You know,"],["2449.839","it'd be better if you would. I think you"],["2452.8","ought to. What we you need to do"],["2456.599","is when our children are trusting in the"],["2459.88","Lord, we need to let God lead them and"],["2463.52","not us try to be the Holy"],["2465.88","Spirit. We need to know when to stop"],["2469.8","micromanaging and treating them like"],["2471.92","children. Let them grow and develop in"],["2474.8","their faith. Let them even have some"],["2477.64","affliction so that their faith can be"],["2480","made gold. and the Holy Spirit can lead"],["2482.88","them. Roose prepared to make a journey"],["2484.88","to the promised land just as Joshua did."],["2488.4","It's going to be challenging. It's going"],["2489.92","to be hard. But God is going to lead her"],["2492.64","through the affliction to a great"],["2495.72","blessing. Verse number"],["2497.88","19. Now the two of them went along. They"],["2500.319","came to Bethlehem and it happened when"],["2501.92","they came to Bethlehem. All the city was"],["2503.68","excited because of them. And the woman"],["2505.119","said, \"Is this not"],["2506.44","Naomi?\" But she said, \"Don't call me"],["2508.839","Naomi. Call me"],["2510.839","Mara. The Almighty has dealt very"],["2513.119","bitterly with me. I went out full and"],["2515.119","the Lord has brought me back empty. Why"],["2516.8","do you call me Naomi? The Lord has"],["2518.8","testified against me. The Almighty has"],["2521.92","afflicted"],["2523.4","me. As we said at the start, God is"],["2526.44","afflicting Naomi."],["2529.48","Why? To bring her back to the promised"],["2533.24","land. And as she returns, she brings"],["2536.88","Ruth with her. And Ruth's got a and"],["2539.599","God's got a plan for Ruth. So, you know"],["2542.56","what's amazing? We see this time and"],["2544.72","time again. When people go through"],["2546.64","trials and afflictions and return to"],["2548.64","God, they often influence other people"],["2551.839","to come with them. People go out there"],["2554.319","and they live their lives in"],["2555.599","disobedience and sin and they hurt"],["2557.04","themselves and finally they repent and"],["2558.72","they return. And when they do that, they"],["2561.119","end up influencing somebody to come out"],["2562.8","of that mess. Somebody who was in that"],["2564.56","mess with them. It's like, \"Oh, well,"],["2566.24","you're going to go that way. Well, I"],["2567.52","might as well give it a try, too. And"],["2569.76","God always has this way of using our"],["2572","pain and brokenness to help someone"],["2574.52","else. People go into the hospital and"],["2578.079","then while they're in there sick and"],["2579.839","suffering, they dis help some"],["2582.64","discouraged person laying in the bed"],["2584.079","beside them learn about Jesus. Some"],["2586.24","exhausted, wore out nurse. They testify"],["2588.56","to them about God's healing power."],["2591.359","People go to jail and they end up"],["2593.68","reaching people with the gospel. So many"],["2596.72","jail ministries happen because some"],["2598.72","disobedient child of God ends up in"],["2600.56","jail, repents of their sin, and then"],["2602.319","they help people in jail find Jesus."],["2604.64","Isn't that amazing? This is how God will"],["2607.359","use something that seems like it's going"],["2609.04","to destroy us and turn it for good. And"],["2612.56","he loves to do that. Through our"],["2614.96","brokenness and weakness and failure, he"],["2617.28","brings glory to his name. And God loves"],["2619.52","to use broken people because in our"],["2621.96","weakness, his strengths are showcased."],["2625.119","And we see this over and over, God using"],["2627.68","the least of these. So here's Ruth, a"],["2630.4","widow, a Moabitete afflicted by God. She"],["2634.96","by all earthly accounts is the least,"],["2638.24","but we're going to see great things that"],["2641.119","God has in store for her. So we close"],["2644.16","with this. Yes, God does afflict us, but"],["2649.92","he has a plan to bring us through it to"],["2653.52","a place of blessing. So, trust him"],["2657.2","through your afflictions. Obey him. Wait"],["2661.28","to see what great things he's going to"],["2663.68","do for you. Amen. Amen. Let's bow in"],["2667.28","prayer. Thank you, Lord Jesus, for the"],["2670.16","story of Ruth, for these examples of"],["2672.8","people who take steps of faith in the"],["2674.64","hardest, darkest times of their life."],["2677.599","And through that pain, they are in the"],["2681.68","fire and yet it purifies them and they"],["2684.319","come out as gold. We pray that everyone"],["2686.8","here today as they will or are going"],["2691.2","through this affliction that they will"],["2693.68","be tested and their faith will shine."],["2696.48","They will call upon you and you will say"],["2699.76","these are my children and they will say"],["2702.56","you are my God. Praying all this in"],["2705.2","Jesus name. Amen. Close you with a"],["2708.88","benediction now unto him that is able to"],["2711.52","keep you from falling and to present you"],["2714.079","faultless before the presence and glory"],["2716.88","with exceeding joy. To the only wise"],["2719.28","God, our savior be glory and majesty,"],["2723.119","dominion and power, both now and forever"],["2726.28","more. Amen. Have a great Mother's Day."]]}]